[
  {
    "subreddit": "datascience",
    "title": "How do I make the most of this opportunity",
    "text": "Hello everyone, I’m a senior studying data science at a large state school. Recently, through some networking, I got to interview with a small real estate and financial data aggregator company with around \\~100 employees.\n\nI met with the CEO for my interview. As far as I know, they haven’t had an engineering or science intern before, mainly marketing and business interns. The firm has been primarily a more traditional real estate company for the last 150 years. Many tasks are done through SQL queries and Excel. Much of the product team at the company has been there for over 20 years and is resistant to change.\n\nThe ceo wants to make the company more efficient and modern, and implement some statistical and ML models and automated workflows with their large amounts of data. He has given me some of the ideas that he and others at the company have considered. I will list those at the end. But I am starting to feel that I’m a bit in over my head here as he hinted towards using my work as a ",
    "url": "https://reddit.com/r/datascience/comments/1n0ep0g/how_do_i_make_the_most_of_this_opportunity/",
    "score": 5,
    "num_comments": 17,
    "date": "2025-08-26",
    "commercial_score": 22,
    "category": "general_frustration",
    "author": "ChubbyFruit",
    "upvote_ratio": 0.6
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Bootstrapped to $50K ARR with a 90% AI workforce (and loving it)",
    "text": "Before you think this is about replacing humans, let me be clear - this is about strategic delegation so I can focus entirely on what actually requires human creativity and relationship building. I've essentially built a team of AI assistants that handle repetitive tasks while I focus on strategy, client relationships, and product decisions.\n\nMy AI team includes Sarah who handles sales assistance through Cluely - she takes meeting notes, provides real-time objection handling, and pulls product information during calls for about $30 per month versus what would be $10K plus benefits for a human sales assistant. Mike manages marketing through Claude and Canva, handling content strategy, social media, and email campaigns for $50 monthly versus $15K for a traditional marketing manager. Lisa runs operations through Zapier and Notion, managing customer onboarding workflows, invoice processing, and reporting for $100 monthly versus $9K for an operations manager.\n\nThe financial impact is dramat",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1nau645/bootstrapped_to_50k_arr_with_a_90_ai_workforce/",
    "score": 20,
    "num_comments": 18,
    "date": "2025-09-07",
    "commercial_score": 20,
    "category": "automation_needs",
    "author": "EscapeNormal_2024",
    "upvote_ratio": 0.63
  },
  {
    "subreddit": "juststart",
    "title": "[AMA] Case Studies: 5, 6, 7-figure Affiliate Content Sites - AI came, destroyed - what works now? (tested and proven model to start new or revive older projects)",
    "text": "Hello Everyone,\n\nOld member here and I published 5, 6, 7-figures affiliate website (and display ads) case studies here. I shared the complete process including niche selection, KW research, content plan, production, backlinks and optimisation.\n\n**However with AI and how search is done now, nothing seems to work now:** affiliate sites, content brands, SEO, content marketing etc. all seems to be dead.\n\n*However, based on 1-2y of recent testing - a different approach to the same model works.* \n\nBy changing your approach, strategy and right infrastructure, you can actually get the same results (if not better) with lesser effort (due to AI).\n\n**The purpose of this post is to share my findings (and hard data) from the past 1-2 years so you can potentially start new projects, revive older ones, grow traffic, have successful exits, passive income, generate leads for local business or even sell digital or physical products/services through organic traffic.**\n\nWhile it doesn't apply to all cases",
    "url": "https://reddit.com/r/juststart/comments/1l2gv1x/ama_case_studies_5_6_7figure_affiliate_content/",
    "score": 46,
    "num_comments": 45,
    "date": "2025-06-03",
    "commercial_score": 19,
    "category": "integration_problems",
    "author": "jamesackerman1234",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Product-market fit feels like a myth until it hits you like a truck: How to recognize it, measure it, and not fool yourself into thinking you have it (framework with brutal self-assessment)",
    "text": "Product-market fit is the most talked about and least understood concept in startups... I thought I had it 3 different times with TuBoost before I actually did, and the difference is night and day\n\nEveryone talks about PMF like it's this mystical moment of enlightenment, but really it's more like \"holy shit, I can't keep up with demand and my biggest problem is scaling, not convincing people to want this thing.\"\n\n**The brutal truth about product-market fit:** Most founders mistake early traction for PMF and then wonder why growth stalls. Real PMF isn't about getting some customers - it's about customers pulling your product out of your hands faster than you can build it.\n\n**My PMF false alarms (learn from my delusions):**\n\n**False Alarm #1: The \"early adopter\" mistake**\n\n* Metrics: 20 signups, $200 revenue, 5-star reviews\n* My delusion: \"People love this! We have PMF!\"\n* Reality check: Early adopters will try anything. They're not your market.\n* Red flag: Growth required constant hustl",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n458pe/productmarket_fit_feels_like_a_myth_until_it_hits/",
    "score": 6,
    "num_comments": 5,
    "date": "2025-08-30",
    "commercial_score": 19,
    "category": "integration_problems",
    "author": "CremeEasy6720",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "startups",
    "title": "Share your startup - quarterly post",
    "text": "Share Your Startup - Q4 2023\n\n[**r/startups**](https://www.reddit.com/r/startups/) **wants to hear what you're working on!**\n\nTell us about your startup in a comment within this submission. Follow this template:\n=====================================================================================\n\n​\n\n*   **Startup Name / URL**\n*   **Location of Your Headquarters**\n    *   Let people know where you are based for possible local networking with you and to share local resources with you\n*   **Elevator Pitch/Explainer Video**\n*   **More details:**\n    *   What life cycle stage is your startup at? (reference the stages below)\n    *   Your role?\n*   **What goals are you trying to reach this month?**\n    *   How could [r/startups](https://www.reddit.com/r/startups/) help?\n    *   Do **NOT** solicit funds publicly--this may be illegal for you to do so\n*   **Discount for** [r/startups](/r/startups) **subscribers?**\n    *   Share how our community can get a discount\n\n​\n\n\n\\------------------------",
    "url": "https://reddit.com/r/startups/comments/1lxc97s/share_your_startup_quarterly_post/",
    "score": 63,
    "num_comments": 485,
    "date": "2025-07-11",
    "commercial_score": 16,
    "category": "general_frustration",
    "author": "julian88888888",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Small business owners - how do you keep track of all your contacts and follow-ups?",
    "text": "This might be a basic question but I'm struggling with contact management as my business grows.\n\nI started with just keeping notes in my phone and Gmail, but now I have potential clients, current customers, vendors, partners, etc. and I'm losing track of where conversations stand and when to follow up.\n\nI've been looking into CRM solutions but most seem either too complex or too expensive for where I'm at. My co-founder suggested using Micro.so which integrates with Gmail which is interesting since that's where all my conversations happen anyway, but I'm still researching.\n\nHow did you handle this transition? Did you go straight to a full CRM or find simpler solutions that worked? Would love to hear what worked (or didn't work) for your business size.",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n3ernt/small_business_owners_how_do_you_keep_track_of/",
    "score": 47,
    "num_comments": 40,
    "date": "2025-08-29",
    "commercial_score": 15,
    "category": "integration_problems",
    "author": "Ok-Doubt8429",
    "upvote_ratio": 0.98
  },
  {
    "subreddit": "ProductManagement",
    "title": "How do you automate your PM work when you constantly forget things and go blank in meetings?",
    "text": "I need to fix my two biggest weaknesses before they become career killers.\n\n**My actual problems:**\n\n1. I forget everything. Previous manager called me out multiple times for dropping balls. I’ll commit to something in a meeting and completely forget by afternoon. No amount of “I’ll do better” has fixed this. 2. I go blank when asked unexpected questions. Someone asks “what’s the status of X?” and even if I know it, my mind freezes. I just sit there silent. It’s brutal. \n\n**My setup:** \n\n• Company gives us ChatGPT Team subscription with plugins \n\n• Microsoft everything (Teams, Outlook, SharePoint) \n\n• Can use Notion for personal organization \n\n• Can’t use external tools like Fireflies (security policy) \n\n**What I’m trying to automate:** \n\n•Meeting prep so I never walk in cold \n\n• Transcript processing so nothing gets lost \n\n• Action item tracking so I stop dropping balls \n\n• Some system that tells me what I should be doing RIGHT NOW \n\n• Quick answers when my brain freezes in meetings I",
    "url": "https://reddit.com/r/ProductManagement/comments/1n36z4s/how_do_you_automate_your_pm_work_when_you/",
    "score": 94,
    "num_comments": 116,
    "date": "2025-08-29",
    "commercial_score": 15,
    "category": "scaling_issues",
    "author": "Economy_Television81",
    "upvote_ratio": 0.85
  },
  {
    "subreddit": "wordpress",
    "title": "Start Here: Essential Resources & FAQs",
    "text": "The idea for this post came up in [this thread](https://www.reddit.com/r/Wordpress/comments/1cpme25/mods_can_this_subreddit_implement_a_minimum_karma/) by wiz to avoid the number of similar questions we get around here and to serve as a megathread for any/all questions of a similar nature. I will collate any and all valuable information by other users and update this thread as we go. Seasoned users please pitch in with anything that should be included.\n\nMany thanks to u/BlueSix for assisting in putting this together.\n\nWhat's covered:\n\n* The .COM vs .ORG Issue\n* Hosting - Where should I host?\n* Performance - Why is my site slow / Pagespeed score appalling?\n* Building Your WordPress Site: Is X builder better than Y? What is the best theme? Etc.\n* Updates\n* Backups\n* Security\n* Combating spam comments, contact form submissions & bot registrations\n* Hacks/Malware: Err guys help, there’s some weird stuff on my front end\n* Resources to learn WordPress\n* Where to find plugins/add feature X?\n*",
    "url": "https://reddit.com/r/Wordpress/comments/1cqlvod/start_here_essential_resources_faqs/",
    "score": 148,
    "num_comments": 63,
    "date": "2024-05-13",
    "commercial_score": 15,
    "category": "missing_features",
    "author": "Acephaliax",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "Entrepreneur",
    "title": "How do I sell my custom home building business?",
    "text": "I’m a 35M and have built a custom home building business that does ~$10M revenue annually with a team of 5 including myself. I have been thinking a lot this year about how to scale the business in a direction where I can eventually sell it to someone. \n\nDo private equity firms or investors buy smaller home building businesses? Is there a direction I should grow the business to make it appealing to a buyer? \n\nRight now, one of my employees runs all the operations but I’m heavily involved in the sales side and tied to the brand of the business locally. And our customer base is usually 5-10 clients per year due to the custom aspect of the business. ",
    "url": "https://reddit.com/r/Entrepreneur/comments/1mz6gx6/how_do_i_sell_my_custom_home_building_business/",
    "score": 15,
    "num_comments": 53,
    "date": "2025-08-24",
    "commercial_score": 14,
    "category": "general_frustration",
    "author": "babingababy",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "startups",
    "title": "How to split equity between 3 founder? I will not promote",
    "text": "Hi guys, this is more of a general question but me and my friends are all new to this and I'd like to hear from people who went thru similar situation.\n\n3 of us started a company together, we're friends. CEO had the idea, who then approached the friend who was appointed as COO and they approached me to be the CTO and build up the app. I did build the app, and we decided to discuss the equity distribution once we've worked a bit and seen how much we contribute.\n\nNow, we had the discussion last night. The results were: CEO 40%, CTO 30% and COO 30%. We're starting with $5000 initial investment where I don't pay anything, CEO pays $2750 and COO pays $2250. I was happy with the distribution, somewhat, but then again,\n\n1. I built the entire app. It'd probably cost them more than $5000 to make the MVP of an food tech app similar to (for the argument's sake, uber eats)\n2. The CEO did have the idea, so I don't mind the CEO getting bigger share of the pie.. but the COO isn't contributing much ye",
    "url": "https://reddit.com/r/startups/comments/1mzg3et/how_to_split_equity_between_3_founder_i_will_not/",
    "score": 17,
    "num_comments": 70,
    "date": "2025-08-25",
    "commercial_score": 13,
    "category": "integration_problems",
    "author": "cryptooastronaut",
    "upvote_ratio": 0.84
  },
  {
    "subreddit": "smallbusiness",
    "title": "Best alternative to DocuSign for unlimited envelopes + team use?",
    "text": "We are a small team of about 5 people and currently send out around 4 to 6 envelopes a day. We expect that number to grow to 10 to 25 a day in the near future.\n\nDocuSign’s pricing structure is just too expensive for what we need and does not make sense for our volume. We are looking for an e-signature solution that offers unlimited envelopes and works well for multiple team members.\n\nI have been looking at BoldSign and it looks promising, but I would like to hear what others are using. What are the best affordable and reliable DocuSign alternatives that can scale with this kind of usage?\n\nThanks in advance.",
    "url": "https://reddit.com/r/smallbusiness/comments/1n1npuf/best_alternative_to_docusign_for_unlimited/",
    "score": 1,
    "num_comments": 4,
    "date": "2025-08-27",
    "commercial_score": 13,
    "category": "cost_problems",
    "author": "NewCryptographer8977",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "juststart",
    "title": "2,300% Traffic Increase with AI in Just a Few Months. How to Win in the AI ​​Era.",
    "text": "I recently came across a fascinating case study from the agency **The Search Initiative**. Their client, a manufacturer in the industrial sector, had solid rankings in traditional Google results but was completely invisible in AI Overviews, letting their competition capture all the new traffic.\n\nAfter implementing a new strategy focused on AI visibility, they achieved an incredible result: a **2,300% increase in monthly traffic from AI platforms like ChatGPT and Gemini**. What's more, the company started appearing in AI-generated answers for 90 key phrases, up from an absolute zero.\n\nTheir strategy involved:\n\n* adapting their content structure for AI readability by using clear, concise language and logical headings.\n* optimizing for conversational queries by answering the full, natural questions that users ask.\n* strengthening content credibility (E-E-A-T) by publishing expert-driven materials and acquiring authoritative backlinks.\n* actively managing their brand reputation in AI by mo",
    "url": "https://reddit.com/r/juststart/comments/1mx885a/2300_traffic_increase_with_ai_in_just_a_few/",
    "score": 8,
    "num_comments": 9,
    "date": "2025-08-22",
    "commercial_score": 13,
    "category": "automation_needs",
    "author": "Odd-Raspberry1063",
    "upvote_ratio": 0.65
  },
  {
    "subreddit": "juststart",
    "title": "My current GEO playbook (used by 10M+ clients)",
    "text": "**1. Identify prompts**\n\nBuild a list of 20–50 prompts your target customers might ask. You can do this by:\n\nA. Asking ChatGPT to generate suggestions.\n\nFor example, ask AI to give you some considerations before recommending your service or product. E.g.: \"What considerations are you taking into account when recommending the best dog food brand?\"\n\nIt will say something like quality, price, sustainability, shipment speed, etc.\n\nTurn these considerations into prompts: \"Which dog food brand makes the most quality food?\" \"Which dog food brand has the fastest shipping time?\" etc.\n\nB. Use a reasoning model.\n\nAsk multiple AI tools what they know about your brand. Look at the things AI checks (or what keywords they add) when “thinking.” For example, you will see what AI is looking at when answering a question about your brand, inserting keywords into a search. Because when thinking, ChatGPT looks for answers on the web and it inserts keywords. Optimize for these keywords and turn them into que",
    "url": "https://reddit.com/r/juststart/comments/1mew4i0/my_current_geo_playbook_used_by_10m_clients/",
    "score": 17,
    "num_comments": 9,
    "date": "2025-08-01",
    "commercial_score": 13,
    "category": "workflow_problems",
    "author": "Purple-Asparagus-887",
    "upvote_ratio": 0.85
  },
  {
    "subreddit": "ProductManagement",
    "title": "Understand the business more than your bosses and their friends.",
    "text": "I can’t stress this enough: for every nine people who back your vision, there’s one detractor who just wants to piss on your cornflakes and measure their dicks against yours. \n\nSenior folks are often stuck in their own little kingdoms, with no clue about what’s really happening outside their bubble. When you join a company, talk to as many people as you can... Senior... junior, and cross-functional. Book 30-minute chats and introduce yourself. It’s easy, and when you’re new, most people will find it hard to say no. Pick and choose wisely. \n\nSpend your first few months learning everything about the business  and writing it down. Know the facts, back your insights with data, and get familiar with the “as-is” processes. When you understand the environment better than the average Joe, you’ll be grateful in those tough, high-pressure conversations where stakeholders are only trying to push your button. Know your shit. \n\nWhen crunch time comes, the people you connected with early will become",
    "url": "https://reddit.com/r/ProductManagement/comments/1n7o058/understand_the_business_more_than_your_bosses_and/",
    "score": 252,
    "num_comments": 20,
    "date": "2025-09-03",
    "commercial_score": 13,
    "category": "integration_problems",
    "author": "nicestrategymate",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "slack",
    "title": "Looking for an Internal Slack Analytics/Summary Solution (HealthTech, No Third-Party Apps, Gemini AI Available)",
    "text": ":\nI work in a HealthTech company where our Slack channels have a lot of people and constant activity — multiple discussions, issue reports, and general chatter happening at the same time.\n\nThe challenge I’m facing is that it’s hard to track:\n\t•\tWhat issues have occurred in the past\n\t•\tWhat kinds of discussions took place\n\t•\tAny recurring themes or patterns\n\nI’d like to have some sort of analytics or insight tool that can:\n\t•\tAutomatically summarize or analyze channel activity every 7 days\n\t•\tOr provide an on-demand summary whenever I need it\n\nConstraints:\n\t•\tThis is a HealthTech environment, so our IT/security teams usually do not allow third-party apps or SaaS integrations.\n\t•\tWe do have access to Google’s Gemini AI (but not ChatGPT).\n\t•\tIdeally, the solution should run internally, without sending sensitive data to unapproved external services.\n\nWhat I’m looking for:\n\t•\tIdeas for how to set up a secure, in-house bot or workflow to collect messages, process them with Gemini, and post s",
    "url": "https://reddit.com/r/Slack/comments/1mpwuuu/looking_for_an_internal_slack_analyticssummary/",
    "score": 2,
    "num_comments": 4,
    "date": "2025-08-14",
    "commercial_score": 13,
    "category": "missing_features",
    "author": "PossibilityOwn2716",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "indiehackers",
    "title": "Looking for feedback: My SaaS idea – Build a custom team of AI agents",
    "text": "I’m working on a SaaS product idea and would love your feedback.\n\nThe concept: small businesses (or individuals) can **create their own team of AI agents**, similar to hiring employees but in software. Each agent can be assigned a specific role (e.g., marketing assistant, customer support rep, analyst) and given access to tools or data to do the job.\n\nKey features I’m building:\n\n* **1:1 chats and calls** with individual AI agents\n* **Group calls** with multiple AI agents to simulate real team meetings\n* **Task assignment & automation**, where agents collaborate like a real team to get work done\n\nThe goal is to help businesses automate their work in a more “human-like” way—building a team of specialized AI agents instead of buying multiple disconnected tools or paying for expensive services.\n\nI’d love to hear:\n\n1. Do you think this idea has market fit?\n2. What pain points do you see it solving (or not solving)?\n3. Are there similar products you’ve come across already?",
    "url": "https://reddit.com/r/indiehackers/comments/1mug3it/looking_for_feedback_my_saas_idea_build_a_custom/",
    "score": 4,
    "num_comments": 9,
    "date": "2025-08-19",
    "commercial_score": 12,
    "category": "integration_problems",
    "author": "No-Examination-1583",
    "upvote_ratio": 0.84
  },
  {
    "subreddit": "ProductManagement",
    "title": "6 things I learned building location features that users care about",
    "text": "Most of what we built in the early days was garbage. Cool demos, terrible user experience. I wish someone had informed me about this before I dedicated months to developing location features which turned out to be useless to users.\n\n1. Battery drain will kill your feature faster than bugs\n\nYou can have the most accurate geofencing in the world, but if users start complaining about battery life, you're done.The entire location initiative has been canceled because of battery complaints.\n\nThe thing is, most location SDKs are power-hungry monsters.We switched to something more efficient and immediately saw our app store reviews improve.\n\nwhat to do today: If you're building location features, test battery impact on older devices. Not just the latest iPhone.That 3-year-old Android your users actually have.\n\n2. Close enough isn't close enough\n\nNative iOS geofences are 100+ meters accurate.The plan seems acceptable at first until you notice it covers half of a city block. We had users getting",
    "url": "https://reddit.com/r/ProductManagement/comments/1n90iko/6_things_i_learned_building_location_features/",
    "score": 116,
    "num_comments": 11,
    "date": "2025-09-05",
    "commercial_score": 12,
    "category": "cost_problems",
    "author": "No-Marionberry-8801",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "Entrepreneur",
    "title": "The Food Delivery War That’s Shaking China",
    "text": "Alright, so yesterday I saw a video about the big competition between three major Chinese platforms: Taobao, Meituan, and Jingdong. It was interesting, so I’ll explain it simply. \n\nIf you’re in China, you probably know that food delivery apps are really competitive. A while back, there were two main players: Meituan, which was leading, and Eleme, which was struggling a bit. Then, around April, Meituan introduced a new feature called “Flash Purchase” to challenge Jingdong. Jingdong responded by saying, “Food delivery looks appealing, and Meituan has it all. Let’s get involved!”\nJingdong, mainly an e-commerce platform, launched its own food delivery feature called “Instant Delivery” and included a lot of discount vouchers. I remember getting milk teas for just 1 yuan- crazy, right? Meituan was relaxed, thinking, “Our customers are loyal. Let’s see how long Jingdong can keep losing money.”\n\nThen, Taobao decided to join in. In July, Alibaba, Taobao’s parent company, announced it would inve",
    "url": "https://reddit.com/r/Entrepreneur/comments/1naouyb/the_food_delivery_war_thats_shaking_china/",
    "score": 77,
    "num_comments": 6,
    "date": "2025-09-07",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "ducfilan",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "SaaS",
    "title": "The hardest part is figuring out how to generate traffic, how do you do it ?",
    "text": "Been spinning my wheels on landing my first customers for months. You know the struggle, limited budget, analysis paralysis, and every \"expert\" telling you to be everywhere at once.\n\nJust discovered this systematic approach that's honestly game-changing. Here's the exact framework I'm now implementing:\n\nThe process that's working:\n\n1. Select and prioritise just TWO channels that can actually move the needle for your specific audience.\n\n2. Focus on generating demand first through Prospect Type Targeting Campaigns like social media post engagement (sponsored or non-sponsored) and/or Website Traffic Objective Ad Campaigns.\n\n3. Drive engagement and relevant traffic through custom audience segments from post-engagement campaigns and informational/educational keyword targeting from website traffic campaigns.\n\n4. Use custom audience targeting based on specific interests and traits, plus keyword queries that show genuine interest in your type of product. \n\n5. This stage targets people who are ",
    "url": "https://reddit.com/r/SaaS/comments/1n3daee/the_hardest_part_is_figuring_out_how_to_generate/",
    "score": 1,
    "num_comments": 0,
    "date": "2025-08-29",
    "commercial_score": 11,
    "category": "cost_problems",
    "author": "Impossible_Music9735",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "5 years bootstrapping a GDPR friendly Calendly alternative to 28k users and profitability",
    "text": "Five years ago I was freelancing in Cologne and booking calls with clients across Europe. Like many others, I used Calendly.\n\nThe problem: my German clients kept asking if it was GDPR safe. After some digging, I found out the CLOUD Act still applies even if US SaaS hosts in the EU. For many EU companies, that made it a legal risk.\n\nInstead of convincing clients to accept the risk, I decided to build the EU-owned version myself. That is how meetergo was born.\n\n**The journey**\n\n* **2019:** MVP with basic booking links, fully hosted in Frankfurt, owned by a German company\n* **2020:** Added qualification forms to pre-filter leads and a simple routing system for teams\n* **2021:** Closed first enterprise deal with a major pharmacy chain in Germany, growing MRR from to €3k\n* **2022:** Introduced skill based routing, on-site data capture for field workers, and integration with CRMs\n* **2023:** Crossed €10k MRR and expanded into energy, telecom, and real estate sectors. Passed 28,000 total user",
    "url": "https://reddit.com/r/SaaS/comments/1mn9g7h/5_years_bootstrapping_a_gdpr_friendly_calendly/",
    "score": 3,
    "num_comments": 5,
    "date": "2025-08-11",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "drey234236",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "I have created an open-source platform as an alternative to HubSpot and Zoho.",
    "text": "I am developing an open-source, all-in-one business management software called Opensyte, which aims to serve as an alternative to HubSpot and Zoho. I have completed about 40% of the features in just one month.\n\n**What sets Opensyte apart from HubSpot and Zoho?**\n\n\\- **Simplicity**: Opensyte is much simpler to use, with all features consolidated in one location, making it both easy and quick to navigate.\n\n\\- **User-Friendly Interface:** The user interface of Opensyte is distinctly different from other business management platforms. All features are organized in a sidebar, allowing users to switch between them effortlessly. Everything is clearly laid out, so you don't need to be an expert to use the platform!\n\n\\- **User Management & Access Control:** I have put in significant effort to ensure that this feature stands out from those of other platforms. Our User Management & Access Control system is highly customizable. You can create custom roles with predefined permission sets and manage",
    "url": "https://reddit.com/r/SaaS/comments/1n4qvnq/i_have_created_an_opensource_platform_as_an/",
    "score": 2,
    "num_comments": 0,
    "date": "2025-08-31",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "dagermohamed2",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "smallbusiness",
    "title": "How to respond to prospective customers who say you're \"too expensive\"?",
    "text": "I'm a personal chef, and it surprises me every time a prospective client reaches out and then says the cost is \"too expensive.\"  My pricing is listed on my website, and my $50/hour rate is on the lower end of what New York City-based personal chefs charge ($50-$75/hour). My hourly rate makes it possible for me to pay my bills, but I am by no means enjoying a luxurious life myself.  By contrast, my busy seasons make it possible for me to survive my slow seasons.\n\nWhen you have a potential client decline working with you and gripe about the price, how do you respond?  In the past, I've responded with grace, i.e. \"No worries, thanks for reaching out!\"\n\nBut these folks stick with me.  They're reaching out about a service that is, by its very nature, a luxury offering; the clients who have complained about my prices live in the most expensive New York City neighborhoods (West Village, Upper West Side, Chelsea, where a 2 bedroom will put you back $7,000/month or more). I've noticed a direct ",
    "url": "https://reddit.com/r/smallbusiness/comments/1n3jlls/how_to_respond_to_prospective_customers_who_say/",
    "score": 277,
    "num_comments": 308,
    "date": "2025-08-29",
    "commercial_score": 11,
    "category": "cost_problems",
    "author": "LizWins1818",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "smallbusiness",
    "title": "Customer asked for something that doesn’t exist, so I had to figure out how to make it exist",
    "text": "I run a small custom printing business. Most jobs are routine, menus, window decals, basic signage. But a few months ago, a customer came in wanting signage that could be written on with chalk, erased cleanly, but also survive outdoor weather for years without fading or deteriorating.  \n  \nSeemed simple enough until I started sourcing.  \n  \nEvery supplier I contacted said it was impossible. Chalk-friendly surfaces aren’t weatherproof. Weatherproof surfaces don’t work with chalk. Pick one or the other.  \n  \nThe customer was willing to pay premium prices and wait for development time, so I decided to treat it as a research project rather than just saying no.  \n  \nStarted reaching out to material manufacturers directly instead of going through distributors. Most said no. Dug through Alibaba, and found a company in South Korea that makes specialty coatings for industrial applications, factory labels, shipping containers, that kind of thing. They’d never considered consumer signage, but the",
    "url": "https://reddit.com/r/smallbusiness/comments/1mnzhjt/customer_asked_for_something_that_doesnt_exist_so/",
    "score": 201,
    "num_comments": 31,
    "date": "2025-08-12",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "Rare_Tackle6139",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "smallbusiness",
    "title": "Looking for reliable 3PL partners, any recommendations?",
    "text": "My small business is growing (finally!) and we’re at the point where outsourcing fulfillment makes a lot of sense. I’ve been looking into 3PL options, but the space feels kind of overwhelming and filled with companies that cater more to enterprise clients.\n\nHas anyone here had good experiences with a 3PL that works well with small-to-mid-sized e-commerce stores? We’re based in the U.S., and most of our customers are also here, so ideally we’d like a partner that has transparent pricing, quick turnaround on getting inventory ready (ideally within a couple of days), integrates smoothly with platforms like Shopify or Amazon, and offers reliable support without enterprise-level costs.\n\nWould love to hear who’s helped you streamline fulfillment without costing an arm and a leg",
    "url": "https://reddit.com/r/smallbusiness/comments/1msudlf/looking_for_reliable_3pl_partners_any/",
    "score": 5,
    "num_comments": 40,
    "date": "2025-08-17",
    "commercial_score": 11,
    "category": "integration_problems",
    "author": "jopez604",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "A 1-year solo online store owner feeling stuck and needs your thoughts",
    "text": "Hi friends, I’ve been running my small online store for a whole year. In the first year, I mainly tested different products and strategies with a focus on learning marketing at a controllable cost. After a year of exploring, I think I may have finally found a potential niche market, so I decided to start building my own brand from scratch.\n\nEverything seems reasonable so far, but I’m facing a new challenge. Before, I could spend a whole day building a store, learning GA4 or Google Ads, without feeling anxious. Now, focusing on upgrading my page based on day-to-day Ads data for long periods makes me feel extremely anxious.\n\nAt this stage, I feel like what I really need is more communication with people — learning about customers and business in a more open way — rather than spending long hours alone on the page.\n\nI’m not sure if this is the right approach. For those who have gone through a similar period, do you think focusing on open communication is truly the most valuable thing at th",
    "url": "https://reddit.com/r/ecommerce/comments/1n95rqc/a_1year_solo_online_store_owner_feeling_stuck_and/",
    "score": 15,
    "num_comments": 32,
    "date": "2025-09-05",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "squirrelpui",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "marketing",
    "title": "How to navigate being a 1-person marketing team in a chaotic startup?",
    "text": "I’m looking for some perspective from others who’ve been in similar shoes. Sorry, this will be a bit of a rant but I need some input from people who actually know whats normal.\n\nI’m a one-person marketing team at a fast-growing tech startup. On paper, it’s exciting: there’s budget, freedom to experiment, and I’m not afraid of little-to-no direction. But the dynamics are messy, and I’m struggling with how to position myself.\n\n* **Reporting lines are weird.** I report to the Chief of People (because “the CEO has no time”). She’s involved in everything (leadership team, finances, etc.) and pushes hard without fully understanding what I do. Small things she cares about, big-picture she doesn’t. If I explain too much, I’m “too detailed.” If I don’t, she wants more. She pushes for things sooner. I get it, but why is she the one pushing? She doesn't understand anything I do? Who makes the rules here, her or the CEO or the investors or sales?  She wants to be involved everywhere, but also not ",
    "url": "https://reddit.com/r/marketing/comments/1mx840c/how_to_navigate_being_a_1person_marketing_team_in/",
    "score": 41,
    "num_comments": 35,
    "date": "2025-08-22",
    "commercial_score": 11,
    "category": "automation_needs",
    "author": "Baybeli",
    "upvote_ratio": 0.98
  },
  {
    "subreddit": "digital_marketing",
    "title": "The Digital Marketing Industry is in Chaos and I love It.",
    "text": "Every..single...day I spend most of my mornings deleting garbage b2b cold emails, spammy LinkedIn messages, lazy outreach asking me to pay for services, etc. Every channel, everywhere, is filled with the next great AI tool or agency roadmap to 100x your MRR.\n\nThe entire industry is getting flipped upside down with the rise of AI and new software automation. Everyone is now an expert. But the truth is, the majority of what you see online is fake, written through prompts by users who don't actually understand the details about which they're talking. \n\nIt's enough to make most people run away. So why do I love it? \n\nBecause what I love about the industry and the reason I have been doing the work for over 10 years has nothing to do with me and everything to do with my ability (and team) to use our combined skills to support clients. Their goals, their mission, full stop. Only then can I succeed. It's validating in so many ways.\n\nLook around online. What you'll find is self-serving, grandio",
    "url": "https://reddit.com/r/digital_marketing/comments/1n8f0hk/the_digital_marketing_industry_is_in_chaos_and_i/",
    "score": 108,
    "num_comments": 39,
    "date": "2025-09-04",
    "commercial_score": 11,
    "category": "scaling_issues",
    "author": "gorillaagency",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "indiehackers",
    "title": "5 years bootstrapping a GDPR friendly Calendly alternative to 28k users and profitability",
    "text": "Five years ago I was freelancing in Cologne and booking calls with clients across Europe. Like many others, I used Calendly.\n\nThe problem: my German clients kept asking if it was GDPR safe. After some digging, I found out the CLOUD Act still applies even if US SaaS hosts in the EU. For many EU companies, that made it a legal risk.\n\nInstead of convincing clients to accept the risk, I decided to build the EU-owned version myself. That is how meetergo was born.\n\n**The journey**\n\n* **2019:** MVP with basic booking links, fully hosted in Frankfurt, owned by a German company\n* **2020:** Added qualification forms to pre-filter leads and a simple routing system for teams\n* **2021:** Closed first enterprise deal with a major pharmacy chain in Germany, growing MRR from to €3k\n* **2022:** Introduced skill based routing, on-site data capture for field workers, and integration with CRMs\n* **2023:** Crossed €10k MRR and expanded into energy, telecom, and real estate sectors. Passed 28,000 total user",
    "url": "https://reddit.com/r/indiehackers/comments/1mn9f2b/5_years_bootstrapping_a_gdpr_friendly_calendly/",
    "score": 14,
    "num_comments": 8,
    "date": "2025-08-11",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "drey234236",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "indiehackers",
    "title": "Building an open-source AI browser alternative to Perplexity/Firecrawl - lessons from 8 months of indie hacking",
    "text": "Hey fellow indie hackers! 👋\n\n\n\nBeen lurking here for months while building something that started as a personal frustration and turned into what might be a useful open-source tool for our community.\n\n\n\n\\*\\*The problem that got me started:\\*\\*\n\nAs a CS student working on various projects, I was constantly dealing with broken web scrapers. Every time a site updated their layout, my scrapers would fail. Companies like ScrapingBee and Firecrawl charge $50-200/month for what should be accessible to developers everywhere.\n\n\n\n\\*\\*What I learned building in the open:\\*\\*\n\n\\- Started with traditional DOM parsing (broke constantly)\n\n\\- Switched to AI vision approach (Google Gemini sees pages like humans do)\n\n\\- Realized the real need isn't just scraping - it's natural language browser automation\n\n\n\n\\*\\*The indie hacker journey from Bangladesh:\\*\\*\n\n\\- Limited budget meant every API call had to count\n\n\\- Time zone differences made community engagement challenging  \n\n\\- But global perspective help",
    "url": "https://reddit.com/r/indiehackers/comments/1mow4f9/building_an_opensource_ai_browser_alternative_to/",
    "score": 1,
    "num_comments": 0,
    "date": "2025-08-13",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "ai_naymul",
    "upvote_ratio": 0.67
  },
  {
    "subreddit": "PowerBI",
    "title": "Looking for One-Time Power BI Consultant/Assistance",
    "text": "I work for a small financial planning firm and we're looking to integrate Power BI with our Excel models to create some more cutting-edge deliverables to show to clients. I have no experience with Power BI and have been trying to teach myself, but figured it's probably worth the money to hire someone to show me how to model what I'm trying to do rather than wasting man hours fumbling around and trying to do it myself. I'm looking for a verified, cost-effective group that's willing to meet for 30-60 minutes so that I can explain the end result I'm trying to achieve and either have them show me how to do it, or take it over themselves to get to the end result in mind.\n\nI believe the project would be fairly simple to anyone who has experience with Power BI and could probably be completed by that person within an hour. I just need to get in contact with the right person/team that fits the bill.\n\nI've looked at the Microsoft Power BI Partners site and it all looks to be for large Fortune 50",
    "url": "https://reddit.com/r/PowerBI/comments/1n0z50i/looking_for_onetime_power_bi_consultantassistance/",
    "score": 7,
    "num_comments": 13,
    "date": "2025-08-26",
    "commercial_score": 11,
    "category": "integration_problems",
    "author": "TheRealSyndicate",
    "upvote_ratio": 0.89
  },
  {
    "subreddit": "startups",
    "title": "How do you go about finding the right cofounders? I will not promote.",
    "text": "Hi all,\n\nI am a 47-year-old engineer with about 25 years in software development. For most of my career I have been the person shoveling data, cleaning up processes, and building the glue that keeps businesses running. It is not flashy work, but I enjoy it, especially when it removes bottlenecks for small companies that do not have big IT budgets.\n\nNow I am exploring the idea of turning that into a business. The model would be consulting-driven: Sit down with small businesses, map out how they really operate, help them spot inefficiencies, and then create lightweight solutions (automations, tailored CRMs, or other tools) that fit their processes instead of overwhelming them. My ideal customer knows he has to do something to be more effective and knows his business better than anybody else.\n\nWhere I am weaker is sales and outreach. I can deliver value once I am in the room, but I have never been the person who gets into the room. I am a bit of an introvert. I am very good at talking abo",
    "url": "https://reddit.com/r/startups/comments/1n3icc6/how_do_you_go_about_finding_the_right_cofounders/",
    "score": 16,
    "num_comments": 41,
    "date": "2025-08-29",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "biocin",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "startups",
    "title": "Built a no-budget B2B sales tool (looking for validation- I will not promote)",
    "text": "Hi folks,\n\nI wanted to share a scrappy project I hacked together.\n\n**Problem:** Sales teams spend way too much time on **manual research** (LinkedIn, Google, company sites, CRMs) before they even reach out.\n\n**Solution:** I built a tool (with no marketing budget, just hacked together) that **aggregates prospect/account info and gives a quick analysis** in one view. To summarize, this tool specifically helps with,  \n  \n1. **Total Addressable Market (TAM) discovery:** quickly size and identify the right markets.\n\n2. **Company intelligence**: insights on revenue, industry, pain points, and competitor comparisons.\n\n**3. Persona insights:** AI-generated profiles of decision-makers, including communication tips.\n\n**Goal:** I’m **not trying to sell it yet**. I just want feedback from early testers to see if this is worth pursuing or if I’m barking up the wrong tree.\n\nIf you’re in B2B sales (or have friends who are), would you find this useful? Happy to share the beta link with anyone curious.",
    "url": "https://reddit.com/r/startups/comments/1n4r8u8/built_a_nobudget_b2b_sales_tool_looking_for/",
    "score": 3,
    "num_comments": 38,
    "date": "2025-08-31",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "khocha_powa_86",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "freelance",
    "title": "I filed a legal claim after being unpaid for work I completed — and I’m done staying silent about how women in creative roles are treated.",
    "text": "This is a bit of a long story, but here’s the short version:\n\nI’m a creative professional (designer, strategist, art director) with 20+ years of experience. I was hired (by a friend of 25 years) last year by a mid-size company in the film and television production industry to manage their internal and external art direction, branding and design. I delivered a ton of new assets … including photography, rate cards, catalog layouts, spec sheets, logos— the calibre of work that makes a business look polished and credible. It took almost a year to put all this together from scratch. \n\nEverything was submitted. Everything was used.\n\nBut when I submitted my final invoice, the owner refused to pay unless I handed over all my working files. Files that were never part of the agreement, never needed … until after they replaced me with a new agency. They wanted everything so they could pass it on. No license agreement. No compensation. No acknowledgement of scope creep or value.\n\nInstead of paying",
    "url": "https://reddit.com/r/freelance/comments/1l1vhwi/i_filed_a_legal_claim_after_being_unpaid_for_work/",
    "score": 273,
    "num_comments": 112,
    "date": "2025-06-02",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "TruthseekerTO",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "dataengineering",
    "title": "Got hired as Jr DE, but now running the whole team alone burned out and doubting my path",
    "text": "Hi everyone, sorry if my English isn’t very good.\n\n**TL;DR:**  \nI’m a fresh graduate in Actuarial Science. Got a Jr. Data Engineer role, but the Senior DE quit right before I joined now I’m the only DE. Everything is a mess (broken pipelines, legacy code, poor management, no guidance, layoffs). On top of that, they expect huge changes, endless requirements, and bad deadlines, with constant meetings leaving no time to work. I’m learning a lot, but I’m burned out and doubting if I should stay or return to actuarial work.\n\nI just graduated in May with a degree in Actuarial Science. And over here it’s common to have an internship while still studying during the semester, so almost everyone graduates with around two years of experience. During my internships, I worked on pension and macroeconomics analysis. Later, I had the opportunity to join a BI team at a fintech. There, I helped improve semantic models, fix dashboards with slow refresh times, and implement better practices. After that, ",
    "url": "https://reddit.com/r/dataengineering/comments/1nayp2m/got_hired_as_jr_de_but_now_running_the_whole_team/",
    "score": 21,
    "num_comments": 31,
    "date": "2025-09-07",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "OkSatisfaction7486",
    "upvote_ratio": 0.84
  },
  {
    "subreddit": "sales",
    "title": "How do you earn Indian business?",
    "text": "I'm on an real estate service offer that attracts a certain wealth class but the Indians are hard to convert while being a large percentage of the interested party.   \nThere is a flat, non-recurring service fee up front and a monthly management cost (if they go with us).   \nThey seem to want one-sided deals where we can't win. We have to charge up front for work but they often want us to collect payment at the end of fulfillment, services for our bottom dollar, OR for below operating cost.   \nThey'll deny a deal for partial payment up front, too.   \nI've basically accepted most of these customers are not a good fit and use them as practice for standing my ground and cutting things off if it's a waste of my time - but i'm genuinely curious how to work with their mindset or culture to get somewhere.   \nWe play full transparency with our service, process, and backend so before they even get on this video call with me they've got nearly every bottom line the majority of people need to make",
    "url": "https://reddit.com/r/sales/comments/1mkfd5n/how_do_you_earn_indian_business/",
    "score": 106,
    "num_comments": 183,
    "date": "2025-08-07",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "Moxiecodone",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "asana",
    "title": "New to Asana - Looking for Best Way to Structure for My Needs",
    "text": "I'm a marketing consultant experimenting with Asana to manage my projects and tasks.  I manage marketing for 3-4 clients at a time, and also have projects/tasks for my own business.\n\nMy initial plan is to treat each client (plus my company) as its own TEAM, with relevant projects and tasks assigned to the Client (Team).\n\nI'd like to be able to view each Client (TEAM) separately... so for example, If I meet with Client X, I can review only their projects.\n\nDoes using Teams as a proxy for clients seem like the best way to go? Any other suggestions?\n\nTHANK YOU!\n\nPS:  I am solo.... no other team members and no plans to add any.",
    "url": "https://reddit.com/r/Asana/comments/1mo956x/new_to_asana_looking_for_best_way_to_structure/",
    "score": 6,
    "num_comments": 1,
    "date": "2025-08-12",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "winged_jeff_11",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "startups",
    "title": "How to deal with this CTO? (I will not promote)",
    "text": "I will not promote\n\nOur startup is about 2 years old, and there are 4 co-founders, 25% share each.\n\nCTO - Comp Sci PhD (AI) from a top Ivy League, ex-Google DeepMind with outstanding research awards, main publication has over 6k citations, and won best paper awards in top Comp Sci conferences. And 1x previous exit.\n\nCEO - Comp Sci PhD (AI), same school as the CTO, but no good publications. Ex-lead data scientist in a T3 consulting firm that barely anyone outside of the industry had heard of.\n\nFounders 3 and 4 are domain experts in the industry we are in.\n\nWe started off rough, had no clients, failed in all sales and fundraising. We spent the first 2 years testing different ideas and looking for the right product market fit. The CTO promised everything, but didn't end up doing any coding at all. However, he did put his name down, turned up to final round VC meetings, gave us important mentorship a few times during critical events, since he is an experienced founder, and the other 3 are ",
    "url": "https://reddit.com/r/startups/comments/1n9r2uv/how_to_deal_with_this_cto_i_will_not_promote/",
    "score": 39,
    "num_comments": 56,
    "date": "2025-09-06",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "d_edge_sword",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "startups",
    "title": "Alternative to Kickstarter for individuals and smaller companies? (I will not promote)",
    "text": "Hi everyone, I've been working on a product for a few years now. I have prototypesthatbwork well and look good. I also continue to test and improve them. The product is an electronic gadget and takes a decent amount of time to solder and assemble it together. I am the only person working on it. I don't have a team and I don't have a lot of money or time to dump into this because I'm supporting a family first with my full time job. I started looking into Kickstarter, but as soon as I checked it out I realized the people on Kickstarter are basically small companies that are using the platform to market their product before launch. In order to look like the other guys, I need to make a website, an online store, videos, and flashy ads. I am an engineer, so this part of the process is not my strong suit. I feel that even if I push myself to finish the Kickstarter, I will be irrelevant because I'm not as flashy as the others. Any suggestions for a different platform that might be a better fi",
    "url": "https://reddit.com/r/startups/comments/1mx8tyb/alternative_to_kickstarter_for_individuals_and/",
    "score": 7,
    "num_comments": 5,
    "date": "2025-08-22",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "RonandStampy",
    "upvote_ratio": 0.83
  },
  {
    "subreddit": "SaaS",
    "title": "Created an open-source alternative to Resend after email costs hit $200+/month",
    "text": "Running multiple SaaS products, our Resend costs were approaching $200+/month across projects. Built FreeResend as a solution.\n\n**Business impact:**\n- Reduced email costs by 85% (now using Amazon SES rates)\n- Eliminated vendor lock-in concerns\n- Faster domain setup (auto DNS vs manual configuration)\n- Complete visibility into email delivery\n\n**Technical approach:**\n- 100% API compatibility with Resend (zero migration effort)\n- Self-hosted Next.js application\n- Amazon SES for reliable delivery\n- Digital Ocean integration for automatic DNS setup\n- Open source (MIT license)\n\n**ROI:** For anyone sending 50k+ emails/month, the savings pay for the hosting costs within weeks.\n\nThe goal isn't to replace Resend for everyone - they're fantastic. But for cost-conscious founders and agencies, this provides the same DX at fraction of the cost.\n\n**GitHub:** https://github.com/eibrahim/freeresend\n\nOther SaaS founders - what's your email cost tipping point?",
    "url": "https://reddit.com/r/SaaS/comments/1mzoaej/created_an_opensource_alternative_to_resend_after/",
    "score": 2,
    "num_comments": 3,
    "date": "2025-08-25",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "eibrahim",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "smallbusiness",
    "title": "How do I address my team about excessive overtime?",
    "text": "Small Seasonal Hotel owner here. So here's my issue, we have a seasonal hotel that currently employes 18 people over the summer (March to October). \n\nI took over as a manager 3 years ago and tried to address some of the issues regarding employees welfare. In that regard I observed that the housekeeping team (made up by 3 ladies) was exremely overworked so much so that they would work 7/7 in the busier months of July and August and accumulate a lot of  paid overtime ( around 1,5 hr per day + a full payed day for the lack of day off,  which in my country is payed with a 40% increase of their regular hourly pay). \n\nWith that amount of money I could hire an extra 2 maids. \n\nAfter addressing the issue (and acknolwleging that is illegal to work 7/7) with them and telling  that I would hire and extra maid they didn't seem too pleased, but I did it anyways. \n\nAfter hiring a fourth maid I was able to warrant them a day off a week and to distrubute their workload in a way that they would still g",
    "url": "https://reddit.com/r/smallbusiness/comments/1n5jfcu/how_do_i_address_my_team_about_excessive_overtime/",
    "score": 65,
    "num_comments": 74,
    "date": "2025-09-01",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "Time_Marionberry9572",
    "upvote_ratio": 0.88
  },
  {
    "subreddit": "juststart",
    "title": "My journey from 5 bad businesses to online entrepreneurship",
    "text": "Like the vast majority of Brazilians, I didn't start a business because I \"wanted to be an entrepreneur.\" On the contrary, I *needed* to in order to pay bills and maintain the basics.  \n  \nSo, let's explore this little story and see where we've arrived today.  \n  \n**Parties, open bar, and shirts**  \n  \nMy first business was actually a combo. I had left my last job, and I liked parties. So, I started organizing a party monthly at my father's house. I paid for water, electricity, and gave him some money. In exchange, I organized Saturday to Sunday open bar parties.  \n  \nThe formula was simple: I created a party event on Facebook, invited everyone I knew, handed out flyers in the city, and spread posters at bus stops about the party. And, to top it off, women were free until 8:00 PM. Consequence? Guys came and paid for their tickets and theirs (women's). Hahaha. And it filled up...  \n  \nI started noticing that people were dressed poorly. And I thought, \"Why not dress them?\"  \n  \nBoom! I s",
    "url": "https://reddit.com/r/juststart/comments/1kysvna/my_journey_from_5_bad_businesses_to_online/",
    "score": 14,
    "num_comments": 21,
    "date": "2025-05-30",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "henripacheco27",
    "upvote_ratio": 0.89
  },
  {
    "subreddit": "indiehackers",
    "title": "Guys, need your advice, how do you handle feature requests for your saas business ?",
    "text": "Hi everyone I need your advice,\n\nhow do you handle feature requests for your saas business ?\n\nDo you build the features requested by customers right away?\n\nOr\n\ndo you wait until a request becomes repetitive over multiple customers before building it?\n\nWhat’s your approach?\n\nIn my previous venture, I noticed:\n\n1. There were too many feature requests.\n\n2. Almost every user requested different features.\n\n3. Sometimes, the features we built for Customer A weren’t used by Customers B, X, Y, or Z, and vice versa. \n\nCurrently i build another project and i want to manage the feature request better. \n\nhow do you handle them ? any benchmark you have before build them ?\n\n",
    "url": "https://reddit.com/r/indiehackers/comments/1n3sxhn/guys_need_your_advice_how_do_you_handle_feature/",
    "score": 3,
    "num_comments": 19,
    "date": "2025-08-30",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "RawrCunha",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "web_design",
    "title": "How to find agencies to partner up with?",
    "text": "Hi everyone, my husband and I recently started a small agency where we combine creative + tech. We focus on digital marketing  branding, content, and strategy and also bring in automations to save teams time and improve workflows.\n\nWe’re looking to connect with other agencies, especially those doing web dev, to explore partnerships.\n\nThe idea is to complement each other’s services for example, if you handle dev, we can support on design, branding, content, or marketing. \n\nAnd when there’s overflow, we’d love to collaborate on projects together.\n\nIf you’ve done agency-to-agency partnerships before, what’s worked best for you? \n\nAnd if you’re open to exploring a partnership with us, I’d love to connect!\n\n\n",
    "url": "https://reddit.com/r/web_design/comments/1n8961d/how_to_find_agencies_to_partner_up_with/",
    "score": 9,
    "num_comments": 10,
    "date": "2025-09-04",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "ProgramExpress2918",
    "upvote_ratio": 0.85
  },
  {
    "subreddit": "dataengineering",
    "title": "How do you handle your BI setup when users constantly want to drill-down on your datasets?",
    "text": "Background: \nWe are a retailer with hundreds of thousands of items. We are heavily invested in databricks and power bi\n\nProblem: \nOur business users want to drilldown, slice, and re-aggregate across upc, store, category, department, etc. it’s the perfect usecase for a cube, but we don’t have that. Our data model is too large to fit entirely into power bi memory, even with vertipaq compression and 400gb of memory. \n\nFor reference, we are somewhere between 750gb-1tb depending on compression. \n\nThe solution to this point is direct query on an XL SQL warehouse which is essentially running nonstop due to the SLAs we have. This is costing a fortune. \n\nSolutions thought of:\n- Pre aggregation: great in thought, unfortunately too many possibilities to pre calculate \n\n- Onelake: Microsoft of course suggested this to our leadership, and though this does enable fitting the data ‘in memory’, it would be expensive as well, and I personally don’t think power bi is designed for drill downs\n\n- Clickhou",
    "url": "https://reddit.com/r/dataengineering/comments/1n1hy4g/how_do_you_handle_your_bi_setup_when_users/",
    "score": 44,
    "num_comments": 62,
    "date": "2025-08-27",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "JustASimpleDE",
    "upvote_ratio": 0.9
  },
  {
    "subreddit": "dataengineering",
    "title": "Introducing Minarrow — Apache Arrow implementation for HPC, Native Streaming, and Embedded Systems",
    "text": "# Dear Data Engineers,\n\nI’ve recently built a production-grade, from-scratch implementation of the ***Apache Arrow*** data standard in **Rust**—shaped to to strike a new balance between ***simplicity***, ***power***, and ***ergonomics***.\n\nI’d love to share it with you and get your thoughts, particularly if you:\n\n* Work in the *(more hardcore end) of the* **data engineering** space\n* Us**e Rust for data pipeline**s, or the Arrow data format for systems / engine / embedded work\n* Build **distributed** or **embedded** software that benefits from Arrow’s memory layout and wire protocols just as much as the columnar analytics it's typically known for.\n\n# Why did I build it?\n\n***Apache Arrow*** (and `arrow-rs`) are very powerful and have reshaped the data ecosystem through zero-copy memory sharing, lean buffer specs, and a rich interoperability story. When building certain types of high-performance data systems in Rust, though (e.g., distributed data, embedded), I found myself running into ",
    "url": "https://reddit.com/r/dataengineering/comments/1nadpir/introducing_minarrow_apache_arrow_implementation/",
    "score": 14,
    "num_comments": 7,
    "date": "2025-09-06",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "peterxsyd",
    "upvote_ratio": 0.81
  },
  {
    "subreddit": "sales",
    "title": "Looking for advice on $11M+ deal size (consulting + tech bundle)",
    "text": "\nOur customer base is in an overlooked industry and what we offer delivers results. They spend tens of millions annually nursing the problem and still having to deal with the same issue again and again.\n\nFor that reason, plus the fact that our tech is patented, we want to go in with a premium contract price. The deal size is around $11M per sale.\n\nI know that’s not your average SaaS subscription or B2B deal. I’m looking for input from folks who’ve sold at this scale (or close to it):\n\n- How do you approach prospecting and opening conversations when the price point is this high?\n\n- Do you have to meet customers in person? How does that usually go as far as setting that up? (After the first call?)\n\n- How do you define an expedited sales cycle with them provided that they aren't used to that but are now going through a crisis?\n\n- Any tips for dealing with deals of this size?\n\nI'll also mention their industry is going through an emergency right now so they're looking for a solution. At the",
    "url": "https://reddit.com/r/sales/comments/1mz49yx/looking_for_advice_on_11m_deal_size_consulting/",
    "score": 9,
    "num_comments": 13,
    "date": "2025-08-24",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "Personal-Start-4339",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "sales",
    "title": "Burned out and looking for insight",
    "text": "I’m in a sales role where I go into people’s homes, but lately my brain has completely shut down. I find myself going through the motions without really caring. I feel like the only way I get paid is if I push hard for a same-day close, and that pressure makes me feel gross and unnatural.\n\nInstead of feeling motivated, I’ve started dreading appointments. Sometimes I even hope customers cancel just so I don’t have to deal with it. When I’m actually in an appointment, I’ll skip steps, not follow the process, and it shows — I leave feeling like I didn’t give my best effort.\n\nThe weird thing is, I’ve done well in sales before, I'm on my second month on this job and I've hit both spectrums. Had a really good first month and now I'm bringing up the rear. I did well in car sales as my last job, so I know I can succeed. But here I feel forced into being a pushy closer, and it feels like doesn’t fit me at all despite success in the first month. The more I think about it, the more I wonder if th",
    "url": "https://reddit.com/r/sales/comments/1n0wbyo/burned_out_and_looking_for_insight/",
    "score": 3,
    "num_comments": 10,
    "date": "2025-08-26",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "PoliteNewt00",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "accounting",
    "title": "What little touches do you/your firm do to WOW clients? Looking for “unreasonable hospitality” ideas",
    "text": "I work at a boutique wealth management firm and we’re in the process of upping our client experience game. I’d love to hear how others (in ANY industry — law, finance, creative, whatever) are surprising and delighting their clients. Think of those little thoughtful touches that make people say “wow, they really care about me.”\n\nHere are some of the things we’re already doing:\n\n* Hand-signed birthday cards that include philanthropy gift cards\n* Birthday lunches & hand delivered valentine treats/flowers for widows\n* Branded fancy cookies as an exit gift after every meeting\n* A custom welcome board with each client’s names when they visit\n* Beverages + snacks offered (always)\n* piggy banks with the baby initials for new parents\n* Gift cards for food delivery when someone is sick, etc\n* Mini champagne bottles for “small wins” (maxing a 401k, paying off debt, etc.)\n* Meeting clients in the lobby and walking them up\n* Spare umbrellas + walking them out in the rain\n* New home Christmas orname",
    "url": "https://reddit.com/r/Accounting/comments/1n8h36l/what_little_touches_do_youyour_firm_do_to_wow/",
    "score": 0,
    "num_comments": 5,
    "date": "2025-09-04",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "PathEnough516",
    "upvote_ratio": 0.33
  },
  {
    "subreddit": "PowerBI",
    "title": "Best way to keep track of a manager's million ideas and change requests and edits to reports etc? So I can show him without offending him.",
    "text": "Every meeting with my manager end with about 100 actions.\n\nDelete this part of the report.\n\nAdd this part. \n\nHere's an idea for a new report. \n\nChange the logic to that calculation etc etc\n\nI can barely write them down in my notes in time. \n\nBy the way - he is from a non technical background. He has absolutely no idea how SQL or Power BI or anything works behind the scenes. He thinks all his ideas are easy. \n\nI remember he had an idea for a Power App and he said it should take about 20 minutes. It took two weeks, with him \"helping\" because he built the skeleton after watching a YouTube video, and I had to implement it fully.\n\nHe comes to meetings with his ideas or change requests and just shits them out. A 1 hour meeting is him talking for 59 minutes and 55 seconds.\n\nHe is one of those old school middle management guys in the same company for 25 years and is addicted to meetings and talking, and not actually doing anything. I honestly think one of his KPIs is \"number of meetings\" so he",
    "url": "https://reddit.com/r/PowerBI/comments/1n9zi1v/best_way_to_keep_track_of_a_managers_million/",
    "score": 61,
    "num_comments": 46,
    "date": "2025-09-06",
    "commercial_score": 9,
    "category": "scaling_issues",
    "author": "Scrotal_Anus",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "Entrepreneur",
    "title": "How do young “founders” without clients or a real team afford a luxury lifestyle?",
    "text": "I’ve noticed some people in their early 20s who come from families that aren’t particularly well-off calling themselves “founders.” But from the outside, there don’t seem to be active clients or a real team behind their company.\n\nAt the same time, they seem to afford a luxury lifestyle and travel constantly. All without a visible job or steady freelancing income.\n\nHow is this usually possible? Are they funded by investors, family support, loans, or something else?\n\nI want to build independence and a sustainable path myself, so I’d like to better understand the realistic financial routes young entrepreneurs actually take, vs. what just *looks* flashy on the outside.",
    "url": "https://reddit.com/r/Entrepreneur/comments/1n9f9kb/how_do_young_founders_without_clients_or_a_real/",
    "score": 137,
    "num_comments": 165,
    "date": "2025-09-05",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "MysteriousDisk2874",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "Entrepreneur",
    "title": "How to actually make money with a book (from a 7-fig ghostwriter)",
    "text": "I've been a ghostwriter for 10 years. This is what really works for making money with a book as a founder/entrepreneur.\n\nBooks are really hard to sell. But they are GREAT salespeople.\n\nRight now, I make about $10,000 for every $75 I spend using my book.\n\n**Here's how in 10 steps:**\n\n1. Write a punchy book, about 120 pgs (I call it a Business Builder Book)\n2. Publish on Amazon\n3. Order author copies (\\~$3 a piece)\n4. Build a target list of ideal customers\n5. Write a personalized, handwritten note\n6. Mail book with note\n7. Make follow up calls / emails / social DMs as the \"author of the book you got in the mail last week\"\n8. Set sales calls\n9. Rock your calls and send proposals\n10. Profit! (I close a little north of half my deals)\n\n**Why does this work?**\n\nThis works for a few reasons.\n\nFirst, people always read their mail... especially when it's in a nice envelope and is book shaped.\n\nSecond, practically no one does this. It's old school. But in the age of AI and digital everything... o",
    "url": "https://reddit.com/r/Entrepreneur/comments/1mk3xze/how_to_actually_make_money_with_a_book_from_a/",
    "score": 164,
    "num_comments": 128,
    "date": "2025-08-07",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "senecas_intern",
    "upvote_ratio": 0.8
  },
  {
    "subreddit": "shopify",
    "title": "Need Help Diagnosing a 70% Checkout Abandonment Rate on a Personalised Product Store (Data Inside)",
    "text": "Hi everyone,\n\nI'm hoping to get some expert eyes on a persistent checkout issue I've been facing for quite some time. My store sells personalised jewellery that requires customers to upload a photo using a third-party app (currently UploadKit, but previously Upload-Lift).\n\n**The Core Problem:** I have a universal checkout abandonment rate of around 70%, and my data shows it's significantly worse for my US customers.\n\n**My Data Analysis (12-Month Period):**\n\n* **Overall Checkout Abandonment:** \\~70% across all browsers.\n* **US vs. UK Checkout Abandonment:** The rate for my US customers is **\\~73%**, while for UK customers it's much lower at **\\~53%**.\n* **Top of Funnel is Working:** My ads are performing well, with a high Add to Cart rate (**7.9%** from Meta traffic), so I'm confident the issue is in the checkout process itself.\n\n**What I've Already Ruled Out:**\n\n* **Surprise Shipping Costs:** I offer free shipping.\n* **Payment Processor:** The issue persisted even after I switched from",
    "url": "https://reddit.com/r/shopify/comments/1muzd1q/need_help_diagnosing_a_70_checkout_abandonment/",
    "score": 3,
    "num_comments": 9,
    "date": "2025-08-19",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "stats1101",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "digital_marketing",
    "title": "I hacked together a tool to cut down sales prospect research time – looking for feedback",
    "text": "Hi folks,\n\nI wanted to share a scrappy project I hacked together.\n\nProblem: Sales teams spend way too much time on **manual research** (LinkedIn, Google, company sites, CRMs) before they even reach out.\n\nSolution: I built a tool (with no marketing budget, just hacked together) that **aggregates prospect/account info and gives a quick analysis** in one view.\n\nGoal: I’m **not trying to sell it yet**. I just want feedback from early testers to see if this is worth pursuing or if I’m barking up the wrong tree.\n\nIf you’re in B2B sales (or have friends who are), would you find this useful? Happy to share the beta link with anyone curious.\n\nAppreciate any feedback",
    "url": "https://reddit.com/r/digital_marketing/comments/1n4rubb/i_hacked_together_a_tool_to_cut_down_sales/",
    "score": 6,
    "num_comments": 10,
    "date": "2025-08-31",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "khocha_powa_86",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "digital_marketing",
    "title": "I'm looking for some career advice for my unique (?) situation",
    "text": "Hey everyone,\n\nI’m looking for some advice as I transition into a full-time job in the marketing field. A bit about me:\n\nI have a master’s degree in theoretical biology (summa cum laude, from the top university here). Over the past 5-6 years, I’ve built and led my own e-commerce brand (classic, not dropshipping, which now has 27k followers on Facebook and 12k on Instagram. I’ve worn all the hats (managed everything from social media, email, automations, strategy, B2B sales) with all the hard and soft skills that come with those, so it’s been a hands-on leadership role, even if it’s not traditional corporate experience.\n\nI’ve also done a couple of years of side consulting in marketing strategy as well as sales and I have experience leading teams in academic settings, which isn’t exactly the same as a corporate team, but definitely helped me build leadership skills.\n\nThe main reason I'm looking for a job is that I want to stop relying on my brand to survive, as taking a paycheck has been",
    "url": "https://reddit.com/r/digital_marketing/comments/1n5b3vx/im_looking_for_some_career_advice_for_my_unique/",
    "score": 5,
    "num_comments": 5,
    "date": "2025-09-01",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Personal_Permission5",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "digital_marketing",
    "title": "Looking for affiliates: 30% commission promoting a privacy-first AI tool (30-day cookies)",
    "text": "Hey everyone,\n\nI’ve built a desktop tool called **RenameIQ**, designed for **scanned documents and image organization**.  \nIt uses **offline AI + OCR** to automatically rename files based on their content — 100% privacy-focused, no cloud required.\n\nI’m opening up an **affiliate program** and looking for people with **email lists, small communities, or blogs** in these niches:\n- Productivity software\n- Digital organization\n- Paperless workflows\n- Small business tools\n\n**Offer:**\n- 30% commission on each sale\n- 30-day cookie tracking\n- Simple signup process\n- No country restrictions\n\nIf you have an audience and want to earn passive income promoting a **niche tool with zero competition**, DM me and I’ll send you the signup link.\n\nThis is ideal for creators, small SaaS founders, or anyone with an audience interested in productivity.\n\n*Let’s grow together — DM me to get started.*",
    "url": "https://reddit.com/r/digital_marketing/comments/1n9ja34/looking_for_affiliates_30_commission_promoting_a/",
    "score": 0,
    "num_comments": 2,
    "date": "2025-09-05",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "walidarme",
    "upvote_ratio": 0.33
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "I think one of my co- founders is about to bail- idk how to feel.",
    "text": "A few weeks ago, I started a company with two other people. One was a colleague turned friend from our time in the trenches at a software company. \n\nThis one friend was later laid off. He’d gone through several interviews with various companies, but it’s been a year and he’s still outta work. Now, I understand the hardship that comes with going from mid 6-figures to unemployment running out. \n\nAfter about a year, he introduces me to another individual, after sharing my business vision. The three of us start working on smaller contracts, to test the waters. \n\nWell, happy to report it’s going well. In fact he was critical in helping us win our first decent size contract. It will give us breathing room, as well as a small runway to really kick things off, and invest into the company and ourselves. And as a result we are starting to formalize. And naturally we begin vetting software. \n\nToday, I was told by my friend that he’s interviewing at a company that may become a core software we use",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n2vt5a/i_think_one_of_my_co_founders_is_about_to_bail/",
    "score": 3,
    "num_comments": 13,
    "date": "2025-08-29",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Zealousideal_Tart308",
    "upvote_ratio": 0.68
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Exited Founder Seeding $150–200K: Looking for SaaS/AI Co-Founder",
    "text": "Hey all. This is a real pitch - not bogus, not a bot, not a scam. \n\nBackground: I founded and scaled a consumer brand from nothing to $150m - exited last year. I know brand, storytelling, strategy, and growth, and I bring a strong network in the CPG (consumer packaged goods) space.\n\nGoal: I want to seed a new SaaS/AI venture with the right partner. CPG is my natural starting point (I have a solid network here), but I’m open to other verticals if the pain is real - events, catering, healthcare, logistics, etc.\n\n⸻\n\nStructure\n\t•\t$150–200K seed committed (funded by me).\n\t•\t12-week build phase → MVP + traction.\n\t•\tIf we click → co-founder status (20–35% equity, vesting).\n\t•\tYear 1 runway funded.\n\n⸻\n\nExamples of Problems to Solve\n\t•\tAutomating sell sheets & retailer decks (CPG).\n\t•\tDistributor / trade show follow-up (CPG).\n\t•\tSales lead workflows for services (catering, dentists, B2B).\n\t•\tSMB workflow automation in industries still stuck on spreadsheets.\n\n⸻\n\nWho I’m Looking For\n\t•\tTechnical/",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n4sh1j/exited_founder_seeding_150200k_looking_for_saasai/",
    "score": 11,
    "num_comments": 17,
    "date": "2025-08-31",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "charlie-chicken",
    "upvote_ratio": 0.76
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "started my new AI automation agency, looking for first 10 projects",
    "text": "i just started my journey into building AI automation agency, helping businesses save time & money with AI workflows. numbers dont lie, 60% of repetitive work can be automated today with right tools. right now its just me and 1 partner, we are looking for our first 10 projects to prove ourselves. if any founder want to try, i can give discounted rates for initial clients.",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1mw915f/started_my_new_ai_automation_agency_looking_for/",
    "score": 2,
    "num_comments": 6,
    "date": "2025-08-21",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Electronic_Argument6",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Looking for feedback: 3-day “Opportunity & Innovation Sprint” concept for service-based businesses",
    "text": "I’m exploring a new concept and would love some community feedback.\n\nThe idea: a **3-day Opportunity & Innovation Sprint** to help service-based businesses quickly uncover growth opportunities and design a short-term innovation roadmap.\n\n**How it would work:**\n\n* **Day 1:** Understand the business model, market position, and current challenges\n* **Day 2:** Map quick wins, potential new revenue streams, and innovation opportunities\n* **Day 3:** Present a 90-day roadmap with actionable next steps\n\nI’m considering focusing on **tourism & hospitality**, **healthcare & wellness**, and **professional services**, as these are industries where I’ve seen high potential for quick, impactful change.\n\nWhat I’d love to hear from you:\n\n* If you’re in one of these industries, would this format be useful?\n* What would make a sprint like this more compelling or valuable?\n* Have you done something similar in your business, and what worked/didn’t work?\n\nI’m running a small beta to test and refine this pr",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1myq97u/looking_for_feedback_3day_opportunity_innovation/",
    "score": 2,
    "num_comments": 3,
    "date": "2025-08-24",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Singi98",
    "upvote_ratio": 0.76
  },
  {
    "subreddit": "indiehackers",
    "title": "Exited founder seeding $200K — looking for SaaS/AI co-founder",
    "text": "Hey all. This is a real pitch - not bogus, not a bot, not a scam. \n\nBackground: I founded and scaled a consumer brand from nothing to $150m - exited last year. I know brand, storytelling, strategy, and growth, and I bring a strong network in the CPG (consumer packaged goods) space.\n\nGoal: I want to seed a new SaaS/AI venture with the right partner. CPG is my natural starting point (I have a solid network here), but I’m open to other verticals if the pain is real - events, catering, healthcare, logistics, etc.\n\n⸻\n\nStructure\n\t•\t$150–200K seed committed (funded by me).\n\t•\t12-week build phase → MVP + traction.\n\t•\tIf we click → co-founder status (20–35% equity, vesting).\n\t•\tYear 1 runway funded.\n\n⸻\n\nExamples of Problems to Solve\n\t•\tAutomating sell sheets & retailer decks (CPG).\n\t•\tDistributor / trade show follow-up (CPG).\n\t•\tSales lead workflows for services (catering, B2B).\n\t•\tSMB workflow automation in industries still stuck on spreadsheets.\n\n⸻\n\nWho I’m Looking For\n\t•\tTechnical/operator b",
    "url": "https://reddit.com/r/indiehackers/comments/1n4sd4l/exited_founder_seeding_200k_looking_for_saasai/",
    "score": 7,
    "num_comments": 7,
    "date": "2025-08-31",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "charlie-chicken",
    "upvote_ratio": 0.82
  },
  {
    "subreddit": "indiehackers",
    "title": "🚀 I built an AI tool that automatically generates job postings – looking for feedback!",
    "text": "Hi everyone,\n\nI’m currently working on a side project called **JPNJobGen**, an AI-powered tool that helps HR/recruiters create professional job postings in just a few clicks.\n\n# 🔧 What it does\n\n* Input basic info (company name, role, location, requirements)\n* AI generates a complete job posting in a clean, structured format (with PDF export)\n* Option to preview, edit, and download instantly\n\n# 🎯 Who it’s for\n\n* Small/mid-sized businesses without a dedicated HR team\n* Recruiters who want to save time writing repetitive job posts\n* Anyone hiring frequently and looking to standardize posting formats\n\n# 📌 Current stage\n\n* I’ve built an MVP using Softr + Make + Google Docs template.\n* Working on PDF generation + subscription model.\n* Looking for testers who can try it and give me honest feedback.\n\n👉 Web demo: [https://jpnjobgen-raleigh24457.softr.app/]()  \n👉 GPT Store version: [https://chatgpt.com/g/g-68b167f5c6b0819196f954c24cc911b1-qiu-ren-piao-ai-hetaban](https://chatgpt.com/g/g-68b167f5",
    "url": "https://reddit.com/r/indiehackers/comments/1n32psj/i_built_an_ai_tool_that_automatically_generates/",
    "score": 3,
    "num_comments": 7,
    "date": "2025-08-29",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Smartcore5566",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "How to get clients?",
    "text": "Hey folks,\n\nMe and my team have been building a Cluely-style AI overlay. Basically, it’s like having Stockfish in chess but for sales calls — the app listens in real time and, within <1 second, feeds you the best “next move” to handle objections, keep the convo flowing, and close deals.\n\nIt runs as a lightweight always-on-top overlay, so while you’re on Zoom/Meet, it discreetly suggests lines, objection handling, and context-aware responses. When you share your screen it becomes invisible. Infact, the ai is trained or the data of big marketing company.\n\nWe know social media reels/TikTok/LinkedIn will be a big push, but aside from that, how do you actually get clients for something like this?\n\nWhere would you go to find early adopters (founders, SDRs, hustlers)?\n\nHow would you approach selling this without being spammy?\n\nShould we be doing beta invites, cold outreach, or more community posting?\n\nAlso — if anyone here is curious to try it out or just give feedback, DM me. Always down to ",
    "url": "https://reddit.com/r/microsaas/comments/1n7fyb6/how_to_get_clients/",
    "score": 3,
    "num_comments": 23,
    "date": "2025-09-03",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Old-Butterfly-1623",
    "upvote_ratio": 0.8
  },
  {
    "subreddit": "web_design",
    "title": "How do you deal with last-minute design changes mid-build?",
    "text": "Hey guys!\n\nSomething I’ve noticed over time: no matter how polished the designs are, changes almost always come once development is underway (which is totally normal) A stakeholder rethinks a flow, the client wants “just one more thing,” or the team catches something that feels off only once it’s interactive.\n\nSince most of our work is taking finalized Figma designs and building them into production-ready web apps, we run into this a lot. We try to stay flexible so iterations don’t derail timelines, but there’s always a balance between speed, scope, and keeping the workflow intact.\n\nFrom the design side, I’m curious:\n\nHow do you usually handle it when changes land mid-build? Do you push back? Redesign quickly? Negotiate scope?\n\nAnd how do you manage that with the devs you’re working with, without completely breaking their workflow or blowing up the scope?\n\nWould love to hear how you balance keeping momentum while still protecting the project from spiraling out of control:) Maybe it'll ",
    "url": "https://reddit.com/r/web_design/comments/1mtoi0z/how_do_you_deal_with_lastminute_design_changes/",
    "score": 4,
    "num_comments": 17,
    "date": "2025-08-18",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "No_Cryptographer7800",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "web_design",
    "title": "What’s the best ecommerce website builder for a small business on a tight budget?",
    "text": "Setting up a site for a family craft store and trying to keep costs down. We already have a domain and are looking at Shopify, WooCommerce, and Square Online but want something simple that won’t hit us with big monthly fees or high transaction rates. What’s the best ecommerce website builder for a small business on a tight budget that’s still easy for beginners? Is WooCommerce really cheaper in the long run or does Shopify end up saving time and headaches?",
    "url": "https://reddit.com/r/web_design/comments/1n92wet/whats_the_best_ecommerce_website_builder_for_a/",
    "score": 24,
    "num_comments": 34,
    "date": "2025-09-05",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "PlateAdventurous4583",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "projectmanagement",
    "title": "When your PM boss turns into a \"yes man\" for execs — how do you manage the fallout?",
    "text": "I'm in a bit of a weird spot and would love to hear how others might deal with this.\n\nMy direct manager, who also heads the Project Management department for a tech manufacturing company, has gradually turned into a full-blown *yes man* for the CEO/CMO over the last 8–10 months.\n\nIt started subtly, but now he's taking on projects that are *completely* out of our department’s scope — no proper resources, no systems, no tools, no processes — just unrealistic timelines and executive pressure. And he’s not pushing back or even raising the obvious resourcing issues with upper management. It's like he's afraid to rock the boat because he's now in their good books.\n\nSo what happens? Everything trickles down to my small team of 3. We’re constantly under pressure, doing hands-on tasks we shouldn't be responsible for, just to keep things from falling apart. I’m literally walking over to other departments and asking (begging?) people to execute tasks that are way outside our control. It’s irritat",
    "url": "https://reddit.com/r/projectmanagement/comments/1mwzvvs/when_your_pm_boss_turns_into_a_yes_man_for_execs/",
    "score": 73,
    "num_comments": 29,
    "date": "2025-08-22",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Row_Exciting",
    "upvote_ratio": 0.98
  },
  {
    "subreddit": "projectmanagement",
    "title": "As PM are you looking for free software because you don't like what you're using now?",
    "text": "I have repeatedly seen within the channel where Project Manager’s are looking for “free project management software” for their organisation or company because they just don’t like what they’re using? The reality is free software doesn’t exist, there are always a cost overhead to an organisation or company.\n\nSoftware is never free because the product has to be hosted, technically supported, training and including on the going training, licensing and corporate administration which all requires effort which has an associated cost. Also when products are offered as “free”, they’re generally in the BETA testing phase, the developers are generally leveraging their end users as “free testers”. People and companies don’t just develop applications because they want to, they want to make money from their products and will eventually lead to the licensing of the product and you have been inadvertently bound to a product financially especially if it doesn’t do everything you want it to do.\n\nFirstl",
    "url": "https://reddit.com/r/projectmanagement/comments/1n4m6cm/as_pm_are_you_looking_for_free_software_because/",
    "score": 0,
    "num_comments": 10,
    "date": "2025-08-31",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "More_Law6245",
    "upvote_ratio": 0.35
  },
  {
    "subreddit": "projectmanagement",
    "title": "How you guys deal with the classic human stupidity and arrogance?",
    "text": "I'm studying project management sacredly every day with a specific focus on IT, since I have a software engineering background. I can't stop thinking about how people in this field deal with the same old classic human stupidity. By that, I mean:\n\n1. In PM, you need to build a lot of documents with leadership and almost no ask to manage a good initiation and planning phase. But its obviously that some participants in this process will go against you no matter what, seeking their own personal interests... To then signed this documents with the sponsors and stakeholders. \n\n2. How do you manage tech leaders and other leadership teams when they only say what's convenient for them, always prioritizing their own convenience by trying to do less work, find the easiest approach, or spend less time on a task?\n\n3. After the initiation and planning phases are finished and it’s time to execute, I feel there will always be someone who tries to sabotage the process by introducing other 'useful' requi",
    "url": "https://reddit.com/r/projectmanagement/comments/1nab0v6/how_you_guys_deal_with_the_classic_human/",
    "score": 20,
    "num_comments": 18,
    "date": "2025-09-06",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "ExtremeThinkingT-800",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "sales",
    "title": "Exploring next steps beyond SDR; looking for real-world examples",
    "text": "I’ve realized that strictly cold-calling roles just aren’t sustainable for me anymore. I’ve always performed well…consistently hitting quota… but the grind puts my body in constant fight-or-flight, and it’s clear it’s not something I can keep doing long-term. Hard to describe the way it feels, but it aint good.\n\nThat said, I want to use this as an opportunity to figure out what’s possible for someone in my position. I know I’m strong at being consultative: listening, understanding challenges a prospect/company is facing, and helping match them with a solution. I’ve also closed business before — I’m definitely a salesman when it comes time to put pen to paper — but I’m not naturally a pushy person, which makes pure cold-calling roles a poor fit. (Don’t mind doing it here and there).\n\nFor those of you who’ve made the jump away from SDR/BDR, what roles did you pivot into? Account Management? CSM? Partnerships? Sales Enablement? Something outside SaaS altogether?\n\nMy background so far is i",
    "url": "https://reddit.com/r/sales/comments/1n6so1t/exploring_next_steps_beyond_sdr_looking_for/",
    "score": 6,
    "num_comments": 18,
    "date": "2025-09-02",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "UnderstandingMean932",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "sales",
    "title": "Big hitter sitting on accounts making hitting quota impossible",
    "text": "Facing a bit of a challenge. I’m in my early 30’s, doing well at my company, been here 9 years, well thought-of by management, but I’ve got a challenge. I’ve recently moved into a part of the business with a specialised vertical market to sell into. There’s 1 other guy at the company selling into the same sector, he’s 65 at the end of the year, and a damn good salesman with 45+ years of experience in the industry, always hits his number. \n\nProblem is that he’s sitting on the big accounts, both current customers and prospects, around 80 of them (30 customers, 50 prospects).\n\nI feel that without a decent share of those 50 prospects my number isn’t ‘hittable’. 3 other people have tried and failed in my role in the last 5 years because of this - the remaining potential selling base is just far too small. \n\nDo I kick up a fuss and demand a share of these prospects thinking that if I don’t get them I’ll look around for a role at another organisation (I believe senior leadership wouldn’t want",
    "url": "https://reddit.com/r/sales/comments/1n8ooef/big_hitter_sitting_on_accounts_making_hitting/",
    "score": 145,
    "num_comments": 84,
    "date": "2025-09-04",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "cew90",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "accounting",
    "title": "26 y/o graduating soon, need help/advice on internship offer",
    "text": "Hello all,\n\nReposting since my post earlier didn’t get much traction, sorry in advance.\n\nI’m a career changer coming from an unrelated undergrad and finishing up my MSA in December of this year and will be CPA eligible. I recently started a position last month as a staff accountant in the DMV area. It’s my first accounting role and I’m enjoying the work, the team and the company. I do think that because it’s a smaller team, the room for growth could be limited. \n\nI received an offer from CohnReznick for an audit internship for this upcoming busy season. I would like the opportunity as I think it would provide more resources and room to grow, but I’m having concerns of leaving my full-time job for just an internship. Even if I received a return offer, at the earliest it would be in the fall of next year, meaning I’m out of work for months. \n\nI guess I’m just seeking other’s advice on what they would do in this situation. Would you take the internship? Also, doesn’t only 5 months or so w",
    "url": "https://reddit.com/r/Accounting/comments/1n2mk8w/26_yo_graduating_soon_need_helpadvice_on/",
    "score": 5,
    "num_comments": 9,
    "date": "2025-08-28",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Fabulous-Chocolate24",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "excel",
    "title": "Power query: alternative to \"group by\"",
    "text": "So I have a data set where there are multiples of two parameters\n\n(project name, cost type)\n\nin the other columns I have costs (all numbers)\n\nI want to summize (? sum)  all the duplicates, but without having to configure 50 columns like you do in \"group by\".\n\nI have thought of unpivot> pivot but that doesn't seem to work\n\nin another thread i came across this: List.Transform(ColumnList, (col) => {col, each List.Sum(Record.Field(_, col)), type number})\n\nbut those formulas I have trouble learning.\n\nanyone has a workable solution?/ a bit of an explanation of the solutions above?\n\nExcel version: Office 365",
    "url": "https://reddit.com/r/excel/comments/1n6l5u4/power_query_alternative_to_group_by/",
    "score": 7,
    "num_comments": 8,
    "date": "2025-09-02",
    "commercial_score": 8,
    "category": "missing_features",
    "author": "silentanthrx",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "shopify",
    "title": "Need Help Diagnosing a 70% Checkout Abandonment Rate on a Personalised Product Store (Data Inside)",
    "text": "Hi everyone,\n\nI'm hoping to get some expert eyes on a persistent checkout issue I've been facing for quite some time. My store sells personalised jewellery that requires customers to upload a photo using a third-party app (currently UploadKit, but previously Upload-Lift).\n\n**The Core Problem:** I have a universal checkout abandonment rate of around 70%, and my data shows it's significantly worse for my US customers.\n\n**My Data Analysis (12-Month Period):**\n\n* **Overall Checkout Abandonment:** \\~70% across all browsers.\n* **US vs. UK Checkout Abandonment:** The rate for my US customers is **\\~73%**, while for UK customers it's much lower at **\\~53%**.\n* **Top of Funnel is Working:** My ads are performing well, with a high Add to Cart rate (**7.9%** from Meta traffic), so I'm confident the issue is in the checkout process itself.\n\n**What I've Already Ruled Out:**\n\n* **Surprise Shipping Costs:** I offer free shipping.\n* **Payment Processor:** The issue persisted even after I switched from",
    "url": "https://reddit.com/r/shopify/comments/1muzd1q/need_help_diagnosing_a_70_checkout_abandonment/",
    "score": 3,
    "num_comments": 9,
    "date": "2025-08-19",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "stats1101",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "googlesheets",
    "title": "Looking for a monthly budgeting spreadsheet tailored for a car detailing business",
    "text": "Hey everyone 👋\n\nI’m looking for a simple but functional monthly budgeting spreadsheet that’s specifically tailored for a **car detailing business**.\n\nMost spreadsheets I’ve come across so far are focused on **personal finance** (savings, living expenses, etc.), but what I need is something that works for the **business model of car detailing**.\n\nFor example, something that can track:\n\n* expenses for chemicals and consumables\n* rent and utilities\n* marketing budget\n* number of clients and revenue per package (e.g. interior detail, polishing, ceramic coating…)\n* monthly profit/loss\n\nIf anyone already has a template they’re using, I’d really appreciate it if you could share. If not, even a more general small business spreadsheet that can be easily customized would be great.\n\nThanks in advance! 🙏",
    "url": "https://reddit.com/r/googlesheets/comments/1n98hdj/looking_for_a_monthly_budgeting_spreadsheet/",
    "score": 0,
    "num_comments": 1,
    "date": "2025-09-05",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "EveryBridge3377",
    "upvote_ratio": 0.5
  },
  {
    "subreddit": "Entrepreneur",
    "title": "How do you get your first clients as a freelancer?",
    "text": "Hey everyone,\n\nI’m a freelance web developer and I’m trying to start selling websites to small businesses and individuals. I’m still in the early stages and was curious about how you guys landed your very first clients.\n\nDid you find them through platforms like Upwork/Malt/Fiverr, by reaching out directly (cold emailing/calling), or maybe through personal connections? I’d really appreciate hearing about your experiences, what worked, what didn’t, and any advice you’d give to someone just starting out.\n\nThanks a lot in advance!",
    "url": "https://reddit.com/r/Entrepreneur/comments/1n5c9qg/how_do_you_get_your_first_clients_as_a_freelancer/",
    "score": 24,
    "num_comments": 47,
    "date": "2025-09-01",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "Lightwolf455",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "Entrepreneur",
    "title": "Im a solo-preneur - looking for some advice on what next!",
    "text": "Ok, so context: I run a one man band family business. My father started the company early 2000s and it had like 40 people (he bought another business). He sadly isnt operational, and it dwindled over the years. Fast forward to 2019 and it was just him in an office, which was tough to watch as he has been a big business icon for most of my life. So in 2019 I bought the company from him, and he stayed on to service legacy clients.\n\nThe problem is, I bought a job. I do the same job i did before, day in day out and have done for 5 nearly six years.\n\nIts stressful (we do staffing for pharma companies in a tight niche). I know I'm good at my sector, but we are UK based and the business turns over about £130K - £140K on a good year. Very low expenses (sub £20K) and then the rest is either spent avoiding tax or saved in an account for hiring. However, in the UK they seem to get you with every an all tax so we only have about £40K in savings in the business. I'm risk adverse so i've always kept",
    "url": "https://reddit.com/r/Entrepreneur/comments/1mkbllz/im_a_solopreneur_looking_for_some_advice_on_what/",
    "score": 6,
    "num_comments": 29,
    "date": "2025-08-07",
    "commercial_score": 7,
    "category": "general_frustration",
    "author": "AcceptableStudy760",
    "upvote_ratio": 0.88
  },
  {
    "subreddit": "Entrepreneur",
    "title": "I need help/advice",
    "text": "I am a solo “non” tech founder that has been working on the same project for 8 months. I have been attempting to make a large scale web app with many complex features but my site is NO WHERE near ready for production.\n\nI am not a coder/dev.\n\nI am a visionary and I have an unlimited amount of mental energy to dump into a purposeful project.\n\nI am great at envisioning systems that can give value to many people and parties.\n\nI also have lived in a rural farm town of 1300 my whole life. This has made a huge void in me that craves and desires more purposeful conversations, objectives, and goals.\n\nI am made to do great things way bigger than myself and I am unsure how to go about it. I have no connections regarding tech people or any wealth. \n\nWhat do you all recommend? \n\nI want to be a visionary of a huge team to create projects that are huge and will fulfill my missing pieces.\n\nAny responses are highly appreciated!",
    "url": "https://reddit.com/r/Entrepreneur/comments/1mz3mma/i_need_helpadvice/",
    "score": 2,
    "num_comments": 26,
    "date": "2025-08-24",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Dalt_the_investor",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "startups",
    "title": "My marketplace is losing customers to off-platform deals. How do I stop this? (I will not promote)",
    "text": "I’m building a marketplace that connects users with vendors (service aggregator). Users get multiple quotes and pick one. But there's a high chance for both sides to bypass the platform to avoid our commission. Users get a discount, vendors keep more money, and we lose the transaction.\n\nThis feels like the “Uber in their early days” problem where drivers cut the agent (Uber). My model depends on commissions, but this loophole is proving too easy.\n\nFor those who’ve faced this, what strategies, product features, or alternative business models have helped you keep transactions on-platform?",
    "url": "https://reddit.com/r/startups/comments/1mn489m/my_marketplace_is_losing_customers_to_offplatform/",
    "score": 19,
    "num_comments": 38,
    "date": "2025-08-11",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "siddhesh_007",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "startups",
    "title": "Lost in B2B sales, looking for advice - I will not promote",
    "text": "Hey hiveminds, I started a B2B SaaS 6 months ago with my friend, before that I was running a similar service side hustle on my own. Since the product is launched, we have kept bumping into sales troubles. I’d like to share you with my story and gather some feedback that we can try differently.\n\nThings we’ve tried but didn’t work for us:\n\n- We worked with couple sales and marketing coaches, we learnt the foundations of enterprise sales but none of coaches provides hands-on support but only thesis… we didn’t see any value and stopped working with them at the end.\n\n- We had tractions with big companies and executives, but the deals fell apart because of procurement and office politics.\n\n- Outbound email campaigns in a new market. We didn’t really understand how to run a email campaign and engaged with a freelancer, it didn’t end up working.\n\n- Engage with a high-profile startup advisor who has connections to ICPs and VCs. It ends he hasn’t delivered any introduction and we had to buy him ",
    "url": "https://reddit.com/r/startups/comments/1n1f1zp/lost_in_b2b_sales_looking_for_advice_i_will_not/",
    "score": 39,
    "num_comments": 36,
    "date": "2025-08-27",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "lyingondabitch",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "Looking for a Team or part of a Team to Build Something Together",
    "text": "Hey r/saas! I'm a marketer/designer who's been tinkering with coding and building small projects in my free time. I have about 11 years of experience in marketing and design, and I've managed to build a few things with what I call \"vibe coding\" - though most of you would probably call them wrappers. I did manage to sell one project (an AI CV maker), which was pretty exciting.\n\nI'm looking to either join an existing team or find a few people to start a group where we can build a SaaS product together. Nothing too ambitious at first - just something we can focus on and hopefully grow over time. I can contribute marketing and promotion experience, basic design skills, and some coding ability for building simple projects. I'm honestly just looking to break out of my routine work and collaborate with others who want to create something.\n\nI'm not claiming to be an expert at anything - just someone who's willing to learn and contribute. If you're looking for an extra team member, or if you wa",
    "url": "https://reddit.com/r/SaaS/comments/1n3ypjk/looking_for_a_team_or_part_of_a_team_to_build/",
    "score": 3,
    "num_comments": 12,
    "date": "2025-08-30",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "soundhumor",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "smallbusiness",
    "title": "Anyone else feel like they accidentally became a babysitter instead of a leader? How do you get your team to own their stuff?",
    "text": "I started my business to build something meaningful, but somehow I've become the person everyone runs to for every little decision. It's like being a parent to a bunch of grown adults - they won't make a move without checking with me first.\n\nAnyone else been stuck in this 'management trap'? How did you shift from being the go-to person for everything to actually having a team that takes ownership? Looking for real-world stories, not textbook answers.",
    "url": "https://reddit.com/r/smallbusiness/comments/1n8nmqt/anyone_else_feel_like_they_accidentally_became_a/",
    "score": 60,
    "num_comments": 41,
    "date": "2025-09-04",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Realistic_Row8898",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "smallbusiness",
    "title": "Need help finding a solid barbershop POS system",
    "text": "I’ve been running my barbering business for a while now and I’m finally looking to upgrade how we handle POS, scheduling, and overall shop operations. I currently use a POS and Google sheets for the rest but looking to combine everything into one software.\n\nFeatures I’m looking for:\n\n* A booking system that lets me my schedule\n* A way to keep track of returning clients and what services they get\n* Appointment reminders\n* Reports that show me how my business is doing\n* POS fees that isn't as expensive as Square\n\nSo far I’ve looked at:\n\n* Square: I currently use them for payments. But their rate is very high and have a lot complaints about scheduling and admin features.\n* Vagaro: Many features I'm looking for, but I don’t how it works specifically for barbershops.\n* Squire: They say their made for barbers but I heard their fees are also on the higher side.\n\nI’m not in a rush, but I want to make the right call soon. Also open to other suggestions if there’s something better I’m overlookin",
    "url": "https://reddit.com/r/smallbusiness/comments/1mr8u1g/need_help_finding_a_solid_barbershop_pos_system/",
    "score": 8,
    "num_comments": 26,
    "date": "2025-08-15",
    "commercial_score": 7,
    "category": "scaling_issues",
    "author": "accountibillabuddy",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "Looking for China 3pl for small e-commerce. Anyone ever heard of cfulfillment or has a good suggestion?",
    "text": "**OR based in any other country with low europe & canada shipping costs.**\n\nI am a small e-commerce shop with small volume (under 100/month) looking for a 3pl from china to ship internationally (I'm in Brazil and shipping here is $28 to anywhere, way too expensive).\n\nSmall items weighing 10grams.\n\nI found this one called cfcfulfillment that claims to have no minimums but I've not seen them mentioned anywhere. Anyone knows if they're good? Or has another suggestion?\n\nI only need no MOQ with cheap monthly storage & good shipping prices. Anything else is a bonus.",
    "url": "https://reddit.com/r/ecommerce/comments/1n2elow/looking_for_china_3pl_for_small_ecommerce_anyone/",
    "score": 9,
    "num_comments": 19,
    "date": "2025-08-28",
    "commercial_score": 7,
    "category": "cost_problems",
    "author": "Lithmariel",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "Looking for CRM/Order Management Recommendations for Hybrid Shopify + B2B Sales",
    "text": "Hey all,\n\nI run a small packaging supply business (jars and other supplies) selling to cannabis dispensaries, cultivators, and related businesses. Right now, our setup is a mix of:\n\nEcommerce: Customers order through our Shopify store.\n\nB2B direct sales: We do outreach, handle orders via spreadsheets, and bill manually outside Shopify.\n\n\nThe issue: Shopify works fine for ecommerce orders, but we don’t have a good way to manage sales pipelines, outreach, offline orders, and billing all in one place. Basically, we’re missing a CRM or order management system that ties it all together.\n\nIdeally, we’d like something that:\n\nIntegrates with Shopify for ecommerce orders\n\nLets us manage direct B2B sales (quotes, invoices, account tracking)\n\nSyncs or plays nicely with accounting (QuickBooks, Xero, etc.)\n\nIsn’t insanely expensive for a small but growing business\n\n\nHas anyone else dealt with this hybrid ecommerce/B2B model? What CRMs or systems would you recommend?\n\nThanks in advance!",
    "url": "https://reddit.com/r/ecommerce/comments/1na7d6s/looking_for_crmorder_management_recommendations/",
    "score": 3,
    "num_comments": 6,
    "date": "2025-09-06",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "anduril79",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "I’m so overwhelmed, help!",
    "text": "So, I am in the process of setting up a brand. I have kicked things off with a manufacturer and the product is in development. \n\nI have already done a lot of work on branding (brand strategy specifically) because I know how important the brand is. \n\nBut when it comes to visual branding, I have no idea. Shopify store, no idea. Building a wait list, no idea. Marketing, somewhat of an idea.\n\nI’m really set on building the brand and marketing the brand as much as the product. But I’m still in early stages and have no idea where to even start. I have also done a lot of market research such as market analysis, competitor analysis, positioning etc\n\nI look at the things I need to do, and just get lost. Also, my budget is very very lean. \n\nI see it as: Branding, product development, build the site, market it, build socials etc etc. I’m so just lost eve though I have a rough idea. Any tips??\n\nSorry if this post is all over the place. I’m just very lost and confused :/\n",
    "url": "https://reddit.com/r/ecommerce/comments/1nabe5c/im_so_overwhelmed_help/",
    "score": 12,
    "num_comments": 16,
    "date": "2025-09-06",
    "commercial_score": 7,
    "category": "scaling_issues",
    "author": "ComplexBottle5295",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "shopify",
    "title": "Looking for CRM/Order Management Recommendations for Hybrid Shopify + B2B Sales",
    "text": "Hey all,\n\nI run a small packaging supply business (jars and other supplies) selling to cannabis dispensaries, cultivators, and related businesses. Right now, our setup is a mix of:\n\nEcommerce: Customers order through our Shopify store.\n\nB2B direct sales: We do outreach, handle orders via spreadsheets, and bill manually outside Shopify.\n\n\nThe issue: Shopify works fine for ecommerce orders, but we don’t have a good way to manage sales pipelines, outreach, offline orders, and billing all in one place. Basically, we’re missing a CRM or order management system that ties it all together.\n\nIdeally, we’d like something that:\n\nIntegrates with Shopify for ecommerce orders\n\nLets us manage direct B2B sales (quotes, invoices, account tracking)\n\nSyncs or plays nicely with accounting (QuickBooks, Xero, etc.)\n\nIsn’t insanely expensive for a small but growing business\n\n\nHas anyone else dealt with this hybrid ecommerce/B2B model? What CRMs or systems would you recommend?\n\nThanks in advance!",
    "url": "https://reddit.com/r/shopify/comments/1na606o/looking_for_crmorder_management_recommendations/",
    "score": 3,
    "num_comments": 11,
    "date": "2025-09-06",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "anduril79",
    "upvote_ratio": 0.81
  },
  {
    "subreddit": "shopify",
    "title": "Need to vent. Shopify's Support is officially the worst it's ever been. Saddest part is 10 years ago Shopify Support was the best in class.",
    "text": "We are dealing with a minor issue I couldn't solve this morning so I reached out to the AI support chat.\n\nAfter a few minutes when the AI couldn't solve the problem it suggested I talk with a human and provided me a link to talk with human support.\n\nSeems simple enough, right?\n\nWRONG!\n\nIt takes me to a second AI where I explain that the first AI sent me here to talk to human support and I request to talk to a human. The AI denies that request - we rehash my issue - the AI still can't solve the problem so I ask again to connect me with a human.\n\nThe AI then tells me the following...\n\n*\"Shopify has updated its support system so that for most plans, including the Professional plan, the primary way to contact support is through the Help Center Assistant chat, which is available 24/7. Direct phone or email support is generally reserved for Shopify Plus or Retail plans.* ***This means that for your plan, human support is accessed by chatting with the Help Center Assistant first, which can th",
    "url": "https://reddit.com/r/shopify/comments/1n7flem/need_to_vent_shopifys_support_is_officially_the/",
    "score": 133,
    "num_comments": 109,
    "date": "2025-09-03",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "np819",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "shopify",
    "title": "Shopify Collective - some suppliers are just DS’ing",
    "text": "I own a Pet Treats and Supplies business, I have been trying out Shopify Collective for a little while now. Initially I was excited about it, but the more time goes on the more it’s turning me away. \n\nWhat is bugging me now is that I’ve discovered many suppliers don’t actually own physical stock of the products they are selling. What is happening is they are just DS’ing products from the brand or another supplier. This has caused numerous problems for orders because in most cases the “supplier” I’m connected with doesn’t actually have an accurate count of stock and they’ve just entered some random number for tracking inventory. Then things get messed up and you have to cancel orders because the “supplier” isn’t accurately accounting for available product inventory and they cant fulfill orders. \n\nI was concerned about this when I first joined as I do have a great relationship with many brands I already sell, and as I’ve tried to connect with them via Shopify Collective they have respond",
    "url": "https://reddit.com/r/shopify/comments/1na7xwa/shopify_collective_some_suppliers_are_just_dsing/",
    "score": 11,
    "num_comments": 6,
    "date": "2025-09-06",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "beej1254",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "buildinpublic",
    "title": "How to waste 2 Year while building a startup.",
    "text": "**Avoid marketing totally and keep building***,* because that is how you can waste not only 2 years of your life but your whole life.\n\n>Build and they will come.\n\nThat is what believed until now. And that is how i wasted almost 2 years, building and building and again building.\n\nI don't want anyone to waste 2 years, so kindly read this before even hitting your system for building.\n\nFirst let's forget that you build and they will come strategy, that is not gonna happen even in fairy land. People need to know that something like such exist to use.\n\nI totally ignored this part and kept building, i did some post on twitter, here and there, but post was just about building projects, and i was not consistent enough to post about my progress. So i stopped posting about the project once i finished building it, that is it that is what marketing looked like to me.\n\nOn the tech side i have invested much time, i have a 9-5 job as developer. I know how to build something and things can be build.\n\nS",
    "url": "https://reddit.com/r/buildinpublic/comments/1mlkhu9/how_to_waste_2_year_while_building_a_startup/",
    "score": 70,
    "num_comments": 38,
    "date": "2025-08-09",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "aforaman25",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "webdev",
    "title": "Would anyone be interested in an alternative to Outscrapper or Grapeleads?",
    "text": "I'm curious if there's appetite for a competitor. I've been dabbling with a concept to build but was curious if there's even a pain point. Not going to waste my time otherwise.\n\nDo you use any service to find businesses without websites? \nHow often / how much? \nWhat's missing from existing solutions?\nWhat's annoying or unnecessary? \nWhat feature would you love added that doesn't exist?  ",
    "url": "https://reddit.com/r/webdev/comments/1n49urz/would_anyone_be_interested_in_an_alternative_to/",
    "score": 0,
    "num_comments": 6,
    "date": "2025-08-30",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Chritt",
    "upvote_ratio": 0.5
  },
  {
    "subreddit": "dataengineering",
    "title": "Built a CLI tool for Parquet file manipulation - looking for feedback and feature ideas",
    "text": "Hey everyone,\n\nI've been working on a command-line tool called nail-parquet that handles Parquet file operations (but actually also supports xlsx, csv and json), and I thought this community might find it useful (or at least have some good feedback).\n\nThe tool grew out of my own frustration with constantly switching between different utilities and scripts when working with Parquet files. It's built in Rust using Apache Arrow and DataFusion, so it's pretty fast for large datasets.\n\nSome of the things it can do (there are currently more than 30 commands):\n\n* Basic data inspection (head, tail, schema, metadata, stats)\n* Data manipulation (filtering, sorting, sampling, deduplication)\n* Quality checks (outlier detection, search across columns, frequency analysis)\n* File operations (merging, splitting, format conversion, optimization)\n* Analysis tools (correlations, binning, pivot tables)\n\nThe project has grown to include quite a few subcommands over time, but honestly, I'm starting to run o",
    "url": "https://reddit.com/r/dataengineering/comments/1mmkgyn/built_a_cli_tool_for_parquet_file_manipulation/",
    "score": 14,
    "num_comments": 6,
    "date": "2025-08-10",
    "commercial_score": 7,
    "category": "workflow_problems",
    "author": "Vitruves",
    "upvote_ratio": 0.83
  },
  {
    "subreddit": "bookkeeping",
    "title": "How to create a mutual referral source as a CPA",
    "text": "Hi, would yall have any advice from a bookkeeper’s perspective, how they might take a CPA reaching out to them for referrals? What would their incentive be? \n\nI’m a Tax Professional, going all in and starting my own practice. I’ve reached out to 10-15 local bookkeeping shops I’ve found on Google and set up discovery calls for referral sources. The way I see it, while I don’t spend my time doing bookkeeping day to day, I understand GAAP and Tax Law very well and will be able to “review” the bookkeeping work at tax filing, and also advise the client to more work opportunities for the bookkeeper (payroll, different processes, etc.). Am I way off? ",
    "url": "https://reddit.com/r/Bookkeeping/comments/1n8uan5/how_to_create_a_mutual_referral_source_as_a_cpa/",
    "score": 11,
    "num_comments": 33,
    "date": "2025-09-05",
    "commercial_score": 7,
    "category": "automation_needs",
    "author": "New-Geologist-5003",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "wordpress",
    "title": "Need help with a response!",
    "text": "Hey community, I just got a response from 4 years of experience web dev team member at another company: “Your current site is on Lawlytics and when the new website is done, it will be built in Wordpress, and the lawlytics hosting will not work. For Wordpress sites we recommend WPEngine since it offers 3 different environments, security, daily backups and a great support team. It allows us to build and test features before we go live among other things.”  \n  \nThe problem is the client website is hosted in Cloudflare, and we don’t know how to respond to the person who has that 4 years of experience as a Director of Engineering, this message doesn't make sense to us. Lawlytics is literally a CMS.",
    "url": "https://reddit.com/r/Wordpress/comments/1ml7oqt/need_help_with_a_response/",
    "score": 3,
    "num_comments": 23,
    "date": "2025-08-08",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "PuzzleheadedJelly168",
    "upvote_ratio": 0.71
  },
  {
    "subreddit": "shopify",
    "title": "Looking for CRM/Order Management Recommendations for Hybrid Shopify + B2B Sales",
    "text": "Hey all,\n\nI run a small packaging supply business (jars and other supplies) selling to cannabis dispensaries, cultivators, and related businesses. Right now, our setup is a mix of:\n\nEcommerce: Customers order through our Shopify store.\n\nB2B direct sales: We do outreach, handle orders via spreadsheets, and bill manually outside Shopify.\n\n\nThe issue: Shopify works fine for ecommerce orders, but we don’t have a good way to manage sales pipelines, outreach, offline orders, and billing all in one place. Basically, we’re missing a CRM or order management system that ties it all together.\n\nIdeally, we’d like something that:\n\nIntegrates with Shopify for ecommerce orders\n\nLets us manage direct B2B sales (quotes, invoices, account tracking)\n\nSyncs or plays nicely with accounting (QuickBooks, Xero, etc.)\n\nIsn’t insanely expensive for a small but growing business\n\n\nHas anyone else dealt with this hybrid ecommerce/B2B model? What CRMs or systems would you recommend?\n\nThanks in advance!",
    "url": "https://reddit.com/r/shopify/comments/1na606o/looking_for_crmorder_management_recommendations/",
    "score": 5,
    "num_comments": 11,
    "date": "2025-09-06",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "anduril79",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "googlesheets",
    "title": "Looking for a more detailed Sheets sorting solution.",
    "text": "Hey there! Hoping that someone might be able to guide me to a more elegant sorting solution for my 3d printing orders.\nI'm working on a 755 piece custom 3d print run with 2- 3d printers. Each piece has a base color and text color dropdown column with about 30 color options listed. (Soooo maaaany color combos) \nMy rows are currently sorted by the Base Color column (A-Z) first, and then the Text Color  column (A-Z). I've exasperated myself trying to figure out how to sort things further so that I can batch print more efficiently. \n\nEx. I'd like to be able to view and batch print all items with \nBase Color- Royal Blue + Text Color- Red \nat the same time with all \nBase Color- Red + Text Color- Royal Blue \n\nWhile not specifically sheets related, if there are other ways to sort/prioritize/automate things using 2 Printers that can print up to 4 colors at once, I'm all ears for that as well.\n\nThis is my first run, so I'm trying to streamline the workflow as much as possible for future and like",
    "url": "https://reddit.com/r/googlesheets/comments/1mxfiig/looking_for_a_more_detailed_sheets_sorting/",
    "score": 1,
    "num_comments": 10,
    "date": "2025-08-22",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "i_makecoolstuff",
    "upvote_ratio": 0.66
  },
  {
    "subreddit": "slack",
    "title": "Unlock AI Power in Slack: How to Build Your Own Large Language Model Bot in Minutes!",
    "text": "How to Quickly Create a Slack Bot Integrated with a Large Language Model? ✨\n\nHey everyone! Today I want to share a super handy open-source project —  [**Muse Bot**](https://github.com/yincongcyincong/MuseBot/tree/main), a cross-platform chatbot powered by the powerful **LLM**, fully supporting Slack.\n\n# Why Choose Muse Bot?\n\n* Built-in commands: image generation, video generation, balance check, conversation clearing, and more\n\n* Easy and fast integration: just a few tokens to add a smart AI assistant to your Slack workspace\n* Supports both direct messages and channels for flexible use\n\n# Quick Start Guide\n\n# 1. Create a Slack Bot\n\nhttps://preview.redd.it/1yess9dhqdif1.png?width=2644&format=png&auto=webp&s=d268d75bfbb3204bf60ac2865532054bf516ed40\n\nHead over to the [Slack Developer Portal](https://api.slack.com/apps/) and create your app. Make sure to:\n\n* Set up **OAuth & Permissions** to get your `slack_bot_token` (format: `xoxb-xxx`)\n\nhttps://preview.redd.it/p9whl5uiqdif1.png?width=16",
    "url": "https://reddit.com/r/Slack/comments/1mnazzc/unlock_ai_power_in_slack_how_to_build_your_own/",
    "score": 0,
    "num_comments": 0,
    "date": "2025-08-11",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "SubstantialWord7757",
    "upvote_ratio": 0.29
  },
  {
    "subreddit": "PowerBI",
    "title": "How to ensure RLS doesn't get dropped",
    "text": "Hi all,\n\nI have a project where it's **extra critical that the RLS works as intended**.\n\nThe RLS itself is simple: **static RLS roles** (security groups). A few dim_tables filter all fact tables in the semantic model.\n\nHowever, it's crucial that the RLS doesn't get **unintentionally removed or broken** during the lifetime of the report and semantic model. Things that might happen:\n\n- The **RLS definition** gets dropped from a dimension table during alterations.\n- A **table relationship** gets dropped, causing the dimension table to no longer filter the fact table.\n\nHow can I minimize the risk of such errors occurring, or at least prevent them from being deployed to prod?\n\nWe're primarily using **Power BI Desktop** for semantic model and report development and **Fabric** with premium features.\n\n#RLS or separate semantic models?\nWould you recommend creating **separate semantic models** instead? We only have 5 static roles, so we could create separate semantic models (**filtered clones**)",
    "url": "https://reddit.com/r/PowerBI/comments/1n4uj2r/how_to_ensure_rls_doesnt_get_dropped/",
    "score": 0,
    "num_comments": 21,
    "date": "2025-08-31",
    "commercial_score": 7,
    "category": "automation_needs",
    "author": "frithjof_v",
    "upvote_ratio": 0.5
  },
  {
    "subreddit": "PowerBI",
    "title": "Need help with Data Modeling",
    "text": "Hi everyone. I'm working for an insurance company as a data analyst and I come in need of help in order to build a data model.\n\n  \nI currently have the following star schema:\n\nhttps://preview.redd.it/ldkjvcrjhrlf1.png?width=944&format=png&auto=webp&s=cc181543a1770dee1b773bd909d2cd02af6334f6\n\n  \nNow, the problem I'm having is when I introduce another fact table to the model:\n\nhttps://preview.redd.it/va1coxi3irlf1.png?width=1178&format=png&auto=webp&s=040510e187937d5bd10c870f970eadf529c83579\n\n  \nThe table fctProductionNumbers looks like this:\n\nhttps://preview.redd.it/drj4sbqiqrlf1.png?width=1383&format=png&auto=webp&s=0e0177f7e0c82ec6aea02f10b2211e7f367ee991\n\n\n\nAnd fctClaims looks like so:\n\nhttps://preview.redd.it/2wqsnjshqrlf1.png?width=1073&format=png&auto=webp&s=fbddbee927cf698e217ca85eb1ebb30b4dbf8bd7\n\n  \nThe granularity of fctProductionNumbers is at the policy level, whilst fctClaims is at the \"Coverage\\_Used\" level.\n\nIn other words, in fctProductionNumbers we have a unique row per ",
    "url": "https://reddit.com/r/PowerBI/comments/1n2dgfv/need_help_with_data_modeling/",
    "score": 2,
    "num_comments": 8,
    "date": "2025-08-28",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "vasHLoL",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "PowerBI",
    "title": "Power BI August 2025 Feature Summary",
    "text": "**Monthly Update**\n\nMicrosoft Power BI Updates Blog: [Power BI August 2025 Feature Summary](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/)\n\n* Some notable announcements:\n   * [Power BI DataViz World Championships](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/#post-30695-_Toc205561032) | [sub announcement](https://www.reddit.com/r/PowerBI/comments/1mii6nr/pbi_dataviz_world_champs_eu_edition/)\n   * [Copilot to write measure descriptions (Generally Available)](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/#post-30695-_Toc205561036) (more preview burndown!)\n   * [Support for org apps in Pro workspaces (Preview)](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/#post-30695-_Toc205561039)\n   * [TMDL view enhancements](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/#post-30695-_Toc205561041)\n   * [Semantic Model Refresh Templates with Fa",
    "url": "https://reddit.com/r/PowerBI/comments/1moedfr/power_bi_august_2025_feature_summary/",
    "score": 86,
    "num_comments": 79,
    "date": "2025-08-12",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "itsnotaboutthecell",
    "upvote_ratio": 0.91
  },
  {
    "subreddit": "Entrepreneur",
    "title": "I hate sales. How do I grow my business?",
    "text": "I'm a maker/builder at heart. I love creating the product and working with customers once they're signed up. But I absolutely dread the process of finding and selling to new customers. It gives me anxiety and I'm not good at it. For the other founders who hate sales, how did you get past this? Hiring sales person is not an option since I'm just starting out.",
    "url": "https://reddit.com/r/Entrepreneur/comments/1mp7sml/i_hate_sales_how_do_i_grow_my_business/",
    "score": 93,
    "num_comments": 122,
    "date": "2025-08-13",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "ingrid_diana",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "Entrepreneur",
    "title": "Business partners, looking for Co-Founders. Two years looking and still....",
    "text": "It's a long bloody tale and it's just getting started. I have a eco-system of companies that I am starting but I cannot do it by myself. I have no money just some pitch decks and ideas that I have already shown successfully to a VC and gotten several meetings. It wasn't the right culture fit, they offered $500k but it wasn't the right team. ",
    "url": "https://reddit.com/r/Entrepreneur/comments/1n6uc1w/business_partners_looking_for_cofounders_two/",
    "score": 1,
    "num_comments": 20,
    "date": "2025-09-02",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Sharkpunch007",
    "upvote_ratio": 0.6
  },
  {
    "subreddit": "startups",
    "title": "How do I hire the best first hires for my startup? I will not promote",
    "text": "I'm a solo-founder with a bootstrapped post-revenue startup. I've built the full product, marketed it, and generated revenue myself.\n\nOur main stack includes: typescript, NextJS, React, Tailwind over Vercel. While the product is already mature, I would like to hire some developers to take the development burden off me so I can concentrate more on getting clients and increasing our revenue. Hiring for startups is new to me, so I had some questions (maybe newbish, but pls help a fellow redditor):\n\n1. What should I look for in an ideal candidate? I don't want someone to just work for the paycheck. Of course, I'm willing to include equity upside as well, but I feel that the risk of having a wrong hire at this stage will be catastrophic.\n2. I feel I'm moving at a rapid velocity alone, but that's not sustainable in the long run. How can I ensure that hiring someone increases velocity as opposed to adding friction and grinding us to a halt?\n3. What timelines can I expect for joining if I star",
    "url": "https://reddit.com/r/startups/comments/1n92qk9/how_do_i_hire_the_best_first_hires_for_my_startup/",
    "score": 17,
    "num_comments": 42,
    "date": "2025-09-05",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "F_is_for_Frank",
    "upvote_ratio": 0.79
  },
  {
    "subreddit": "startups",
    "title": "Described as an “exited founder” when you exited because your company dissolved: honest? i will not promote",
    "text": "An acquaintance of mine describes himself as an “exited founder”.  He exited because his company went out of business.  He then sold the intellectual property to another company for $1.\n\nIs it honest of him to say that he’s an “exited founder”?\n\nYes, his company had a “deemed liquidation event” but it’s not that his company did well, or even ok, and was acquired.  It failed.",
    "url": "https://reddit.com/r/startups/comments/1nb3xi7/described_as_an_exited_founder_when_you_exited/",
    "score": 22,
    "num_comments": 23,
    "date": "2025-09-07",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Big_Celery2725",
    "upvote_ratio": 0.82
  },
  {
    "subreddit": "startups",
    "title": "In an investor pitch, can I copy from a competitor's report while citing it? (I will not promote)",
    "text": "There is a report from a competitor company that shows how much savings their solution has provided to their customers. Our technology is orders of magnitude better and cheaper, so it will provide more than their savings but with a fraction of the cost for operation for us. What I am trying to figure out is if we can just use their customer study in our pitch deck.",
    "url": "https://reddit.com/r/startups/comments/1naqnme/in_an_investor_pitch_can_i_copy_from_a/",
    "score": 11,
    "num_comments": 6,
    "date": "2025-09-07",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Specialist_Square818",
    "upvote_ratio": 0.83
  },
  {
    "subreddit": "startups",
    "title": "Suspecting software engineer is not doing any work - I will not promote",
    "text": "There is this weird situation that I am looking whether anybody has dealt with similar situation.\n\nIn short, I hired 1 senior software engineer. He has been working for the company now 2 years, however past few months I am suspecting he is not doing any work at work time.\n\nHe is always remote, except Fridays when he is in the office. He always commits (things that literally take a few minute to do) around 5PM - 7PM. He complains about everything when in the office, doesn't want to write tests, etc. Is quite slow to respond, and so on.\n\nThis has been reoccurring topic in last 1on1-s but nothing has improved.\n\nAlso, while not source of truth, his Teams status is always either away or offline. Even when he has Teams open, it still shows last seen on Wednesday for example. He is the only person who has such issues in the company which is bizarre to say at least so I suspecting he is doing something on his side intentionally for this. As a side note, he is on the Linux and I have yet to rol",
    "url": "https://reddit.com/r/startups/comments/1n9wni8/suspecting_software_engineer_is_not_doing_any/",
    "score": 37,
    "num_comments": 74,
    "date": "2025-09-06",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Glad-Statistician842",
    "upvote_ratio": 0.7
  },
  {
    "subreddit": "SaaS",
    "title": "🚀 Looking for 2–3 people to start a SaaS business/agency with me (30-day learning & planning sprint, starts in the 1st week of september,2025)",
    "text": "Hey everyone! 👋\n\nI’m kicking off a **30-day SaaS business/agency learning sprint** starting **September 1st week** and I’d love to find **2–3 determined people** to join me.\n\nThe idea:\n\n* Create a **small, private Discord group** (friendly & supportive)\n* Spend **8–12 hours a week** learning SaaS, automation, and business models\n* Share resources, hold each other accountable, and brainstorm niche ideas\n* At the end of 30 days, start **building & offering real services** together\n* It’s **beginner-friendly** – no experience needed, just determination!\n\nWhat I’m looking for:\n\n* People who **understand basic English** (to communicate well)\n* Can commit a few hours weekly\n* Are genuinely interested in **SaaS, automation, AI tools, or online businesses**\n* Want to **learn and grow together** in a team setting\n\nIf this sounds like you, **drop a comment or DM me** for the Discord invite. Let’s turn this into something awesome 🚀",
    "url": "https://reddit.com/r/SaaS/comments/1n7hpzb/looking_for_23_people_to_start_a_saas/",
    "score": 0,
    "num_comments": 13,
    "date": "2025-09-03",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Sufficient-Mobile884",
    "upvote_ratio": 0.25
  },
  {
    "subreddit": "SaaS",
    "title": "I have launched 3 SaaS business to combined MRR of over $200K. This is my playbook.",
    "text": "1. Pick an Idea that has been done before (Never a new Idea...too risky).\n2. Decide what is a ‘good enough’ MVP… this is harder to do than you think.\n3. Offer a Lifetime deal (LTD) and work with LTD Facebook groups to do giveaways and a private LTD.\n4. Never give an account away for free. Always charge. People don’t use freebies.\n5. Do as much work as possible to sell a private LTD.\n6. Write content. Lots of it.\n7. Launch on AppSumo marketplace.\n8. Do one last private LTD.\n9. Ask for Reviews on Truspilot etc\n10. Answer questions on Reddit and Quora.\n\nIf you’ve been successful in the above, you can have anywhere between $20K and $500K (or more) as a seed fund for your SaaS.\n\nUse this money sparingly to create content. Don't hire unless absolutely necessary. Hiring more people doesn't equal more growth. More people means a higher burn rate.\n\nDoes this strategy work? Yes.\n\nDoes it work fast?… No.\n\nIt’s really slow and boring. So make sure you don’t run out of money. Be very, very frugal. ",
    "url": "https://reddit.com/r/SaaS/comments/1nai0xs/i_have_launched_3_saas_business_to_combined_mrr/",
    "score": 254,
    "num_comments": 86,
    "date": "2025-09-07",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "my-mate-mike",
    "upvote_ratio": 0.91
  },
  {
    "subreddit": "smallbusiness",
    "title": "How do you deal with an employee that is nothing but chaos?",
    "text": "The title sounds bad but I am employee that works in the field that is just nothing but chaos.  She is so sweet and actually quite good at her job, but her anxiety and inability to problem solve are a terrible combination that leads to always having to deal with her.  \n\nI have 20 employees out in the field over 3 districts and she calls literally every day for assistance.  Once a week she’s having to call out because it’s always *something*.  Here’s the thing, it  genuinely is an actual problem. She isn’t lying and she isn’t lazy.   She is just so bad at managing the world around her she causes all these issues for herself.  \n\nNot one, but two flat tires at once because she drove over debris in the road. Allergic reaction and needing an epi pen because she didn’t check ingredients (twice in the last 6mo). Falling down at a clients house because there was construction at the back door and instead of just going around to the front door, she tried to jump over the workmen’s tools and the ",
    "url": "https://reddit.com/r/smallbusiness/comments/1mka510/how_do_you_deal_with_an_employee_that_is_nothing/",
    "score": 51,
    "num_comments": 81,
    "date": "2025-08-07",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Seastarstiletto",
    "upvote_ratio": 0.85
  },
  {
    "subreddit": "smallbusiness",
    "title": "Looking for a Virtual Assistant Agency $8 -15 per hour",
    "text": "Hey Reddit!\n\nBack in 2018 I worked with an agency that matched me with several VAs, and I ended up hiring an amazing Argentinian VA with a master’s degree for about $8/hr. I’m looking for something similar now for my Kintsugi business (12–20 hrs/month).\n\nTasks include: FAQs via Notion, messaging instructors, and prepping class docs. Must be comfortable with **Notion, Slack, Google Calendar, and Gemini**. Budget is **$10–$15/hr**.\n\nAny recommendations for agencies or independent VAs?",
    "url": "https://reddit.com/r/smallbusiness/comments/1mqo3rz/looking_for_a_virtual_assistant_agency_8_15_per/",
    "score": 0,
    "num_comments": 26,
    "date": "2025-08-15",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Comfortable_Way_4652",
    "upvote_ratio": 0.4
  },
  {
    "subreddit": "smallbusiness",
    "title": "Looking for a chatbot to help with orders and basic customer questions",
    "text": "Hey,\n\n\n\nI run a small online e commerce business and I’m trying to find a simple chatbot that can help me talk to customers on WhatsApp and Messenger.\n\nMost people just ask the same stuff over and over. Things like “Is this available?” or “Does it come in black?”, even though it’s already in the product info. Then they place an order, give me their details, and that’s it.\n\nIt’s starting to take too much time to handle all these messages manually, and I’d really like to automate the easy parts so I can focus on other stuff. Ideally, I just want the bot to reply to the common questions, take the order, and pass it to me if anything more complex comes up. I could just pass by the end of the day to collect data to organise the deliveries.\n\nIf anyone’s using something like that, I’d love some recommendations.\n\n\n\nThanks!",
    "url": "https://reddit.com/r/smallbusiness/comments/1mkwulo/looking_for_a_chatbot_to_help_with_orders_and/",
    "score": 7,
    "num_comments": 22,
    "date": "2025-08-08",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Boub1zzz",
    "upvote_ratio": 0.89
  },
  {
    "subreddit": "ecommerce",
    "title": "Looking for advice on how to form an LLC in TX? Is it possible or pipedream?",
    "text": "I’m based in Dallas and want to set up a small marketing agency, but the process feels overwhelming with all the forms, fees and legal steps. I’ve heard you can file directly through the Texas SOS website for around $300\\*. A friend mentioned LLC formation services that handle everything for you. Not sure if the extra cost is worth it.\n\nAlso curious about ongoing requirements like annual reports or franchise taxes. Anyone here gone through it recently?\n\n**Edit: Small update: Thanks for all the great input here! Hadn't given any thought to the compliance and filings side of things at all. Getting a bit of help and also checked out doola one option that was mentioned. Seems to be the easiest option.**   \n**Will update again if it ends up not being worth it** ",
    "url": "https://reddit.com/r/ecommerce/comments/1n2n3je/looking_for_advice_on_how_to_form_an_llc_in_tx_is/",
    "score": 22,
    "num_comments": 32,
    "date": "2025-08-28",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "em0297",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "ecommerce",
    "title": "Looking for advice on how to form an LLC in TX? Is it possible or pipedream?",
    "text": "I’m based in Dallas and want to set up a small marketing agency, but the process feels overwhelming with all the forms, fees and legal steps. I’ve heard you can file directly through the Texas SOS website for around $300\\*. A friend mentioned LLC formation services that handle everything for you. Not sure if the extra cost is worth it.\n\nAlso curious about ongoing requirements like annual reports or franchise taxes. Anyone here gone through it recently?\n\n**Edit: Small update: Thanks for all the great input here! Hadn't given any thought to the compliance and filings side of things at all. Getting a bit of help and also checked out doola one option that was mentioned. Seems to be the easiest option.**   \n**Will update again if it ends up not being worth it** ",
    "url": "https://reddit.com/r/ecommerce/comments/1n2n3je/looking_for_advice_on_how_to_form_an_llc_in_tx_is/",
    "score": 20,
    "num_comments": 32,
    "date": "2025-08-28",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "em0297",
    "upvote_ratio": 0.89
  },
  {
    "subreddit": "digital_marketing",
    "title": "How do you build brand awareness of a product on Instagram with low budget?",
    "text": "I am just starting in the world of marketing and not sure about the workflows, processes involved in growing brand awareness on social media without spending much money. Would really appreciate advice from people here could help me out with it  \n  \nIf you have any examples or personal stories, I’d love to hear them!",
    "url": "https://reddit.com/r/digital_marketing/comments/1n25z69/how_do_you_build_brand_awareness_of_a_product_on/",
    "score": 7,
    "num_comments": 17,
    "date": "2025-08-28",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "justdrissea",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "digital_marketing",
    "title": "How do you keep personal outreach when you start sending at scale?",
    "text": "Back when I first started with outreach, it was just me and a spreadsheet. I'd spend hours writing everything by hand, pulling bits from LinkedIn or a company site, and even though it was slow the replies actually came in because the messages felt real. Once the numbers went up, though, I caught myself sending emails that all had the same rhythm and tone. It stopped feeling like conversations and more like forms being filled out, and people just stopped answering.\n\nI've tried a bunch of ways to fix that. Narrowing down segments has helped a little since it keeps the tone closer to what matters for each group. I also tested out a few tools to take some of the busywork off my plate. One of them was Sendr, which I found through AppSumo, and I'll admit I wasn't sure it would work. But when I recorded one pitch and it turned into personalized versions that didn't feel flat, the replies proved it wasn't just a gimmick. Some people even wrote back saying it felt like the message was made for ",
    "url": "https://reddit.com/r/digital_marketing/comments/1n8zvn5/how_do_you_keep_personal_outreach_when_you_start/",
    "score": 3,
    "num_comments": 6,
    "date": "2025-09-05",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "BookishBabeee",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "digital_marketing",
    "title": "Looking for founder or operators that want to achieve higher leverage and focus.",
    "text": "All for free. I’m running some free test runs of a system I’ve built to help high-performers (entrepreneurs, creators, operators) save 10+ hours a week and increase leverage — without adding stress or overcomplicating their life.\n\nThis comes from years of studying productivity (20+ books, 100s of articles, frameworks from people like Alex Hormozi, Naval Ravikant, Cal Newport, Tim Ferriss, etc.) and then actually applying it myself:\n\t•\tTook my screen time from 11h/day to 1h/day\n\t•\tWent from obese → hybrid athlete (marathons + MMA)\n\t•\tBuilt a business while still having time for training and travel\n\nRight now I’m looking for 2–3 people willing to let me work with them for free until we hit a measurable result (e.g., hours saved, stress down, focus up). In return, I’d just love your honest feedback/testimonial if it works for you.\n\nIf you:\n\t•\tRun a business or have a high-output role\n\t•\tFeel like you’re constantly busy but not always moving the needle\n\t•\tWant more time for high-leverage w",
    "url": "https://reddit.com/r/digital_marketing/comments/1msn7tm/looking_for_founder_or_operators_that_want_to/",
    "score": 3,
    "num_comments": 3,
    "date": "2025-08-17",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Aztrobtw",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "freelance",
    "title": "How to uphold motivation even when things go well?",
    "text": "When things go well, I earn more than on average for a short-time, I tend to tell myself I can now slack a bit because it went so well. How to keep working optimally regardless of results? \n\nI know that 100% efficiency is not the most sustainable goal, but there is probably a way to mentally reframe the goal to something more productive like if I think about milestones instead of efficiency, doing additional work means getting there faster, not just some number in an infinite process. Or if I don't aim for 100% but for 80% efficiency, it's also easier and I probably get more done than when aiming at 100% ",
    "url": "https://reddit.com/r/freelance/comments/1n706gq/how_to_uphold_motivation_even_when_things_go_well/",
    "score": 3,
    "num_comments": 5,
    "date": "2025-09-03",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "mushykindofbrick",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "freelance",
    "title": "What is your policy for rounding time spent on client projects?",
    "text": "I'm currently writing down standards of practice for my business (freelance graphic designer) and trying to see what the most common standard is across the board for rounding time spent on client projects for billing. So, without further ado, a few questions:\n\n• Do you round your time at all when tracking time spent on projects?\n\n• Do you round your time per project, or per client?\n\n• Do you round at the end of each day, each week, or when the project is finished?\n\n• How do you inform and explain to clients about your practices on rounding time?\n\nAny additional insight would be appreciated, thanks!\n\n",
    "url": "https://reddit.com/r/freelance/comments/1n0soz2/what_is_your_policy_for_rounding_time_spent_on/",
    "score": 12,
    "num_comments": 19,
    "date": "2025-08-26",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "AndrewHarnoisDesigns",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "freelance",
    "title": "What would you do when the client doesn't have a clear request?",
    "text": "Hi, I'm working as a part-time music producer on Fiverr.\n\nI've got some orders to produce music and doesn't find yet how I should deal with the situation the client doesn't have a clear request.\n\nFor example, a client wanted me to make a tropical house song. I asked them to send me some reference songs to make sure what they want. I got the reference songs from them but they say \"I like the songs but need to change something. Please just make somethings like them.\"\n\nTo make sure what \"something\" means, I asked them some questions like bright or dark, soft or hard, bouncing or stable, any specific sounds they liked in the reference songs. I didn't ask them about any music theory things like chord progressions or scales because I know they are not music professionals.\n\nAlthough their answer was \"Not sure. Just make a demo and I'll think about it later\". I had a bad feeling that they would ask me to change a lot after I made demos. But I couldn't ask them anything anymore so I made some d",
    "url": "https://reddit.com/r/freelance/comments/1mo039j/what_would_you_do_when_the_client_doesnt_have_a/",
    "score": 20,
    "num_comments": 25,
    "date": "2025-08-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "K-Frederic",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "freelance",
    "title": "most of your next clients are your past clients, i tested this and it’s kinda working",
    "text": "so I tried almost every freelancing platform out there. spent enough money on bids, time on proposals but didn’t land a single gig. maybe the market is too saturated. maybe someone else was offering the same job for dirt cheap.\n\neither way, nothing worked.\n\nso i did the one thing left, went back to my 5year old emails and just said “Hey, how’s business?” to every old client. no pitch. no selling. just genuine curiosity.\n\nslowly took the conversation to: “have you thought of improving this?”\n\na couple of them show some interest and asked me to elaborate.\n\nwell, no projects yet. but the conversations are back. the loop’s warming up again.\n\nso yeah, sometimes, you don’t need new people. just new thoughts with the old ones. \n",
    "url": "https://reddit.com/r/freelance/comments/1lapkn3/most_of_your_next_clients_are_your_past_clients_i/",
    "score": 65,
    "num_comments": 34,
    "date": "2025-06-13",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "100xdakshcodes",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "juststart",
    "title": "If you haven't vibecoded yet and are a non technical idea person... boy are you missing out.",
    "text": "I have built profitable businesses before, and there always came a time when I had ideas that I relied on devs to ship out since I was too lazy to learn how to code.\n\nHowever, this wasn't just expensive, it caused friction as there was sometimes lack of clarity between what I had in my head and what the dev was capable of doing.\n\nIn 2023, when AI first started popping off, I started copying and pasting code snippets, but that proved to be difficult so I kind of threw away the whole vibe coding thing.\n\nBut today...wow.\n\nIn just 1.5 hours, I made a fully functional web app, complete with a freemium rate limit, paid integration to my Stripe account, a beautiful UI/UX, all with just a few prompts. It even debugged security issues for me.\n\nI learned a TON in the process too: About Supabase, Resender, Google OAuth integration, rate limiting etc... stuff I as a non-technical idea guy would never have thought about.\n\nThis app has lived in my head as an idea for over 6 long months now, and I al",
    "url": "https://reddit.com/r/juststart/comments/1n9jv1o/if_you_havent_vibecoded_yet_and_are_a_non/",
    "score": 19,
    "num_comments": 62,
    "date": "2025-09-05",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "broseidonswrath",
    "upvote_ratio": 0.59
  },
  {
    "subreddit": "juststart",
    "title": "I'm building a tool site (month 8 update)",
    "text": "After somewhat sluggish growth during spring time, my tool site [terrific.tools](http://terrific.tools) is now firing on all cylinders.\n\nIn [my last update](https://www.reddit.com/r/juststart/comments/1l9166q/finally_managed_to_double_traffic_month_7_update/), I reported that it took me almst four months to double my traffic from 10k to 20k sessions / month, in large parts due to Google not sending any traffic.\n\nWell, that seems to slowly change. Google finally started to show terrific tools some love, which allowed me to add another 4k sessions (now 24k sessions / month) in traffic.\n\nGoogle remains the world's largest search engine by a wide distance, so for this tool site project to become a success, it's instrumental that Google thinks it's just as terrific as I do.\n\nRight now, most of my time is spend focusing on our newest product Genviral ([www.genviral.io](http://www.genviral.io)), so I did not invest a great amount of time into terrific tools.\n\nI've mostly just continued adding",
    "url": "https://reddit.com/r/juststart/comments/1m8t8rp/im_building_a_tool_site_month_8_update/",
    "score": 18,
    "num_comments": 12,
    "date": "2025-07-25",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "OverFlow10",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "juststart",
    "title": "I'm building a tool site - here's how it's going (month 6)",
    "text": "On the 6-month mark of starting [terrific.tools](http://terrific.tools), I figured it would be a good time to update you guys where the project is at. Here's the [previous post](https://www.reddit.com/r/juststart/comments/1jsx02g/im_building_a_tool_site_heres_how_its_going_month/).\n\nWith every business endevour, there's going to be a moment where the puck simply stops moving upwards.\n\nIn the case of terrific tools, traffic has been largely flat at about 16k sessions / l30d for well over a month now.\n\nOn top of that, my request to join an ad network to monetize the site via display ads was declined, which means I haven't started monetizing terrific.tools as of now.\n\nFurthermore, Google seems to not like the project as much yet. Most of the traffic comes from Bing and Yandex while even substantially smaller search engines like DuckDuckGo send more traffic on certain days.\n\nIt's situations like these that ultimately determine success and failure. Many founders tend to give up, especially ",
    "url": "https://reddit.com/r/juststart/comments/1klkp1a/im_building_a_tool_site_heres_how_its_going_month/",
    "score": 18,
    "num_comments": 9,
    "date": "2025-05-13",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "OverFlow10",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Looking for a Cofounder for my Automation Business and my personal brand",
    "text": "Alright, I’ll keep it short.\n\nI’ve been neck-deep in AI + Automations for the past 8–9 months. Built a solid personal brand around it \\~70k followers on IG where I share stuff on AI agents, real automations, and no-fluff builds.\n\nFrom that audience I’ve already pulled in multiple paid automation projects (so it’s not just content, it’s revenue). All them were Inbound Leads, I have not sent a single outreach message till now..\n\nNow I’m looking for a technical cofounder, someone who:\n\nKnows how to code and can actually build things beyond the surface-level hype\n\nHas hands-on experience with AI automations, n8n, even voice AI agents... Even if you're not good at Ai Automations, it's fine But \"YOU MUST KNOW HOW TO CODE\"\n\nNot the Lovable Shit, please..\n\nThere’s a big opportunity here to build and scale together. If you’re technical and want to explore cofounding something real, DM me..",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n4tzma/looking_for_a_cofounder_for_my_automation/",
    "score": 2,
    "num_comments": 2,
    "date": "2025-08-31",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "BIG-BRO-100",
    "upvote_ratio": 0.76
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "I worked 100-hour weekz building my startup, hit $1.2M rev, then had a complete mental breakdown. Here's what hustle culture hides from you.",
    "text": "Wanted to share my story warts and all because man, the hustle can be brutal.\n\nTwo years ago, I was grinding non-stop. Like, 100-hour weeks: Mon–Fri 6 AM–11 PM. Saturdays 8 AM–8 PM. Sundays  “lighter” days, I told myself  were only six hours. I survived on energy drinks and Adderall. Thought I was “winning,” until… March 15, 2023.\n\nDuring a pitch to investors, I mid-sentence crashed. Hands shook, vision blurred, paramedics said it wasn’t a heart attack, just “stress.” But stress almost killed me. Soon after, panic attacks were daily, and some days I simply couldn’t get out of bed.\n\nI wound up collapsing the company not because the business failed, but because I did.\n\nI took 8 months off. Therapy twice a week. Needed anxiety meds (was too proud at first). Learned words like “boundaries” and “sustainable pace.” Eventually, I rebuilt… with limits: 50-hour max workweeks, sleep every night, even a proper 2-week no-email trip to Thailand.\n\n18 months later? We’re at $1.8M ARR. And I'm alive. ",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n8ztt9/i_worked_100hour_weekz_building_my_startup_hit/",
    "score": 100,
    "num_comments": 20,
    "date": "2025-09-05",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Mitul_G",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "indiehackers",
    "title": "I do not understand how to get the first users",
    "text": "Hi all,  \n  \nI have been coding and developing ideas for the past 7 years and every time i finish a product it never works till i just stop.  \n  \nThe thing is, I'm pretty sure that my ideas are good and useful, but I just can't get those first customers.\n\nFor example, right now I'm building a Proxy that helps users see the real cost and usage of the IA, if u have a website that uses OpenAI or any other LLM's u can get a report, costs, compare models and more stuff.  \n  \nIt's FREE! And even like that, i don't have users.\n\nPlease take a look at it and let me know if there is something bad. [Promptlytics](https://www.promptlytics.net/)",
    "url": "https://reddit.com/r/indiehackers/comments/1nao4mq/i_do_not_understand_how_to_get_the_first_users/",
    "score": 1,
    "num_comments": 10,
    "date": "2025-09-07",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Tall-Seat3901",
    "upvote_ratio": 0.6
  },
  {
    "subreddit": "indiehackers",
    "title": "I built GoConnect, a small alternative to Twitter(X)/Mastodon just for developers – would love your feedback",
    "text": "For the past few months, I've been working on a side project called GoConnect a [microblog](https://goconnect.dev/) . It aims to be a simple, community-based alternative to Twitter and Mastodon, but focused exclusively on developers.\n\nThe idea is to have a space where developers can share ideas, projects, snippets, and connect without the noise that typically occurs on mainstream platforms—without ads, without the noise. I know there are already large companies, but I felt something was missing: a more focused, minimalist, and developer-centric space.\n\nAny feedback, ideas, or even criticism would be greatly appreciated. [https://goconnect.dev/](https://goconnect.dev/)  \nIt currently has 500 users since the launch of its first version in January 2025.\n\nhttps://preview.redd.it/5vkqj4izwxkf1.png?width=1006&format=png&auto=webp&s=28ad87ff43ad718e4ad62f458cb223616bed591d",
    "url": "https://reddit.com/r/indiehackers/comments/1myrkp0/i_built_goconnect_a_small_alternative_to/",
    "score": 2,
    "num_comments": 0,
    "date": "2025-08-24",
    "commercial_score": 6,
    "category": "integration_problems",
    "author": "HeyBaldur",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "I failed. Hard. Then I learnt. I thank a career in sales for learning how to do outbound. Now I've built a product for account research and contact details.",
    "text": "I spent years, hating the quality of data enrichment tools out there for sales. \n\nDead phone numbers, wrong phone numbers.   \n  \nHours prospecting without knowing if a company was even a good fit. \n\nI co-founded a tool to solve my own problem, and started selling it this year.\n\nSimple mission.   \n  \nSimplify account research and give high quality contact details that actually work.\n\n1 web app. 1 API.\n\n**Journey so far**\n\n58 paying customers\n\n**They're saying**\n\n\\- 6x better mobile number coverage than Apollo\n\n\\- A lot easier to use than Clay\n\nDM me if you'd like a free trial",
    "url": "https://reddit.com/r/microsaas/comments/1mrzpn9/i_failed_hard_then_i_learnt_i_thank_a_career_in/",
    "score": 26,
    "num_comments": 27,
    "date": "2025-08-16",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Ryanrkb",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "microsaas",
    "title": "17 y/o founder of an AI SaaS — looking for a co-founder to scale InfluenceOS",
    "text": "Hey everyone,\n\nI’m 17 and currently building **InfluenceOS AI** — a SaaS platform that replaces overpriced “guru courses” with simple, AI-driven systems for creators and solopreneurs.\n\nI’ve built the roadmap, positioned the product, and I’m gearing up for launch. What I need now is a **co-founder** who:\n\n* Gets the SaaS/AI space.\n* Can bring skills in growth, sales, or product.\n* Wants to build something lean but scalable from the ground up.\n\nThe vision: **replace fake mentorship with smarter, automated systems** for a generation that can’t afford to waste $2k–$5k on fluff.\n\nIf this resonates, let’s connect — I’d rather build this with the right partner than do it solo.",
    "url": "https://reddit.com/r/microsaas/comments/1mzuwl5/17_yo_founder_of_an_ai_saas_looking_for_a/",
    "score": 2,
    "num_comments": 9,
    "date": "2025-08-25",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Individual_Mine1649",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "Follow this method if you are looking for validated ideas :- choose a Subreddit between 10K to 30K members and build a product around it.",
    "text": "Don't worry, I am not selling you anything... *yet :)*. Just trying to share some value from my experience.\n\nTwo biggest problems - Finding an idea to build, & Marketing it.\n\nMy advice - Choose a Subreddit with 10K to 30K members and build a product around it.\n\nWhy? - because each subreddit is already a niche, and if it has at least 10K members then I would consider it validated - **people have gathered there because of a problem** \\- either they need information or a community support.\n\nHow to start? - look at the subreddit communities that you are already a part of for personal interests, not for business purpose, and choose one.\n\nSince you would already have a good understanding of the problem/needs of that subreddit community, you can start helping them by providing valuable information and slowly mention your newsletter/directory, and build an audience. \n\nThen you can expand into discord/webapp/micro SaaS/mobile app etc. If you can build and own your audience, then you can think o",
    "url": "https://reddit.com/r/microsaas/comments/1n1giiv/follow_this_method_if_you_are_looking_for/",
    "score": 24,
    "num_comments": 6,
    "date": "2025-08-27",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Silver_Traffic_9790",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "🚀 Looking for 2–3 people to start a SaaS business/agency with me (30-day learning & planning sprint, starts in the 1st week of september,2025)",
    "text": "Hey everyone! 👋\n\nI’m kicking off a **30-day SaaS business/agency learning sprint** starting **September 1st** and I’d love to find **2–3 determined people** to join me.\n\nThe idea:\n\n* Create a **small, private Discord group** (friendly & supportive)\n* Spend **8–12 hours a week** learning SaaS, automation, and business models\n* Share resources, hold each other accountable, and brainstorm niche ideas\n* At the end of 30 days, start **building & offering real services** together\n* It’s **beginner-friendly** – no experience needed, just determination!\n\nWhat I’m looking for:\n\n* People who **understand basic English** (to communicate well)\n* Can commit a few hours weekly\n* Are genuinely interested in **SaaS, automation, AI tools, or online businesses**\n* Want to **learn and grow together** in a team setting\n\nIf this sounds like you, **drop a comment or DM me** for the Discord invite. Let’s turn this into something awesome 🚀",
    "url": "https://reddit.com/r/microsaas/comments/1n4ayl8/looking_for_23_people_to_start_a_saas/",
    "score": 2,
    "num_comments": 5,
    "date": "2025-08-30",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Sufficient-Mobile884",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "buildinpublic",
    "title": "Solo dev's first project - Looking for feedback. 🥺",
    "text": "## The Story\nJust spent half a year (on and off, with way too much coffee) building my very first product as an indie developer!\n\nIt's \"just\" a time management toolkit, but it means the world to me 😭\n\n🌐 **Check it out**: [ClockZone](https://clockzone.net)\n\n## 🎯 What I Built\n\nBasically threw all the time tools I use daily into one place:\n- ⏰ **Timer** - No more burnt dinners or missed meetings\n- ⏱️ **Stopwatch** - For when you need to time literally everything  \n- ⏳ **Countdown** - \"How many days until Christmas?\" - Now you know\n- 🌍 **World Clock** - Stop mental math for timezones\n- 📅 **Holiday Calendar** - Global holidays at your fingertips\n- 🧮 **Date Calculators** - Business days, date math, etc.\n- 🔗 **Embeddable Widgets** - Can be embedded into your own websites\n\n## ✨ Key Features\n- 40+ languages supported (thanks ChatGPT!)\n- Dark mode (because we're all vampires)\n- Responsive design for mobile and desktop\n- Pretty decent loading speeds\n\n## 😅 Lessons Learned (The Hard Way)\n1. **Inter",
    "url": "https://reddit.com/r/buildinpublic/comments/1n0bi43/solo_devs_first_project_looking_for_feedback/",
    "score": 5,
    "num_comments": 3,
    "date": "2025-08-26",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Status_Audience5877",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "webdev",
    "title": "How do I convince my bosses to drop the company that was supposed to build our website? (Updated)",
    "text": "An update.\n\nhttps://www.reddit.com/r/webdev/s/ia01Alm3E3\n\nI had my first meeting with his team. My supervisor was on the call. She wanted me on the call since I would have to work with them directly. After hearing them speak for a little I realized it was definitely bullshit. They had no idea what they were talking about, just throwing buzz words around.\n\nI spoke up and asked the owner about his process. He mentioned profiles and user testing and I asked \"why wasn't that being done before launch?\"\n\n He said they didn't have proper analytics on the current site. That the site was broken. Although our marketing agency had no issues with it and we still received donations just fine.\n\nI asked \"why wasn't the analytics addressed before building the new site if it didn't have the proper data?\"\n\n He very quickly got angry with me. He said he had someone discussing it with the CEO. I didn't realize at the time that he started raising his voice as I was taking notes.\n\nHe said they needed \"fresh",
    "url": "https://reddit.com/r/webdev/comments/1n3bbm5/how_do_i_convince_my_bosses_to_drop_the_company/",
    "score": 232,
    "num_comments": 66,
    "date": "2025-08-29",
    "commercial_score": 6,
    "category": "scaling_issues",
    "author": "Gold-Relief-3398",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "webdev",
    "title": "Looking for chromium browser alternatives to Brave",
    "text": "I switched from Chrome to Brave after hearing so many good things about it. I've been using it for a few months, and it's been alright for the most part, and while it did great in removing the bloat found in Chrome, I found it had a bit of bloat of its own (like the crypto bs everywhere, which I know is all opt-in, but if I can use a browser that doesn't shove it to my face by default that would be great).\n\nRequirements:\n\n* Must be chromium and decent for web development (this is for work)\n* Available on windows, macOS and iOS + history and bookmark syncing across different platforms\n* Option to have multiple profiles\n* Better privacy and less bloat than Chrome",
    "url": "https://reddit.com/r/webdev/comments/1n57yvk/looking_for_chromium_browser_alternatives_to_brave/",
    "score": 6,
    "num_comments": 45,
    "date": "2025-08-31",
    "commercial_score": 6,
    "category": "missing_features",
    "author": "Wyrda22",
    "upvote_ratio": 0.61
  },
  {
    "subreddit": "dataengineering",
    "title": "How do senior data engineers view junior engineers using LLMs?",
    "text": "At work, I'm encouraged to use LLMs, and I genuinely find them game changing. Tasks that used to take hours, like writing complex regex, setting up tricky data cleaning queries in SQL, or scaffolding Python scripts, now take way less time. I can prompt an LLM, get something 80% of the way there, and then refine it to fit the exact need. It’s massively boosted my productivity.\n\nThat said, I sometimes worry I’m not building the same depth of understanding I would if I were digging through docs or troubleshooting syntax from scratch. But with the pace and volume of work I’m expected to handle, using LLMs feels necessary.\n\nAs I think about the next step in my career, I’m curious: how do senior data engineers view this approach? Is leveraging LLMs seen as smart and efficient, or does it raise concerns about foundational knowledge and long-term growth?\n\nWould love to hear your thoughts, especially from those who mentor or manage junior engineers.",
    "url": "https://reddit.com/r/dataengineering/comments/1mqertd/how_do_senior_data_engineers_view_junior/",
    "score": 134,
    "num_comments": 56,
    "date": "2025-08-14",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Firefly-ssa",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "dataengineering",
    "title": "How do you schedule dependent data models and ensure that the data models run after their upstream tables have run?",
    "text": "Let's assume we have a set of interdependent data models. As of today, we offer the analysts at our company to specify the schedule at which their data models should run. So if a data model and its upstream table (tables on which the data model is dependent) is scheduled to run at the same time or the upstream table is scheduled to run before a data model, there is no problem (in case the schedule is the same, the upstream table runs first).\n\n  \nIn the above case, \n\n1. The responsibility of making sure that the models run in the correct order falls on the analysts (i.e. they need to specify the schedule of the data models and the corresponding upstream tables correctly).\n\n2. If they specify an incorrect order (i.e. the upstream table's scheduled time is after the corresponding data model), the data model will be refreshed followed by the refresh of the upstream table at the specified schedule.\n\nI want to validate if this system is fine or should we make any changes to the system. I hav",
    "url": "https://reddit.com/r/dataengineering/comments/1n3v5p5/how_do_you_schedule_dependent_data_models_and/",
    "score": 11,
    "num_comments": 20,
    "date": "2025-08-30",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "the-fake-me",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "dataengineering",
    "title": "When should I start looking for a new job?",
    "text": "I was hired as a “DE” almost a year ago. I absolutely love this job. It’s very laid back, I don’t really work with others very much, and I can (kinda) do whatever I want. There’s no sprints or agile stuff, I work on projects here and there, shifting my focus kinda haphazardly to whatever needs done. There’s just a couple problems.\n\n1. I make $19/hr. This is astronomically low, though what I’m doing isn’t all that hard.\n2. I don’t think my work is the same as the rest of the industry. I work with mostly whatever tools I want, but we don’t do any cloud stuff, I don’t really collaborate with anyone, there’s no code reviews or PRs or anything like that. My work mainly consists of “find x data source, setup a way to ingest it, do some transformations, and maybe load it into our DB if we want it.” I mostly do stuff with polars, duckdb, and sometimes pandas. I also do some random things on the side like web scraping/browser automation. We work with A LOT of data, so we have 2 beefy servers, b",
    "url": "https://reddit.com/r/dataengineering/comments/1mtsgz9/when_should_i_start_looking_for_a_new_job/",
    "score": 10,
    "num_comments": 23,
    "date": "2025-08-18",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "echanuda",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "dataengineering",
    "title": "After 8 years, I'm thinking of callling it quits",
    "text": "**After working as a DA for 1 year, DS/MLE for 3 years, and DE for 4, my outlook on this field (and life in general, sadly) has never been bleaker.** \n\nEvery position I've been in has had its own frustrations in some way: team is overworked, too much red tape, lack of leadership, lack of organization/strategy, hostile stakeholders, etc...And just recently, **management laid off some of our team because they \"think we should be able to use AI to be more productive\".** \n\nI feel like I have been searching for that mystical \"dream job\" for years, and yet it seems that I am further away from obtaining it as ever before. With AI having already made so much progress, I'm starting to think that this dream job I have been looking for may no longer even exist. \n\nEven though I've enjoyed my job at times in the past, **at this point, I think I'm done with this career.** \n\nI have lost all the passion that I originally had 8 years ago, and I don't foresee it ever returning. What will I do next? Who ",
    "url": "https://reddit.com/r/dataengineering/comments/1navs38/after_8_years_im_thinking_of_callling_it_quits/",
    "score": 110,
    "num_comments": 45,
    "date": "2025-09-07",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Fonduemeup",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "datascience",
    "title": "Is it wrong to be specialized in specific DS niche?",
    "text": "Hello fellows Data Scientists!\nI’m coming with question/discussion about specialization in specific part of Data Science. For a long time my main duty is time series and predictive projects, mainly around finance but in retail domain. As an example, project where I predict sales per hour for month up front, later I place matrix with amount of staff needed on specific station to minimize number of employees present in the location (lot of savings in labor costs). Lately I attended few interviews, that didn’t go flawlessly from my side - most of questions were around classification problems, where most of my knowledge is in regression problems, of course I’m blaming myself on every attempt where I didn’t receive an offer because of technical interview and there is no discussion that I could prepare myself in more broad knowledge. But here comes my question, is it possible to know deeply every kind of niche knowledge when your main work spins around specific problems? I’m sure there are l",
    "url": "https://reddit.com/r/datascience/comments/1n6ez8o/is_it_wrong_to_be_specialized_in_specific_ds_niche/",
    "score": 36,
    "num_comments": 49,
    "date": "2025-09-02",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "jesteartyste",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "ProductManagement",
    "title": "How do you handle delays? Are they really inevitable to some extent, or I am doing something wrong?",
    "text": "I lead a 10-person engineering team, yet our projects almost always ship late - sometimes by a week or two, sometimes by as much as ten. It’s starting to make me question my competence.\n\nI know Hofstadter’s Law (everything takes longer than you expect, even after you account for that), but I still wonder if I’m missing something.\n\nHow do you handle such delays? How do you explain them upstream? I report directly to the CEO, and every delay fills me with anxiety. “It is what it is” can not fly, but I struggle to offer anything more tangible.\n\nI’d appreciate any practical strategies - process tweaks, expectation-setting tips, whatever works for you - to keep both projects and exec nerves on track. I believe this is an important skill of a Product Manager and I feel currently lacking in this, snowballing to immense impostor syndrome.",
    "url": "https://reddit.com/r/ProductManagement/comments/1n1gypr/how_do_you_handle_delays_are_they_really/",
    "score": 66,
    "num_comments": 58,
    "date": "2025-08-27",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "utkarshmttl",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "ProductManagement",
    "title": "Need help: is my firm Fintech or Wealth Management and are they product or sales driven?",
    "text": "I won’t say the name of my firm as I want it to remain unknown, partially for privacy and partially because I feel many company’s may have a similar identity issue.\n\nThe company I work at is an independent broker dealer. The primary metrics which drives the stock prices are Assets Under Management AUM and the number of advisors at the firm (both growth and attrition). This leads me to believe we are a through and through sales driven org.\n\nWhere I get confused is, leadership calls us a fintech company (our tech is pretty crummy). If it was only communicated externally as market I would be okay with it, but it’s not. The tech and product org truly believe we are a fintech product driven org. It creates a lot of confusion between business, product, design, and tech.\n\nAs I’m one of the few people that see the misalignment, I feel I have a clear and powerful opportunity to align myself to sales leadership and be one of the few product people driving the sales led vision. My only worry is t",
    "url": "https://reddit.com/r/ProductManagement/comments/1mx8oj1/need_help_is_my_firm_fintech_or_wealth_management/",
    "score": 0,
    "num_comments": 11,
    "date": "2025-08-22",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Smithc0mmaj0hn",
    "upvote_ratio": 0.36
  },
  {
    "subreddit": "ProductManagement",
    "title": "Looking for advice on creating an allocation model for tech debt, KTLO, and business releases",
    "text": "Hi everyone,\n\nAt my current company, we don’t have a formal allocation model for tech debt, business releases, and maintenance/KTLO. Right now, every quarter I sit down with engineering managers and negotiate percentages (e.g., 0-10% for tech debt). But since leadership pushes heavily for business releases to show impact, tech debt often takes a back seat.\n\nEngineering has been informally handling this by sneaking tech debt work into business release tickets. While I appreciate the effort, it’s not transparent, and it doesn’t help leadership see the importance of addressing tech debt early.\n\nTo bring more structure and transparency, I’m working with my engineering manager to propose an allocation model like this:\n\n* **20%** Tech Debt, **30%** Maintenance / KTLO**, 50%** Business Releases\n\nMy questions:\n\n1. What metrics should I track to measure whether tech debt is being meaningfully addressed?\n2. Are there good ways to tie this back to developer productivity, system resilience, or lon",
    "url": "https://reddit.com/r/ProductManagement/comments/1n085qu/looking_for_advice_on_creating_an_allocation/",
    "score": 1,
    "num_comments": 3,
    "date": "2025-08-26",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Humble-Pay-8650",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ProductManagement",
    "title": "Product Analytics lead looking for direction",
    "text": "I recently joined a digital product, subscriber based company as a Product Analytics lead.  \n\nMy main goal is to work with Product Managers to understand what are the measures of success, what should we track and maintain the data catalog (somewhat). I have a digital analytics background but this work is very different.\n\nI am having a hard time grasping what to do and how to provide the most value, there are so many products, it looks like my teams doesn’t have a great relationship with Product Managers and everything is disorganized.\n\nAdvice on what PMs look to product analytics folks for help, how to build that great relationships and what should be my priorities. \n\nThanks!",
    "url": "https://reddit.com/r/ProductManagement/comments/1mo8s4c/product_analytics_lead_looking_for_direction/",
    "score": 1,
    "num_comments": 2,
    "date": "2025-08-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "dwaz0",
    "upvote_ratio": 0.6
  },
  {
    "subreddit": "projectmanagement",
    "title": "How to deal with developers that aren't very good",
    "text": "I'm really stuck. I left a company that was one of the best in my industry to join a more immature company operating in the same industry but slightly different technology. So from a team of 25 devs and 3 PMs to 6 devs and me the only PM. They've never had a PM function before so just seem to think I'm there to do documentation. \n\nIn my previous role all my devs loved having me in calls and to bounce solutions and ideas. I just can't get in with these new ones. They don't seem to cc me in emails either. And one developer in particular is just useless in the their technical ability and lack of technical advice they're providing on client calls. I find it embrassing, I have to speak for them. They seem to want to just to what they're told rather than provide consultancy when we are meant to be the experts.  \n\nTrouble is the Head of the developers is also not very good in my view. Quite how he worked his way up, I have no idea. He doesn't even ask basic questions when clients ask for new ",
    "url": "https://reddit.com/r/projectmanagement/comments/1n1qlo4/how_to_deal_with_developers_that_arent_very_good/",
    "score": 45,
    "num_comments": 23,
    "date": "2025-08-27",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Kinderventure",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "projectmanagement",
    "title": "Being valuable as a PM isn’t always about the value you create",
    "text": "One of the more uncomfortable things I’ve learned in this job is that doing good work and being seen as doing good work are not the same thing.\n\nEarly in my career, I thought that if I kept projects on track, cleaned up messy processes and made the team’s life easier, that would automatically speak for itself. Turns out… it doesn’t. Half the time, the people above you don’t even notice because all they see is “things are running fine”.\n\nMeanwhile, the PM who spends more time framing slides for leadership than actually fixing problems often ends up looking like the “strategic thinker”.\n\nIt feels backwards but ignoring it can stall your career. The truth is: perception management is part of the role whether we like it or not. That doesn’t mean faking impact or playing politics but it does mean you have to make your work visible, put it in the right language and make sure the right people hear it. Otherwise, you’re just quietly holding things together while someone else gets the credit.\n\n",
    "url": "https://reddit.com/r/projectmanagement/comments/1n850ba/being_valuable_as_a_pm_isnt_always_about_the/",
    "score": 264,
    "num_comments": 45,
    "date": "2025-09-04",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Big-Chemical-5148",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "sales",
    "title": "How do I transition from HVAC sales into SaaS?",
    "text": "Hey everyone,\n\nI’ve been in sales my whole career and consistently performed at the top in every role I’ve taken on. Right now, I’m a residential HVAC salesman closing about 47% of \\~450 appointments per year, moving around $2M in revenue annually, directly with homeowners.\n\nI want to pivot into SaaS and ideally land a remote position. Last year I made \\~$180K CAD, but I’d be comfortable stepping back to \\~$140K (or even a bit less) for the right opportunity if it comes with growth and education in the SaaS space.\n\nAt 35, I know I bring strong closing ability, consultative sales experience, and proven revenue results — but I’m unsure how to position myself for SaaS and where to start.\n\nFor those who’ve made a similar transition (or hire in SaaS sales):\n\n* What’s the best entry point (SDR, AE, closer roles)?\n* How do I frame my background so SaaS companies see the fit?\n* Any recommended resources, communities, or job boards to target?\n\nReally appreciate any advice or perspective.",
    "url": "https://reddit.com/r/sales/comments/1n5vyam/how_do_i_transition_from_hvac_sales_into_saas/",
    "score": 14,
    "num_comments": 55,
    "date": "2025-09-01",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "RaiseTheFuckingBar",
    "upvote_ratio": 0.77
  },
  {
    "subreddit": "sales",
    "title": "Sales Transition",
    "text": "I’m in heavy duty truck sales. The last few years have been incredible, $250k-$300k. This year will be about $279k; but I’m burnt out and things are changing big time. Margins about about to go down big time as inventory levels increase and will probably need to sale double to make the same amount (not really feasible in my given territory). I’ve always thought I would transition into management. I love the company I work for and the products we represent. I’m not in the mindset of leaving and really not interested in moving on from my employer.  So I went to my stores general manager a few weeks ago and had a conversation with him about my future with the company and to come up with a 5 and 10 year plan. \n\nHe proposed a plan today that would essentially make me an assistant sales manager. I will still maintain a few of my customers, but take over some of the administrative responsibilities. Which I do enjoy; from spec’ing trucks, putting deals together, working with the upfitters, etc",
    "url": "https://reddit.com/r/sales/comments/1n9nr7l/sales_transition/",
    "score": 33,
    "num_comments": 23,
    "date": "2025-09-06",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Timely-Historian-786",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "sales",
    "title": "BDR’s booking fake meetings",
    "text": "This is a vent post.\n\nWe’re a 4 person BDR team working under 6 AEs, with each BDR paired to 1 or 2 AEs.\n\nHere’s what I’m struggling to wrap my head around.\n\nApproach 1: Two of the BDRs just send random LinkedIn invites to prospects with a note asking for “15 minutes,” and then immediately go into the system and log it as a booked meeting.\n\nApproach 2: They’ll get a prospect on the phone, the prospect shows no interest, and then they say something like “Hey, I’ll just send over a placeholder for next month as an intro, we can move it around if that time doesn’t work.” The prospect brushes them off, but these guys still log it in the system as a discovery call.\n\nMeanwhile, me and the other BDR who actually qualify and work accounts properly are averaging 1-2 real meetings per week, while these guys are racking up 3 or 4 fake ones. The worst part is they’re getting praised for it like they’re killing it.\n\nI’m honestly dying of frustration here. This isn’t some small shop either. Our clie",
    "url": "https://reddit.com/r/sales/comments/1n8d91c/bdrs_booking_fake_meetings/",
    "score": 186,
    "num_comments": 149,
    "date": "2025-09-04",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Best-Pumpkin-6811",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "accounting",
    "title": "Got fired for policy violation at office building. How do I explain and recover from this during interviews?!?!?!",
    "text": "I worked at a commercial office building with mutiple floors. Each floor would have several other business tenants. During my lunch break, I would take the stairs and pass through the hallways of other floors in the building. Each floor and the individual office suite entrances would have different layout and designs. I would walk by and glance around. Sometimes during off hours to pass time I would walk around the building floors. One of the other business tenants noticed this and reported it to building management. Building management relayed information to my employer. The holdings company that handles the HR department, fired me immediately. After 8 years of steady employment with no issues in regards to performance.\n\nI am now terminated with a obvious not eligible for rehire mark due to my strange proclivity to wander and explore a building I worked at. I am now unemployed for the past two weeks, applying to whatever entry and staff accountant job I can find. I have 11 phone scree",
    "url": "https://reddit.com/r/Accounting/comments/1mntch3/got_fired_for_policy_violation_at_office_building/",
    "score": 297,
    "num_comments": 196,
    "date": "2025-08-11",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "dwu933127",
    "upvote_ratio": 0.89
  },
  {
    "subreddit": "bookkeeping",
    "title": "Clio + QBO (looking for tips (plus ranting))",
    "text": "I have a small law firm client that uses Clio + QBO. It used to be fine but the last several months have been a ridiculous mess and it just keeps getting worse. And Clio is all, 'it looks fine to us' & QBO is all 'take it up with Clio'\n\nI'm in Canada so Clio Accounting isn't available. I feel like ever since they launched Clio Accounting they just give zero fucks about the Clio+QBO sync. I'm extra salty about this because Clio is a Canadian company & their Canadian customers are getting screwed here.\n\nI HATE IT SO MUCH. They used to be one of my favourite clients (I still like the people, none of this is their fault) but this is killing me. I miss when it worked :(\n\nRant over.\n\n# Any tips for Clio+QBO welcome!",
    "url": "https://reddit.com/r/Bookkeeping/comments/1n6p3kr/clio_qbo_looking_for_tips_plus_ranting/",
    "score": 7,
    "num_comments": 1,
    "date": "2025-09-02",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "noRehearsalsForLife",
    "upvote_ratio": 0.78
  },
  {
    "subreddit": "bookkeeping",
    "title": "Do you ever have to “ghost” former clients?",
    "text": "I’m finishing up an engagement for the most annoying client I’ve ever had. I’ve already let them know that this will be my last engagement and I’ll finish up the work I agreed to do, but I will not be taking on anything additional. \n\nI just have a feeling they’re not going to leave me alone after this project ends. They’ve already asked a few different times like “oh but if we need something else down the line, we can still reach out, right?” To which I responded unfortunately, no. This will be my last engagement. Then they’ve had other people at the company ask me too, and I tell them the same thing. \n\nI’m already preparing for how I’m going to handle it, because I’m honestly going to be so relieved when this project ends and I never have to work with them again. It’s truly been the worst. \n\nSo if the client doesn’t leave me alone, there’s probably a certain point where I’ll just have to go ghost, right? It feels unprofessional. But what do you do when you’ve said the same thing seven",
    "url": "https://reddit.com/r/Bookkeeping/comments/1nahnlf/do_you_ever_have_to_ghost_former_clients/",
    "score": 20,
    "num_comments": 30,
    "date": "2025-09-07",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "heart_of_gold2",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "excel",
    "title": "How do you automate Excel? VBA, Power Query, Python — curious what you use",
    "text": "Hello all. I’m a senior in business school, and last summer during my internship, I built a VBA macro (with the help of Copilot) that ended up saving hundreds of hours for my team and was rolled out nationwide. That experience showed me how powerful automation can be — but also how confusing VBA/automation can feel for many people.\n\nNow I’m writing my thesis on Excel automation, and I’d love to hear from people who live in spreadsheets:\n\n* What’s the most helpful automation you’ve built or used?\n* What’s the hardest or most frustrating part of working with VBA/automation?\n* Do you have any stories where automation saved you… or totally backfired?\n\nEven short replies would be super helpful 🙏. And if anyone’s ever open to chatting 1:1 about how you use automation in Excel, I’d be very grateful.\n\n**Edit:** Wow! Thank you everyone for all the replies, I didn’t expect this much engagement. I’ve already learned a ton from your stories and I’m still reading through them, so feel free to keep ",
    "url": "https://reddit.com/r/excel/comments/1n46tp7/how_do_you_automate_excel_vba_power_query_python/",
    "score": 204,
    "num_comments": 123,
    "date": "2025-08-30",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Historical-Look-4973",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "wordpress",
    "title": "How do you decide which plugins or tools are safe to build your business on?",
    "text": "I’ve been looking into **ETCH** lately. It seems like a really solid, developer-focused builder, but since it’s still a work in progress I’m hesitant to dive in.\n\nI’ve been burned before when tools lost support:\n\n* **Oxygen** → the lead dev shifted focus to a new product, leaving people stuck.\n* **Cwicly** → just straight up discontinued.\n* **Arc browser** → I invested a ton of time into it, only for the team to move on to something else and stop updating Arc.\n\nStuff like this makes me wonder: *how do you actually decide which plugins or tools are safe to build a business on?*\n\nA lot of senior devs I’ve talked to say they usually stick with tools that have a strong reputation and a big user base. Even if something new is faster or more exciting, the stability and long-term support of the popular ones usually win out.",
    "url": "https://reddit.com/r/Wordpress/comments/1n5rdvy/how_do_you_decide_which_plugins_or_tools_are_safe/",
    "score": 11,
    "num_comments": 27,
    "date": "2025-09-01",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Any_Acanthaceae_7337",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "wordpress",
    "title": "Looking for Advice on Theme",
    "text": "**Context:** I'm the CEO of a group of 4 companies (1 parent, 2 professional services subsidiaries, and 1 publishing company with 2 imprints). Between the whole structure there are 9 websites. All are on Wordpress and all are on a custom theme developed for us over time by a web developer. I know how to code and so does one of the company managers. Several of our employees have been taught how to update and maintain and build pages using our theme so they can work on any website. Most are basic brochureware sites with blogs, but the publishing sites have ecomm via Woo. We also have a learning and development site that sells courses.  \nIt sounds complicated, but with our own theme we all know how to use it's been very seamless for a long time.\n\nHowever, our developer has just let us know he's no longer interested in maintenance. I'm sad, but I get it.\n\n**The Advice Needed:**\n\nI need to develop an eight week project plan to begin replacing the custom theme with a commercial theme and I d",
    "url": "https://reddit.com/r/Wordpress/comments/1mnfg3r/looking_for_advice_on_theme/",
    "score": 6,
    "num_comments": 14,
    "date": "2025-08-11",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "metropolitandeluxe",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "wordpress",
    "title": "Plugin that solves the problem of uncontrolled data scraping for AI - looking for feedback",
    "text": "I've been following the discussions about AI crawlers and it seems that currently, we're stuck with an all-or-nothing approach: either allow all scraping and lose money on bandwidth, or block everything and lose potential revenue.\n\nHere's a different approach to consider: what if instead of playing whack-a-mole with blocking plugins, we could make **AI companies pay** creators for the content they want.\n\nThe problem is clear:\n\n* Bots now make up 80% of our traffic (bye-bye, accurate analytics)\n* That WordPress site you're proudly hosting? It's training AI models for free\n* Meanwhile, Reddit's getting $60M/year from Google for the same thing\n\nLooking for content creators who want to \"make money from the machines\" to discuss: what you'd charge AI companies for training access, what concerns you might have, and what these bots are currently costing you in bandwidth, hosting upgrades, and wasted time - would love to chat and maybe have you try it out.\n\nAlso, if this is a terrible idea, ple",
    "url": "https://reddit.com/r/Wordpress/comments/1n2b0fb/plugin_that_solves_the_problem_of_uncontrolled/",
    "score": 5,
    "num_comments": 10,
    "date": "2025-08-28",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "denisperov",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "slack",
    "title": "Drowning in slack notifications. How do you all deal with it?",
    "text": "I moved into a management role recently and the biggest shock so far has been how much time gets eaten up by communication. Slack feels like a never ending treadmill.  \n  \nBy the time i cleared out the morning pings, DMs, team updates, bug reports, requests from other departments. here is already a whole new wave waiting. Half the day is just reacting and when meetings start piling on top of that, it feels impossible to carve out any real focus time.  \n  \nI get now why people say context switching is the silent killer of productivity. Its not just me either. my team is stuck in the same loop, always online, always answering but struggling to find energy for actual deep work.  \n  \nHow do you balance staying responsive with protecting your own bandwidth? Is this just the nature of the job or have you found concrete strategies that help?",
    "url": "https://reddit.com/r/Slack/comments/1mx2g6l/drowning_in_slack_notifications_how_do_you_all/",
    "score": 18,
    "num_comments": 18,
    "date": "2025-08-22",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "capriciousfatesw",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "PowerBI",
    "title": "I need Help building Arguments on why our Project should Use Star Schema instead of Big table with 127 Columns and many-to-many relationships",
    "text": "Hey guys, how are you?\n\nI need a little help here, I am a Analytics Eng and I have developed data produts for the past 3 years, including Data Modeling, Eng, and Data Viz.\n\nI am current doing a Consulting for a company that needs me to help them to Migrate from Tableau to Power BI.\n\nI always have delivered data product which I did all the Data Modeling and also the Data Viz in Power BI.\n\nNow it is a different scenario, they already have a datalake, but it is CHAOS!\n\nIn the current Tableau, they are using tables that have ZERO data modeling, they literally have a table that has 127 columns and I dont know how I will first absord (how business work) and even to reproduce the same Data Viz in Power BI, because I never had a situation that they expect from me to use a One Big Table in Power BI, I don't even know how complex DAX could turn.\n\nSo what I proposed is to take a step back and help them to initiate a Star Schema Data Modeling approach instead of just ''paste and copy'' the Data Vi",
    "url": "https://reddit.com/r/PowerBI/comments/1n1owr3/i_need_help_building_arguments_on_why_our_project/",
    "score": 21,
    "num_comments": 34,
    "date": "2025-08-27",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Dupree360",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "PowerBI",
    "title": "Looking for Advice: Hitting Limits with Gantt Chart Visualization",
    "text": "Hey everyone,  \nHoping to get some input as my team has hit a bit of a wall.\n\n**The Goal:**  \nWe're trying to visualize actual appointment lengths for various resources (people, rooms, etc.). We track multiple types of appointments and want to clearly see *when* in the day these occur. Given the nature of the data, these can happen anytime around the clock - i.e. 24 hrs a day. (Not pictured here - we have multiple resources a day). \n\n**Current Setup:**  \nRight now, each appointment is a row with a start and end time, along with associated metadata. We're using a Gantt Chart (specifically Gantt 3.0.12.0) to visualize this — essentially repurposing it to show appointment blocks across the day. We have also configured tooltips to provide detailed information about the appointment. \n\n**The Problem:**  \nAs our dataset has grown, the Gantt Chart is really starting to struggle. We're hitting performance and rendering limits, and the visual just isn’t holding up under the volume and it has lim",
    "url": "https://reddit.com/r/PowerBI/comments/1momow0/looking_for_advice_hitting_limits_with_gantt/",
    "score": 3,
    "num_comments": 11,
    "date": "2025-08-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "one_cup_of_chocolate",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "PowerBI",
    "title": "Handling 100M+ row database in Power BI – should I filter/aggregate in Power Query or before?",
    "text": "Hi all,\n\nI work for an insurance and investment company, and I’ve been running into some issues around handling a huge database in Power BI.\n\nHere’s the setup:\n- Our database was originally built at the level of daily fund flows per client over the past four years.\n-With nearly 1M clients and ~200 funds, that ended up being ~100 million rows. Way too heavy to load straight into Power BI on our laptops.\n\nTo make it workable, we asked our data guy to:\n- Cut the data to only start from 2024\n- Aggregate by week\n- Group funds by type (real estate, ETF, indexes, etc.)\n\nThat brought it down to ~10 million rows, which worked fine for our report.\n\nFor prior years, we just hardcoded static numbers into the model since those figures won’t change.\n\nThe problem:\n\nDirectors sometimes ask for specific funds over specific periods (e.g. Mar–Jun 2022). Since we no longer have that detail in the aggregated dataset, we end up going back to the original 100M+ row source and manually extracting what’s neede",
    "url": "https://reddit.com/r/PowerBI/comments/1na3qzg/handling_100m_row_database_in_power_bi_should_i/",
    "score": 17,
    "num_comments": 25,
    "date": "2025-09-06",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "CanningTown1",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "startups",
    "title": "Need help finding a technical co-founder , but I have little to no connections (I will not promote)",
    "text": "I have a website/app idea that shows really good promise in the market from research I’ve done (basically no competitors). It’s based on the beauty service industry, which I have friends in and participate in, however, I don’t think I have any connections to someone with the skill set to be a technical cofounder or at least help me develop a functioning app. I’m really against outsourcing it to a random dev because of the amount of articles and videos saying how unproductive it is. I’ve watched many tutorials and I’ve attempted to get into coding, but I truly don’t think it’s a viable option for me to build it myself. I’m worried about approaching someone to help and them not taking me seriously or understanding my vision correctly. I just really need advice on how I should go about finding someone to help bring my idea to life.\n\nP.S. I’ve watched 1 million YouTube videos on this and they all say to go find the best person you know at developing or a person you know with a basic skill ",
    "url": "https://reddit.com/r/startups/comments/1msm05b/need_help_finding_a_technical_cofounder_but_i/",
    "score": 3,
    "num_comments": 21,
    "date": "2025-08-17",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "pinkwashietape",
    "upvote_ratio": 0.71
  },
  {
    "subreddit": "startups",
    "title": "Is Bluehost a good alternative to Shopify? I will not promote",
    "text": "I'm launching a modest start-up and need to provide a \"Shopify experience\" without the Shopify cost.  Bluehost ads pop up on my Reddit feed.  I'd like to hear from any users or former users.  I'm open to good alternatives.  As reference: I'm not savvy with providing online shopping but have built a handful of webpages.   ",
    "url": "https://reddit.com/r/startups/comments/1n1m9ef/is_bluehost_a_good_alternative_to_shopify_i_will/",
    "score": 4,
    "num_comments": 11,
    "date": "2025-08-27",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Infinite_Ticket1112",
    "upvote_ratio": 0.83
  },
  {
    "subreddit": "SaaS",
    "title": "First time posting — I built “Send”, An Alternative to Docsend",
    "text": "Hey everyone — first time posting here. I’m more of a builder than a marketer, so sharing this publicly is a little scary \n\nI’ve been here for a while, seeing amazing projects, and wasn’t sure if I should post mine. I’m worried about feeling judged… but I could really use honest feedback and a few testers.\n\n**What I built:**  \nSend (A Docsend Alternative)— a simple way to share a document *with you in it*. You add a short Loom-style video  to any deck/proposal/contract, and the recipient sees the doc *and* hears your context. There’s real-time tracking so you can tell who viewed, which pages they lingered on, and when to follow up.\n\nThink: **DocSend with Loom inside** — but lightweight and accessible.\n\n**Why I built it:**  \nI kept sending “silent” decks and getting vague replies (or none). I realized the missing piece was **me** — the explanation that turns a document into a conversation.\n\nWhat it does (right now):\n\n* Add a 3m video bubble to any PDF\n* real-time notifications + page-le",
    "url": "https://reddit.com/r/SaaS/comments/1mzmcbc/first_time_posting_i_built_send_an_alternative_to/",
    "score": 1,
    "num_comments": 1,
    "date": "2025-08-25",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Competitive-Neck-536",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "Free and open source all in one platform for musicians and creators alternative to patreon, bandcamp, bandzoogle, convertkit, toneden, eventbrite",
    "text": "TLDR;  \nCreate website, sell memberships, sell music, sell merch, build email lists and send emails, sell event tickets, linktrees, mobile app, all free and open source, no commissions and you own the data.\n\nThree months ago, I started working on a project to help musicians and artists gain full control over their brand without feeling like everyone’s hands are in their pockets.\n\n* If you want to sell membership, you have to go to patreon or others, they get a commission,\n* You want to sell you music on bandcamp? You pay a commission per sale,\n* You need smart-links for marketing? you sign up for linktree or toneden.\n* You want to do email marketing or build an email list, you need another platform.\n* Then your website is somewhere different entirely on wordpress or bandzoogle and others.\n\nWhat if there is a way to unify everything and it's free to use and open source?  \nThat is why I started the TribeNest project.\n\n**This is obviously not a replacement or competition for these platfor",
    "url": "https://reddit.com/r/SaaS/comments/1myycoa/free_and_open_source_all_in_one_platform_for/",
    "score": 1,
    "num_comments": 0,
    "date": "2025-08-24",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Melodic_Key_5940",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "Alternative to Otter",
    "text": "I swear i found someone promoting a great Otter.ai competitor recently but now i can’t find it. I’m annoyed that when i use the iOS app, it has very difficult times with speakers. I’ll see a huge run on transcription and it’s comprised of 2-3 people talking. Very frustrating. Any thoughts?? Need desktop/web application along with iPhone and/or iPad capabilities. Want to use on laptop too. Also bonus for translation capabilities. ",
    "url": "https://reddit.com/r/SaaS/comments/1mkiebq/alternative_to_otter/",
    "score": 1,
    "num_comments": 2,
    "date": "2025-08-08",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "indyarchyguy",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "Stop overthinking. Just launch it.",
    "text": "I keep seeing the same trap when folks try to build the thing that will make them money.\n\nI’m a **solo founder.** I’ve shipped wins and buried duds. The main pattern I see in myself and others: we make it way too hard to start. Here are the three big strikes I see over and over.\n\n**Strike 1:** “Someone already built it.” That usually means demand is real, not that you’re blocked out. One pizza place in town doesn’t mean there’s no room for another. Pick a slice of the market they ignore, serve a tighter niche, use a different channel, or just be faster and kinder. You don’t need to be the only option—just a strong option for a clear group.\n\n**Strike 2:** “I need more features before I can launch.” Most people don’t want more features. They want a result. Ship the smallest thing that delivers one clear outcome. Let real users tell you what the next feature should be. If people won’t join a waitlist or prepay for the core promise, more features won’t fix it.\n\n**Strike 3:** “I need the pe",
    "url": "https://reddit.com/r/SaaS/comments/1nanxri/stop_overthinking_just_launch_it/",
    "score": 14,
    "num_comments": 8,
    "date": "2025-09-07",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "AzizBelAbed",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "smallbusiness",
    "title": "Best alternative to square space? Small business selling 5 products only",
    "text": "Is it worth the £12 a month? ",
    "url": "https://reddit.com/r/smallbusiness/comments/1n84wd0/best_alternative_to_square_space_small_business/",
    "score": 3,
    "num_comments": 8,
    "date": "2025-09-04",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "pass_awsccp",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "PDF Stamping Alternative to SendOwl?",
    "text": "Like many other content sellers, I've become extremely annoyed with SendOwl's pricing increase. They essentially imposed a 30x price increase with no product improvements. I get that they provide value, but the manner in which they have done this makes me not want to reward the company at all.\n\nDoes anyone have a good alternative they like that also does PDF stamping? I'm also wondering if anyone knows of an Excel piracy protection tool.\n\nSome popular options seem like e-junkie and Gumroad.",
    "url": "https://reddit.com/r/ecommerce/comments/1mtvwih/pdf_stamping_alternative_to_sendowl/",
    "score": 5,
    "num_comments": 3,
    "date": "2025-08-18",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "PeakFrameworksCom",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "ecommerce",
    "title": "Would you recommend working with micro influencers to increase sales?",
    "text": "Hi everyone! I recently started running a Shopify shop and have been looking for ways to diversify my marketing strategy. Some people I have talked to recommended to try working with micro influencers. They say they can be cheap, would dedicate time to my brand, and they really connect with their audience. I am looking for more opinions on this. Has anyone tried this strategy? If so, what was your experience? And what platform have you used to connect with micro influencers?\n\nI would really appreciate any advice. Thank you!",
    "url": "https://reddit.com/r/ecommerce/comments/1na5rx6/would_you_recommend_working_with_micro/",
    "score": 11,
    "num_comments": 26,
    "date": "2025-09-06",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "the_thinker_0810",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "shopify",
    "title": "From online shop to supplying big retail… how do you even survive the EDI nightmare?",
    "text": "We sell on Shopify + Amazon. First big retail chain reached out (yay), but they want EDI, GS1 labels, fixed delivery windows… meanwhile I’m still manually printing packing slips half the time. Anyone here pulled this off without losing their mind?",
    "url": "https://reddit.com/r/shopify/comments/1mw2xul/from_online_shop_to_supplying_big_retail_how_do/",
    "score": 13,
    "num_comments": 48,
    "date": "2025-08-21",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Gabriel_3333",
    "upvote_ratio": 0.9
  },
  {
    "subreddit": "shopify",
    "title": "How to make Bundles without apps",
    "text": "Hey,\n\n  \nLooking to make a bundle of items on my site. \n\nBasically, i sell beef jerky in packs of 50g, 200g, and 400g. But if you buy 4x 50g of different flavours i want it to be $1 off so its feels like a discount but not as cheap as buying 200g of one flavour. i have tried to implement a Buy X get Y discount but it doesnt seem like it works. Is there a way to do it without using a bundle app? I had used bundler but im not sure how good it would be.",
    "url": "https://reddit.com/r/shopify/comments/1mlhd02/how_to_make_bundles_without_apps/",
    "score": 4,
    "num_comments": 25,
    "date": "2025-08-09",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "wonderland1995",
    "upvote_ratio": 0.83
  },
  {
    "subreddit": "marketing",
    "title": "For Agencies - how do  you manage various client Social Media login/passwords?",
    "text": "We use Metricool to manage our posts, but when a sign in is required to a client's facebook / instagram account we have to manually sign out and login using the client's credentials.\n\n  \nIs there a tool out there where you can have a separate browser tabs, with each tab signed in to various client's social media accounts without having to log out and log in every time?",
    "url": "https://reddit.com/r/marketing/comments/1n29218/for_agencies_how_do_you_manage_various_client/",
    "score": 4,
    "num_comments": 11,
    "date": "2025-08-28",
    "commercial_score": 5,
    "category": "workflow_problems",
    "author": "Jasoncy",
    "upvote_ratio": 0.83
  },
  {
    "subreddit": "marketing",
    "title": "Looking for Proxy IP tool recommendations",
    "text": "I manage the social media profiles of multiple clients as their social media manager. I believe I need a tool that can help me maintain the IP address consistency for my clients.\n\nMy idea is that when I work for Client A, I would use the same IP address that Client A uses to log into their LinkedIn profile. Similarly, when I work for Client B, I would change the IP address to match the one Client B uses to access their LinkedIn profile.\n\nCan anyone recommend a tool that can help with this?",
    "url": "https://reddit.com/r/marketing/comments/1n5c0l3/looking_for_proxy_ip_tool_recommendations/",
    "score": 1,
    "num_comments": 10,
    "date": "2025-09-01",
    "commercial_score": 5,
    "category": "scaling_issues",
    "author": "Sk_Sabbir_Uddin",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "digital_marketing",
    "title": "Looking for AI tools to track brand presence across different AI models",
    "text": "Our marketing manager wants me to try tracking brand mentions across the big AI chat tools like ChatGPT, Claude, and Perplexity. If anyone here has hands-on experience setting up this kind of tracking or has figured out how to connect it back to conversions or engagement, I’d love to hear about it. \n\nFor context, manager said this LLM SEO strategy is the next big thing in search and that it will give us an edge. We already do basic tracking in Search Console and have social listening dashboards sync’d to APIs. This has been working well for us already, but no matter how much I wrap my mind around them, LLMs just feel a little too unpredictable. \n\nI did my own research of course and I read that some tools like Peec, Athena, or Parse can crawl prompt responses and build share of answer metrics by sampling a set of queries. Others say these prompt tracking apps simply track citations in the retrieval step when the model pulls data from live sources. That is all well and good, but my bigge",
    "url": "https://reddit.com/r/digital_marketing/comments/1n8ah51/looking_for_ai_tools_to_track_brand_presence/",
    "score": 28,
    "num_comments": 23,
    "date": "2025-09-04",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "getgreenforall",
    "upvote_ratio": 0.98
  },
  {
    "subreddit": "freelance",
    "title": "Software for online teacher and student to keep track of lessons owed?",
    "text": "\nI work as an online freelance teacher. In most cases, students buy a package of lessons and then we book the lessons, either at the end of a lesson or using calendly. I currently keep track of the number of lessons I owe them by adding a counter in the events in google calendar. In the cases where they owe me, the counter is negative.\n\nBut the students don't have access to this counter. And sometimes there may be subtle misunderstandings about the counter. For instance, a student cancels in the last moment and they aren't aware that I have a 72h cancelling policy (because they haven't read my terms of service) so they think the lesson isn't spent. Or somtimes it's a parent paying, teenagers forget lessons... I can send emails informing of the state of the counter but would look a bit weird.\n\nI'd like to have some kind of portal where I log this, and students can see their lesson saldo, how it's recharged by certain invoices, how it's spent by certain agreed dates, etc. Is there an eas",
    "url": "https://reddit.com/r/freelance/comments/1lt9fvq/software_for_online_teacher_and_student_to_keep/",
    "score": 24,
    "num_comments": 24,
    "date": "2025-07-06",
    "commercial_score": 5,
    "category": "scaling_issues",
    "author": "flying-benedictus",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Generated Millions. Now at 0.",
    "text": "Hey everyone, just want to preface that I've known about the sub for a long time and occasionally would bump into it here and there, just like today.\n\nI have a question as to what I should do because I truly do not know what to do.\n\nTo make a long story short without going into too much details. I am 23 right now, from age 16-19 I've ran a small \"agency\" but more so a freelance type thing of email & sms marketing for eCommerce brands, generated a lot of money for those brands ( mid to high 7 figures ). And got paid a percentage (performance fee, because my offer was \"I do the job, don't pay anything upfront, but you pay me a % of the revenue I generate \".\n\nWorked perfectly and I had a couple stable clients that I worked troughout the whole time during those 3 years. Well the money I've made at the time (mid six figures for the 3 years), I ended up basically blowing almost all of it on dumb shit (drinks, partying, hookers, a $30k audi TT that I totalled while on my way to register and i",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n9ya63/generated_millions_now_at_0/",
    "score": 12,
    "num_comments": 31,
    "date": "2025-09-06",
    "commercial_score": 5,
    "category": "general_frustration",
    "author": "helenagracee",
    "upvote_ratio": 0.68
  },
  {
    "subreddit": "microsaas",
    "title": "Looking for a solid business idea as a startup .",
    "text": "I'm a full stack developer and want to dive into startup journey . I'm brainstorming and searching for a solid idea that will actually make sense and that'll help me elevate my career . An idea that will try to solve  a target population problem . I'll do whatever it takes to build the solution for the idea . \n\nI'm ready for your engagement of an idea and suggestions too ! ",
    "url": "https://reddit.com/r/microsaas/comments/1mw0zda/looking_for_a_solid_business_idea_as_a_startup/",
    "score": 1,
    "num_comments": 6,
    "date": "2025-08-21",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "AdGlittering1247",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "I made a simpler alternative to Wix/Shopify/Squarespace — would love your thoughts",
    "text": "Hey folks,\n\nI kept seeing people complain about how painful it can be to actually set up a site with Wix, Shopify, or Squarespace. I felt the same way, so I decided to try building something easier — I’m calling it **PixeoCommerce**.\n\nThe idea is super straightforward:\n\n* You just fill out a form with your logo, pages, and the vibe you’re going for\n* We’ve already got 100+ templates ready\n* We handle the setup and send you back a working site\n\nSo instead of dragging boxes around for hours or stressing about settings, you basically hand us your info and get a site that’s ready to roll.\n\nSince this is still new, I’d love to hear what you think.\n\n* What would make this actually useful for you?\n* Is there something that would stop you from using it?\n* If you’ve used Wix/Shopify/Squarespace before, what annoyed you the most?\n\nI really want to shape this around what people actually need, so any feedback (good or bad) would help a ton. Thanks 🙌",
    "url": "https://reddit.com/r/microsaas/comments/1mwg01u/i_made_a_simpler_alternative_to/",
    "score": 1,
    "num_comments": 0,
    "date": "2025-08-21",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "No_Introduction6563",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "buildinpublic",
    "title": "On the left is TimeTracker.Best, a free alternative to Toggl. This is my work setup where I’m using ChatGPT Codex in the terminal and Claude Code MAX. I’m also building Refurbished.Deals — most of this tech was bought there for up to 75% off, like-new on eBay, with a free 2-year warranty.",
    "text": "Been working on a few projects lately and thought I’d share my setup.\n\n* [**TimeTracker.Best**](http://TimeTracker.Best) → a free alternative to Toggl I’m building.\n* **ChatGPT Codex + Claude Code MAX** → running side by side in the terminal to speed up dev work.\n* [**Refurbisthehed.Deals**](http://Refurbisthehed.Deals) → another project where I showcase manufacturer-approved refurbished tech. Most of my gear came from there for up to 75% off, like-new, and with a free All State 2-year warranty.\n\nAlways fun seeing how far you can push AI tools + affordable hardware. Curious to hear what setups others are running.",
    "url": "https://reddit.com/r/buildinpublic/comments/1n620wj/on_the_left_is_timetrackerbest_a_free_alternative/",
    "score": 2,
    "num_comments": 0,
    "date": "2025-09-01",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "24kTHC",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "webdev",
    "title": "Need Help Building My News Website (No Coding Experience)",
    "text": "I want to create a **news website**. I’m willing to pay for the **domain** (and hosting if needed), but I have **no coding experience**.\n\nHere’s what I need:\n\n* **Simple, clean, responsive design** for desktop & mobile.\n* **Custom design integration** (logo, colors, fonts).\n* **User authentication** (sign up, log in, log out).\n* **Integration with APIs** like **Google Gemini, WhatsApp, etc.**\n* Ability to **send users 5–10 min summarized news updates** via WhatsApp.\n* News feed / content updates from multiple categories.\n* **Free or low-cost hosting** preferred (Netlify, Vercel, etc.).\n* Willing to use **Visual Studio Code** for setup if needed.\n* CMS or no-code options are welcome if they meet the above needs.\n\nAny advice on:\n\n1. The easiest **no-code/low-code stack** for this.\n2. How to integrate these APIs without coding experience.\n3. Whether I should start with a CMS like **WordPress/Webflow** or build from scratch.\n\nI tried vibe coding tools like replit, base44 and lovable. I rea",
    "url": "https://reddit.com/r/webdev/comments/1mltrv9/need_help_building_my_news_website_no_coding/",
    "score": 0,
    "num_comments": 29,
    "date": "2025-08-09",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "Lucent_Hyperion_1712",
    "upvote_ratio": 0.17
  },
  {
    "subreddit": "webdev",
    "title": "ColdFusion server down, alternative to ?",
    "text": "Hello,\n\n  \none of my customers get a old windows 2000 with iis and coldfusion app down, i doesn't know this server.\n\nI managed to get back from hard drives the files and access db, but don't know how to rebuild a functionnal virtual server with this. Do you have tips to do the job, may be an alternative ?\n\nAs Railo, BlueDragon or anything ? Or old CF5 setup.exe in your \"dont delete\" folder ? :)\n\nThank you for your help",
    "url": "https://reddit.com/r/webdev/comments/1n30o8b/coldfusion_server_down_alternative_to/",
    "score": 4,
    "num_comments": 9,
    "date": "2025-08-29",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Available_Tour_9313",
    "upvote_ratio": 0.83
  },
  {
    "subreddit": "webdev",
    "title": "Alternative to Neocities",
    "text": "Hello!\n\nSorry if this is the wrong spot, but as I was googling around this subreddit came up a few times. I currently host my site through Neocities, and so far it's been great! However, I just went to upload some larger files and it seems like Neocities has a 100mb per file limit. While what I was trying to do I could just not, it was a bit of a disappointment and so I'm trying to see if there are other options out there. I know Nekoweb exists, but the biggest reason I like Neocities is the large storage size. There's a lot of media (Photos mostly, but also a handful of videos and I was trying to upload some longer audio files). So far on neocities, I've used about 4.5 gb of storage and started using it about a year or two ago. While 50GB is a lot, I get a bit worried about running into nekowebs 10GB limit relatively fast. \n\nSo, I was wondering if maybe anyone had any other suggestions? My entire site is html, css, and some javascript, so I don't think I really need anything super fan",
    "url": "https://reddit.com/r/webdev/comments/1mm76p3/alternative_to_neocities/",
    "score": 0,
    "num_comments": 5,
    "date": "2025-08-10",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "wolfpackalpha",
    "upvote_ratio": 0.5
  },
  {
    "subreddit": "dataengineering",
    "title": "How do you manage web scraping pipelines at scale without constant breakage?",
    "text": "I’ve been tinkering with different scraping setups recently, and while it’s fun for small experiments, scaling it feels like a whole different challenge. Things like rotating proxies, handling CAPTCHAs, and managing schema changes become painful really quickly.\n\nI came across hyperbrowser while looking into different approaches, and it made me wonder if there’s actually a “clean” way to treat scraping like a proper data pipeline, similar to how we handle ETL in more traditional contexts.\n\nDo you usually integrate scraped data directly into your data warehouse or lake, or do you keep it separate first? How do you personally deal with sites that keep changing layouts so you don’t end up rewriting extractors every other week? And at what point do you just say it’s easier to buy the data instead of maintaining the scrapers?\n",
    "url": "https://reddit.com/r/dataengineering/comments/1mtr5d2/how_do_you_manage_web_scraping_pipelines_at_scale/",
    "score": 22,
    "num_comments": 23,
    "date": "2025-08-18",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "rafaelchuck",
    "upvote_ratio": 0.88
  },
  {
    "subreddit": "dataengineering",
    "title": "How did I go from copy pasting CSVs at 2am to building dashboards execs clap for?",
    "text": "I still cant wrap my head around how fast things flipped for me in this field. When I started it was copy paste hell. csvs everywhere. I was up at 2am hoping vlookup wouldnt break. scared someone would ask me what a pipeline even was. most meetings I was secretly googling acronyms so I didnt look like a fraud.\n\nNow a couple years later I am the one building dashboards leadership relies on. this week I demoed a project that pulled data from messy sources and automated a report that used to take weeks. people clapped at the end. my manager said I saved the company hundreds of thousands. But I still feel like the same person duct taping spreadsheets together in the dark.\n\nIs this just imposter syndrome or does everyone in data feel like the ground is always shifting? how do you convince yourself you belong when your head says you dont?",
    "url": "https://reddit.com/r/dataengineering/comments/1n9y3e6/how_did_i_go_from_copy_pasting_csvs_at_2am_to/",
    "score": 287,
    "num_comments": 26,
    "date": "2025-09-06",
    "commercial_score": 5,
    "category": "automation_needs",
    "author": "TheStar1359",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "datascience",
    "title": "Let’s Build Something Together",
    "text": "Hey everyone,\n\nAfter my last post about my struggles in finding a remote job, I was honestly blown away. I got over 50 messages not with job offers, but with stories, frustrations, and suggestions. The common theme? Many of us are stuck. Some are trying to break into the market, others are trying to move within it, and many just want to *make something meaningful*.\n\nThat really got me thinking: since this subreddit is literally about connecting data scientists, engineers, PMs, MLOps folks, researchers, and builders of all kinds why don’t we **actually build something together**?\n\nIt doesn’t have to be one massive project; it could be multiple smaller ones. The goal wouldn’t just be to pad CVs, but to collaborate, learn, and create something that matters. Think hackathon energy, but async and community-driven with no time limits and frustration.\n\nI am personally interested to get involved with things i haven't been yet. Mlops,Deployment,Cloud,Azure,pytorch,Apache for example. Everyone c",
    "url": "https://reddit.com/r/datascience/comments/1n4rufc/lets_build_something_together/",
    "score": 38,
    "num_comments": 48,
    "date": "2025-08-31",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "Fantastic-Trouble295",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "projectmanagement",
    "title": "Keeping Track of Everything",
    "text": "In the process of studying for CAPM and working my way through the material. Current PM's... how do you keep track of all the documentation required for project planning through closing? I'm trying to picture myself as a PM and it seems overwhelming remembering to not only ensure all of the outputs are created, but also remembering to update the necessary plans/registers/etc... \n\nWhat strategies do you use to stay on top of everything?",
    "url": "https://reddit.com/r/projectmanagement/comments/1n91z6t/keeping_track_of_everything/",
    "score": 17,
    "num_comments": 9,
    "date": "2025-09-05",
    "commercial_score": 5,
    "category": "scaling_issues",
    "author": "OkayAlrightYup2724",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "sales",
    "title": "Which data company is best right now? Looking for alternative to the big one that starts with a Z",
    "text": "Can't say their name in this sub apparently but you know the one. How does Apollo or Seamless AI compare? I'm mostly interested in cell numbers. Thanks! ",
    "url": "https://reddit.com/r/sales/comments/1n0klnc/which_data_company_is_best_right_now_looking_for/",
    "score": 9,
    "num_comments": 23,
    "date": "2025-08-26",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "ProfessionalCamp2103",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "sales",
    "title": "Which data company is best right now? Looking for alternative to the big one that starts with a Z",
    "text": "Can't say their name in this sub apparently but you know the one. How does Apollo or Seamless AI compare? I'm mostly interested in cell numbers. Thanks! ",
    "url": "https://reddit.com/r/sales/comments/1n0klnc/which_data_company_is_best_right_now_looking_for/",
    "score": 10,
    "num_comments": 23,
    "date": "2025-08-26",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "ProfessionalCamp2103",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "realestate",
    "title": "How do I / how will my R.E. Agent market/price my home to sell without lowballing?",
    "text": "I don't even know how to word this.  I typed it all out, but it kept turning into a bunch of \"TL;DR\".\n\nThe jist of it is: We have a bunch of equity in the home because I bought it 11 years ago at 2.1%, and also it went up about $100K in value (and that's conservative). Aside from that, it's got really tasteful and unique updates done that avoided the soulless gray trends of the past decade.  We want to price it to sell without any headache, but without low-balling ourselves.\n\nBasically: How does a real estate agent say, \"We COULD sell it for *this* much, but we care about convenience more than maximum profit.\"?  \n\nIf a buyer sees \"appraised for $390K, but it's listed for $370K\" does that look like a \"good deal\" or are they just numbers on a screen?  Does that look like trouble to a buyer?  Does that increase engagement or just make me a chump?  Either way, I come out on top.  \n\n\n",
    "url": "https://reddit.com/r/RealEstate/comments/1mjp85m/how_do_i_how_will_my_re_agent_marketprice_my_home/",
    "score": 0,
    "num_comments": 31,
    "date": "2025-08-07",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Phalus_Falator",
    "upvote_ratio": 0.29
  },
  {
    "subreddit": "realestate",
    "title": "This is exactly why people question the value of realtors",
    "text": "Just saw the below property description. Realtor couldn’t even spare 60 seconds to proofread what they are posting. Quick copy paste from Chat GPT and hoping it sells. I know mistakes happen, but dumb ones like this would be unacceptable if I were paying someone to do the bare minimum already. \n\n“””Certainly! Here's a beautiful, professionally styled description for a **3-bedroom, 2-bathroom, 1,879 sq. ft. brick home**:\r\n\r\n---\r\n\r\n**Charming Brick Beauty with Modern Comforts and Classic Elegance**\r\n\r\nWelcome home to this stunning 3-bedroom, 2-bathroom brick residence, offering 1,879 square feet of thoughtfully designed living space. Nestled in a peaceful neighborhood, this timeless home blends traditional charm with modern touches, creating a warm and inviting atmosphere throughout…………. (I’ll spare you the rest of the description, not really relevant and is just some more bs from chat GPT)\r\r\n---\r\n\r\nWould you like a more casual version, or one tailored for a real estate listing?”””\n\n",
    "url": "https://reddit.com/r/RealEstate/comments/1na3wly/this_is_exactly_why_people_question_the_value_of/",
    "score": 229,
    "num_comments": 134,
    "date": "2025-09-06",
    "commercial_score": 5,
    "category": "automation_needs",
    "author": "hecmtz96",
    "upvote_ratio": 0.88
  },
  {
    "subreddit": "accounting",
    "title": "Passed all 4 CPA exams, finished 150 college credits, while raising a small child after death of his father: Looking for an audit associate position in San Jose, CA ASAP",
    "text": "I’m a single mom who’s partner passed when my child was 9 months old. I managed to finish my bachelors degree, finish my additional college credits needed to sit for the CPA exam, and pass all 4 CPA exams, amidst coordinating  my child’s autism journey(occupational, behavioral, and speech therapy) in the last 6 years since his death, so I am proud of all that. \n\nHowever, due to me raising a small child on the spectrum and balancing my academic pursuits at the same time, my lack of work experience is hindering me from landing an associate position. My last internship was beginning of 2022, so my resume isn’t as intriguing in comparison to fresh young graduates. I know I’m resilient and a hard worker, and am willing to take on any challenge, but I don’t have connections to hiring recruiters or opportunities to attend Meet the Firms anymore. I guess the other rough part about my situation is that I’m trying to maintain living in San Jose, CA so I can be near extended family for my child. ",
    "url": "https://reddit.com/r/Accounting/comments/1n5glnu/passed_all_4_cpa_exams_finished_150_college/",
    "score": 405,
    "num_comments": 72,
    "date": "2025-09-01",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "Embarrassed-Mall2921",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "accounting",
    "title": "Alternative to CPA designation",
    "text": "I recently was deregistered with CPA Ontario. I’m currently employed in the accounting field as an analyst (government job) and my job description indicates that I should be registered and working towards a CPA designation. \n\nMy plan (for now) is to plead my case to be re-admitted to CPA Ontario once the new program roles out in 2027. But in the meantime I need to do something in order to:\n\na) not lose my job (or be demoted)\nb) show I’m serious about improving to CPA Ontario - as was recommended when I searched up what to do in order to have the best chance at getting admitted once again. \n\nI’m looking for any advice/thoughts/experience from anyone in this community as to what I should do? Any courses I should take? \n\nI’ve thought about doing a bookkeeping course to keep me involved in learning in the accounting field. And it could potentially give me a plan B if it gets to that point. Or would working towards my Masters be a better option?   \n\nI’m at a loss here. I feel the weight of ",
    "url": "https://reddit.com/r/Accounting/comments/1mohefb/alternative_to_cpa_designation/",
    "score": 5,
    "num_comments": 11,
    "date": "2025-08-12",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "WanderlustWaffles44",
    "upvote_ratio": 0.79
  },
  {
    "subreddit": "excel",
    "title": "How do i completely remove all columns after Z?",
    "text": "I have a sheet that utilizes all the columns until S, it is currently 2k rows long and each time I copy and paste a row it freezes for a while, i tried removing automatic calculations and value validation it reduced the freezes but not by much. I read the copying an entire row copies all 16k columns of that row even if empty which causes the freezes.\n\nEdit: Turns out one column had many image objects due to staff copying text from softwares which excel for some reason treats as images. ",
    "url": "https://reddit.com/r/excel/comments/1n69917/how_do_i_completely_remove_all_columns_after_z/",
    "score": 10,
    "num_comments": 27,
    "date": "2025-09-02",
    "commercial_score": 5,
    "category": "automation_needs",
    "author": "skychi_",
    "upvote_ratio": 0.82
  },
  {
    "subreddit": "excel",
    "title": "How do I run 'if' statement on imported csv?",
    "text": "\\[I'm sure one of the methods posted will work-- I'll be trying them out on the new version of Excel- no time like the present -- Thanks to all if I miss anyone\\]\n\nMy doc wants me to give  him morning and evening bloodpressure readings.   My bluetooth cuff won't display them that way, but I can export to Excel.  \\[my current Excel is 2010- though I have a new version handy if I need it\\].      What I'd like to do is run something along the lines of \"if b=>12, move c,d,e,f to g,h,i,j \" .  That would give the Doc 2 nice columns to compare.\n\nA part of me 'knows' that this is easy, but the words to search for are escaping me.\n\nThanks\n\n",
    "url": "https://reddit.com/r/excel/comments/1n4s2kf/how_do_i_run_if_statement_on_imported_csv/",
    "score": 10,
    "num_comments": 26,
    "date": "2025-08-31",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "elbrecht",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "excel",
    "title": "Long time Excel for Windows user recently moved to Mac and looking for tips on Alt shortcuts",
    "text": "Hey everyone,\n\nI've been using Excel for years on Windows and recently moved to Mac for work reasons. Most everything is very similar these days, but I am really missing my alt shortcuts. As an example, on Excel for Windows Alt + H + F + P opens the format painter. I hadn't realized how much I had come to rely on that simple shortcut (and others like it) until I moved to Mac. Can anyone help me with similar alternatives for Mac? Is there an analogous shortcut to the alt + shortcuts on Windows?\n\nThanks in advance",
    "url": "https://reddit.com/r/excel/comments/1n80zzp/long_time_excel_for_windows_user_recently_moved/",
    "score": 1,
    "num_comments": 9,
    "date": "2025-09-04",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "ExcelMac",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "wordpress",
    "title": "Looking for a super plugin for forms",
    "text": "Hello everyone.\n\nI am looking for a form plugin that allows me to create mathematical operations, calculate costs (addition, subtraction, multiplication) between fields, etc. It should also allow me to print this as a PDF and, in turn, customize the PDF document using HTML and add more things to it. And if it's not too much to ask, it would be great if the plugin could be integrated with a payment gateway.\n\n\n\nWhich plugin would allow me to do all this?",
    "url": "https://reddit.com/r/Wordpress/comments/1mqf4yo/looking_for_a_super_plugin_for_forms/",
    "score": 4,
    "num_comments": 34,
    "date": "2025-08-14",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "jhoedram",
    "upvote_ratio": 0.84
  },
  {
    "subreddit": "shopify",
    "title": "From online shop to supplying big retail… how do you even survive the EDI nightmare?",
    "text": "We sell on Shopify + Amazon. First big retail chain reached out (yay), but they want EDI, GS1 labels, fixed delivery windows… meanwhile I’m still manually printing packing slips half the time. Anyone here pulled this off without losing their mind?",
    "url": "https://reddit.com/r/shopify/comments/1mw2xul/from_online_shop_to_supplying_big_retail_how_do/",
    "score": 14,
    "num_comments": 48,
    "date": "2025-08-21",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Gabriel_3333",
    "upvote_ratio": 0.9
  },
  {
    "subreddit": "shopify",
    "title": "How to make Bundles without apps",
    "text": "Hey,\n\n  \nLooking to make a bundle of items on my site. \n\nBasically, i sell beef jerky in packs of 50g, 200g, and 400g. But if you buy 4x 50g of different flavours i want it to be $1 off so its feels like a discount but not as cheap as buying 200g of one flavour. i have tried to implement a Buy X get Y discount but it doesnt seem like it works. Is there a way to do it without using a bundle app? I had used bundler but im not sure how good it would be.",
    "url": "https://reddit.com/r/shopify/comments/1mlhd02/how_to_make_bundles_without_apps/",
    "score": 4,
    "num_comments": 25,
    "date": "2025-08-09",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "wonderland1995",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "notion",
    "title": "Looking for a Notion alternative on Mac that comes with a built-in system",
    "text": "I tried using Notion on my MacBook, but I find it too complicated. I don’t like setting up pages and templates from scratch.\n\nI’m looking for an app that’s ready to use right away with a clear system already built in. I just want to open it and start organizing my notes, tasks, or projects without spending a lot of time setting it up.\n\nAny suggestions for simple, Mac-friendly apps that work out of the box?\n\nThank you 🥰\n",
    "url": "https://reddit.com/r/Notion/comments/1n6f24n/looking_for_a_notion_alternative_on_mac_that/",
    "score": 33,
    "num_comments": 56,
    "date": "2025-09-02",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Charming-Impact-7981",
    "upvote_ratio": 0.81
  },
  {
    "subreddit": "googlesheets",
    "title": "How to calculate mileage with Google Maps Formulas script?",
    "text": "I'm using [GMaps Formulas](https://www.labnol.org/google-maps-sheets-200817) to calculate the cost from point A to point B but with various starting points. I'll use \"=MULTIPLY(Q3,G3)\" but end up with the result as pictured above. I've tried various other formulas to get the number only without \"mi\" but have had no luck. Anyone else had any luck using this system to calculate prices based off distance?",
    "url": "https://reddit.com/r/googlesheets/comments/1muz7e9/how_to_calculate_mileage_with_google_maps/",
    "score": 5,
    "num_comments": 18,
    "date": "2025-08-19",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "TheZeddieLittle",
    "upvote_ratio": 0.78
  },
  {
    "subreddit": "googlesheets",
    "title": "Looking for performant way to sanitize TOCOL inputs, drop empty cells, or otherwise replace TOCOL in custom function",
    "text": "I have a custom function `FORCELOOKUP` as follows:\n\n`=TOCOL(BYROW(HSTACK(search_range,result_range),LAMBDA(row,IF(CHOOSECOLS(row,1)=search_key,CHOOSECOLS(row,2),))),1)`\n\nWhich sometimes returns only empty rows with 0 real datasets. In this case, `FORCELOOKUP` should also simply return an empty cell.  \nBut `TOCOL(...,1)`, if given a range without data, returns `#REF!`, and reference errors can't be removed with `IFERROR(...,)` like normal errors can.\n\nWhat do I do? I *really can't* check all cells if they're empty and populate them with a special, unused character because this function runs over large amounts of data (order of high 1000s, low 10000s of cells) where every database engineer would laugh at me for using gsheet.\n\n**Is there another, easier way to reduce an output that could be thousands of empty cells, could be hundreds of full cells, into only full cells of all lookup hits? Something that drops empty cells? Something that puts all empty cells at the end and cuts them off in",
    "url": "https://reddit.com/r/googlesheets/comments/1mlvyop/looking_for_performant_way_to_sanitize_tocol/",
    "score": 0,
    "num_comments": 20,
    "date": "2025-08-09",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "mlemminglemming",
    "upvote_ratio": 0.5
  },
  {
    "subreddit": "googlesheets",
    "title": "Looking for a Function for counting Conditioned cells with particular data.",
    "text": "https://preview.redd.it/zwqzzgzaqtif1.png?width=731&format=png&auto=webp&s=f3ae07dd61fe2e1c981a9c4b56fd7a3c0828b1ab\n\nI am trying to keep track of my matches in a card game I play.  I currently have a conditional formatting to turn the winning player green.  I am looking for a function to count the number of times \"\\*The Gitrog Monster\" gets formatted green and a function for counting the number of times it turned green in a given column.  Any help would be greatly appreciated!\n\n  \nEdit: This is the Conditional Formatting =NOT(ISBLANK(B4:B)) Didn't realize that would matter here.  My apologize.",
    "url": "https://reddit.com/r/googlesheets/comments/1mpb9xu/looking_for_a_function_for_counting_conditioned/",
    "score": 1,
    "num_comments": 10,
    "date": "2025-08-13",
    "commercial_score": 5,
    "category": "scaling_issues",
    "author": "Oldysian",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "PowerBI",
    "title": "Boss asked how we should do dashboard branching… How do you guys do it?",
    "text": "Preface: we have a branched/staged lakehouse that Power BI connects to. Everything comes in either dev/staging/prod versions (all warehouses, databases, tables, …). It’s all developed locally, pushed to GitHub, and deployed via ci/cd.\n\nBoss sees this and wants the same benefits for Power BI. For example, he wants to branch dashboards and work on each branch independently. Then he wants to merge them into a staging ground, and have a dev resolve conflicts. Finally, he wants a prod copy that stakeholders can access.\n\nI was thinking we could try setting up a PBIR file merging process in GitHub Actions. I would need to format the file so that merges can happen effectively, assuming that’s possible. Then API calls can deploy the dashboard into a Power BI Service workspace?\n\nAnother thing though, is that my boss wants to be able to engage in this dev process using the Power BI Service’s basic editor (in web). That rules out the PBIR approach, unless I do something in GitHub Actions to fetch ",
    "url": "https://reddit.com/r/PowerBI/comments/1mxean8/boss_asked_how_we_should_do_dashboard_branching/",
    "score": 16,
    "num_comments": 14,
    "date": "2025-08-22",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "DuckDatum",
    "upvote_ratio": 0.9
  }
]