[
  {
    "subreddit": "datascience",
    "title": "How do I make the most of this opportunity",
    "text": "Hello everyone, I’m a senior studying data science at a large state school. Recently, through some networking, I got to interview with a small real estate and financial data aggregator company with around \\~100 employees.\n\nI met with the CEO for my interview. As far as I know, they haven’t had an engineering or science intern before, mainly marketing and business interns. The firm has been primarily a more traditional real estate company for the last 150 years. Many tasks are done through SQL queries and Excel. Much of the product team at the company has been there for over 20 years and is resistant to change.\n\nThe ceo wants to make the company more efficient and modern, and implement some statistical and ML models and automated workflows with their large amounts of data. He has given me some of the ideas that he and others at the company have considered. I will list those at the end. But I am starting to feel that I’m a bit in over my head here as he hinted towards using my work as a ",
    "url": "https://reddit.com/r/datascience/comments/1n0ep0g/how_do_i_make_the_most_of_this_opportunity/",
    "score": 6,
    "num_comments": 17,
    "date": "2025-08-26",
    "commercial_score": 22,
    "category": "general_frustration",
    "author": "ChubbyFruit",
    "upvote_ratio": 0.64
  },
  {
    "subreddit": "juststart",
    "title": "[AMA] Case Studies: 5, 6, 7-figure Affiliate Content Sites - AI came, destroyed - what works now? (tested and proven model to start new or revive older projects)",
    "text": "Hello Everyone,\n\nOld member here and I published 5, 6, 7-figures affiliate website (and display ads) case studies here. I shared the complete process including niche selection, KW research, content plan, production, backlinks and optimisation.\n\n**However with AI and how search is done now, nothing seems to work now:** affiliate sites, content brands, SEO, content marketing etc. all seems to be dead.\n\n*However, based on 1-2y of recent testing - a different approach to the same model works.* \n\nBy changing your approach, strategy and right infrastructure, you can actually get the same results (if not better) with lesser effort (due to AI).\n\n**The purpose of this post is to share my findings (and hard data) from the past 1-2 years so you can potentially start new projects, revive older ones, grow traffic, have successful exits, passive income, generate leads for local business or even sell digital or physical products/services through organic traffic.**\n\nWhile it doesn't apply to all cases",
    "url": "https://reddit.com/r/juststart/comments/1l2gv1x/ama_case_studies_5_6_7figure_affiliate_content/",
    "score": 44,
    "num_comments": 46,
    "date": "2025-06-03",
    "commercial_score": 19,
    "category": "integration_problems",
    "author": "jamesackerman1234",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Product-market fit feels like a myth until it hits you like a truck: How to recognize it, measure it, and not fool yourself into thinking you have it (framework with brutal self-assessment)",
    "text": "Product-market fit is the most talked about and least understood concept in startups... I thought I had it 3 different times with TuBoost before I actually did, and the difference is night and day\n\nEveryone talks about PMF like it's this mystical moment of enlightenment, but really it's more like \"holy shit, I can't keep up with demand and my biggest problem is scaling, not convincing people to want this thing.\"\n\n**The brutal truth about product-market fit:** Most founders mistake early traction for PMF and then wonder why growth stalls. Real PMF isn't about getting some customers - it's about customers pulling your product out of your hands faster than you can build it.\n\n**My PMF false alarms (learn from my delusions):**\n\n**False Alarm #1: The \"early adopter\" mistake**\n\n* Metrics: 20 signups, $200 revenue, 5-star reviews\n* My delusion: \"People love this! We have PMF!\"\n* Reality check: Early adopters will try anything. They're not your market.\n* Red flag: Growth required constant hustl",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n458pe/productmarket_fit_feels_like_a_myth_until_it_hits/",
    "score": 6,
    "num_comments": 5,
    "date": "2025-08-30",
    "commercial_score": 19,
    "category": "integration_problems",
    "author": "CremeEasy6720",
    "upvote_ratio": 0.8
  },
  {
    "subreddit": "ecommerce",
    "title": "At my wits end with diy bots: looking for an ai tool that won’t waste my time",
    "text": "Am so frustrated with chatbots! specifically diy bots. I run a small service-based business with about 7 employees, mostly client-facing. Over the past year I’ve been experimenting with a couple of diy chatbot builders to handle incoming inquiries, basic scheduling etc. I thought this would save time and take pressure off my small team. \n\nIT DID THE OPPOSITE!!!!\n\nI ahve wasted precious time tweaking flows and fixing broken logic. If I don’t, customers get stuck in loops or drop off entirely.\n\nThe bots only handle rigid scripts. If a customer phrases something slightly differently, it either freezes or gives that generic I don’t understand response.\n\nI’ve had multiple instances where potential customers got frustrated with the bot and just abandoned the chat. A few even emailed me later saying they couldn’t get through to a real person. That’s painful to hear when you’re a small business trying to build trust.\n\nI’ve tried connecting these bots with my calender system and email workflows",
    "url": "https://reddit.com/r/ecommerce/comments/1ncj9fk/at_my_wits_end_with_diy_bots_looking_for_an_ai/",
    "score": 2,
    "num_comments": 30,
    "date": "2025-09-09",
    "commercial_score": 18,
    "category": "integration_problems",
    "author": "llggll",
    "upvote_ratio": 0.56
  },
  {
    "subreddit": "startups",
    "title": "Share your startup - quarterly post",
    "text": "Share Your Startup - Q4 2023\n\n[**r/startups**](https://www.reddit.com/r/startups/) **wants to hear what you're working on!**\n\nTell us about your startup in a comment within this submission. Follow this template:\n=====================================================================================\n\n​\n\n*   **Startup Name / URL**\n*   **Location of Your Headquarters**\n    *   Let people know where you are based for possible local networking with you and to share local resources with you\n*   **Elevator Pitch/Explainer Video**\n*   **More details:**\n    *   What life cycle stage is your startup at? (reference the stages below)\n    *   Your role?\n*   **What goals are you trying to reach this month?**\n    *   How could [r/startups](https://www.reddit.com/r/startups/) help?\n    *   Do **NOT** solicit funds publicly--this may be illegal for you to do so\n*   **Discount for** [r/startups](/r/startups) **subscribers?**\n    *   Share how our community can get a discount\n\n​\n\n\n\\------------------------",
    "url": "https://reddit.com/r/startups/comments/1lxc97s/share_your_startup_quarterly_post/",
    "score": 64,
    "num_comments": 526,
    "date": "2025-07-11",
    "commercial_score": 16,
    "category": "general_frustration",
    "author": "julian88888888",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Small business owners - how do you keep track of all your contacts and follow-ups?",
    "text": "This might be a basic question but I'm struggling with contact management as my business grows.\n\nI started with just keeping notes in my phone and Gmail, but now I have potential clients, current customers, vendors, partners, etc. and I'm losing track of where conversations stand and when to follow up.\n\nI've been looking into CRM solutions but most seem either too complex or too expensive for where I'm at. My co-founder suggested using Micro.so which integrates with Gmail which is interesting since that's where all my conversations happen anyway, but I'm still researching.\n\nHow did you handle this transition? Did you go straight to a full CRM or find simpler solutions that worked? Would love to hear what worked (or didn't work) for your business size.",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n3ernt/small_business_owners_how_do_you_keep_track_of/",
    "score": 46,
    "num_comments": 40,
    "date": "2025-08-29",
    "commercial_score": 15,
    "category": "integration_problems",
    "author": "Ok-Doubt8429",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "ProductManagement",
    "title": "How do you automate your PM work when you constantly forget things and go blank in meetings?",
    "text": "I need to fix my two biggest weaknesses before they become career killers.\n\n**My actual problems:**\n\n1. I forget everything. Previous manager called me out multiple times for dropping balls. I’ll commit to something in a meeting and completely forget by afternoon. No amount of “I’ll do better” has fixed this. 2. I go blank when asked unexpected questions. Someone asks “what’s the status of X?” and even if I know it, my mind freezes. I just sit there silent. It’s brutal. \n\n**My setup:** \n\n• Company gives us ChatGPT Team subscription with plugins \n\n• Microsoft everything (Teams, Outlook, SharePoint) \n\n• Can use Notion for personal organization \n\n• Can’t use external tools like Fireflies (security policy) \n\n**What I’m trying to automate:** \n\n•Meeting prep so I never walk in cold \n\n• Transcript processing so nothing gets lost \n\n• Action item tracking so I stop dropping balls \n\n• Some system that tells me what I should be doing RIGHT NOW \n\n• Quick answers when my brain freezes in meetings I",
    "url": "https://reddit.com/r/ProductManagement/comments/1n36z4s/how_do_you_automate_your_pm_work_when_you/",
    "score": 98,
    "num_comments": 115,
    "date": "2025-08-29",
    "commercial_score": 15,
    "category": "scaling_issues",
    "author": "Economy_Television81",
    "upvote_ratio": 0.85
  },
  {
    "subreddit": "wordpress",
    "title": "Start Here: Essential Resources & FAQs",
    "text": "The idea for this post came up in [this thread](https://www.reddit.com/r/Wordpress/comments/1cpme25/mods_can_this_subreddit_implement_a_minimum_karma/) by wiz to avoid the number of similar questions we get around here and to serve as a megathread for any/all questions of a similar nature. I will collate any and all valuable information by other users and update this thread as we go. Seasoned users please pitch in with anything that should be included.\n\nMany thanks to u/BlueSix for assisting in putting this together.\n\nWhat's covered:\n\n* The .COM vs .ORG Issue\n* Hosting - Where should I host?\n* Performance - Why is my site slow / Pagespeed score appalling?\n* Building Your WordPress Site: Is X builder better than Y? What is the best theme? Etc.\n* Updates\n* Backups\n* Security\n* Combating spam comments, contact form submissions & bot registrations\n* Hacks/Malware: Err guys help, there’s some weird stuff on my front end\n* Resources to learn WordPress\n* Where to find plugins/add feature X?\n*",
    "url": "https://reddit.com/r/Wordpress/comments/1cqlvod/start_here_essential_resources_faqs/",
    "score": 145,
    "num_comments": 63,
    "date": "2024-05-13",
    "commercial_score": 15,
    "category": "missing_features",
    "author": "Acephaliax",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "Entrepreneur",
    "title": "How do I sell my custom home building business?",
    "text": "I’m a 35M and have built a custom home building business that does ~$10M revenue annually with a team of 5 including myself. I have been thinking a lot this year about how to scale the business in a direction where I can eventually sell it to someone. \n\nDo private equity firms or investors buy smaller home building businesses? Is there a direction I should grow the business to make it appealing to a buyer? \n\nRight now, one of my employees runs all the operations but I’m heavily involved in the sales side and tied to the brand of the business locally. And our customer base is usually 5-10 clients per year due to the custom aspect of the business. ",
    "url": "https://reddit.com/r/Entrepreneur/comments/1mz6gx6/how_do_i_sell_my_custom_home_building_business/",
    "score": 16,
    "num_comments": 53,
    "date": "2025-08-24",
    "commercial_score": 14,
    "category": "general_frustration",
    "author": "babingababy",
    "upvote_ratio": 0.84
  },
  {
    "subreddit": "Entrepreneur",
    "title": "the company that made \"no sales team\" sound brilliant just hired... a sales team.",
    "text": "atlassian used to wear their lack of salespeople like a badge of honor. no quotas, no cold calls, no linkedin spam, just pure product love driving $100M in revenue.\n\nthey were the platonic ideal of product-led growth, the company every SaaS founder pointed to when justifying their own anti-sales stance.\n\nthen they hired brian duffy and built an enterprise sales team. oops.\n\nturns out even the most celebrated PLG darling eventually needs humans to close seven-figure deals. shocking development, truly. i'm sure no one saw this coming except, well, literally everyone who's ever tried to sell enterprise software.\n\ni spent the last month picking apart their entire go-to-market engine, and what i found was actually pretty interesting.\n\n**the engine that worked (and still does, mostly)**\n\natlassian built something genuinely clever. jira doesn't just manage projects, it emotionally manipulates you into collaboration. start a project solo and suddenly your PM is standing behind your desk asking",
    "url": "https://reddit.com/r/Entrepreneur/comments/1nf90wv/the_company_that_made_no_sales_team_sound/",
    "score": 50,
    "num_comments": 20,
    "date": "2025-09-12",
    "commercial_score": 14,
    "category": "general_frustration",
    "author": "muizthomas",
    "upvote_ratio": 0.9
  },
  {
    "subreddit": "notion",
    "title": "What's the point of Notion Mail???",
    "text": "I literally cannot even link more than one account because it only lets you use a Google account. I wish we had the option to merge Outlook and Gmail into one so we could manage emails with different tags, but nope, that doesn’t exist. Sure, it has AI that organizes emails into categories, but it’s far from perfect—it misses stuff all the time. And the lack of integration with Notion databases makes it feel like a half-baked Gmail front-end rather than a proper productivity tool. No custom signatures, no real-time updates, no multiple inboxes, no custom domains, threads are messy, and honestly the performance is unreliable. Some people even say it’s only good for solo users or freelancers, definitely not teams or businesses. I keep seeing people on Reddit ranting about it too, like how it doesn’t open properly, doesn’t update emails in real-time, and generally underwhelms after months of waiting. At this point, it feels more like a style-over-substance experiment than a real email solu",
    "url": "https://reddit.com/r/Notion/comments/1nf9jbs/whats_the_point_of_notion_mail/",
    "score": 150,
    "num_comments": 30,
    "date": "2025-09-12",
    "commercial_score": 14,
    "category": "scaling_issues",
    "author": "CesarDMTXD",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "startups",
    "title": "How to split equity between 3 founder? I will not promote",
    "text": "Hi guys, this is more of a general question but me and my friends are all new to this and I'd like to hear from people who went thru similar situation.\n\n3 of us started a company together, we're friends. CEO had the idea, who then approached the friend who was appointed as COO and they approached me to be the CTO and build up the app. I did build the app, and we decided to discuss the equity distribution once we've worked a bit and seen how much we contribute.\n\nNow, we had the discussion last night. The results were: CEO 40%, CTO 30% and COO 30%. We're starting with $5000 initial investment where I don't pay anything, CEO pays $2750 and COO pays $2250. I was happy with the distribution, somewhat, but then again,\n\n1. I built the entire app. It'd probably cost them more than $5000 to make the MVP of an food tech app similar to (for the argument's sake, uber eats)\n2. The CEO did have the idea, so I don't mind the CEO getting bigger share of the pie.. but the COO isn't contributing much ye",
    "url": "https://reddit.com/r/startups/comments/1mzg3et/how_to_split_equity_between_3_founder_i_will_not/",
    "score": 15,
    "num_comments": 70,
    "date": "2025-08-25",
    "commercial_score": 13,
    "category": "integration_problems",
    "author": "cryptooastronaut",
    "upvote_ratio": 0.81
  },
  {
    "subreddit": "SaaS",
    "title": "How to get sales when trying startup for the first time",
    "text": "Disclaimer - Post only for those with 0 MRR, No startup, wanna be founder/solopreneur/Indie hacker etc \n\nDisclaimer continued - \n\nBefore coming to main thing, why you should trust me?\n\nI am not going to share any links, screenshots, stripe dashboards but I will say you must have did 100 things till today, why not trust me for few seconds and try 101th too. \n\nIf this doesnt makes sense or don't work out, come after trying abuse me. I will accept that gracefully.   \n  \n**How to get sales when trying startup for the first time ?**\n\n**Step 1.** Define who you are, your strengths, your network, like write down everything about you. \n\nConfused? I will go with example - \n\nYesterday I launched my playbook for wanna be founders, but why? I got this idea because - \n\n\\- I myself founded startup and made it good recurring income  \n\\- I got 5K followers on Linkedin - students of my college, my ex team mates, people in indie hacking etc  \n\\- I got 600+ followers on X - same ICP  \n\\- I spend my time ",
    "url": "https://reddit.com/r/SaaS/comments/1nfdj77/how_to_get_sales_when_trying_startup_for_the/",
    "score": 71,
    "num_comments": 11,
    "date": "2025-09-12",
    "commercial_score": 13,
    "category": "integration_problems",
    "author": "Getmorebacklinks",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "smallbusiness",
    "title": "Best alternative to DocuSign for unlimited envelopes + team use?",
    "text": "We are a small team of about 5 people and currently send out around 4 to 6 envelopes a day. We expect that number to grow to 10 to 25 a day in the near future.\n\nDocuSign’s pricing structure is just too expensive for what we need and does not make sense for our volume. We are looking for an e-signature solution that offers unlimited envelopes and works well for multiple team members.\n\nI have been looking at BoldSign and it looks promising, but I would like to hear what others are using. What are the best affordable and reliable DocuSign alternatives that can scale with this kind of usage?\n\nThanks in advance.",
    "url": "https://reddit.com/r/smallbusiness/comments/1n1npuf/best_alternative_to_docusign_for_unlimited/",
    "score": 1,
    "num_comments": 6,
    "date": "2025-08-27",
    "commercial_score": 13,
    "category": "cost_problems",
    "author": "NewCryptographer8977",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "Alternative to SpiritSale by Stahls?",
    "text": "I currently run the apparel side of a brick and mortar business and we use Spirit Sale to host web stores for our various customers. These range from corporate apparel to booster clubs and ports teams. \n\nI am increasingly frustrated with Spirit Sale and their lack of functionality and support, so I am researching other platforms that are functional and easy to use on the back end. \n\n  \nIdeally, I'd love something where:  \n\\- I can see all orders across stores on one screen  \n\\- have the ability to create promo codes  \n\\- figure real-time shipping costs  \n\\- can pull various reports  \n\\- allow users to \"design\" their own merch by selecting the color apparel they would like along with selecting a logo from a list. \n\n  \nI have looked into WebStoreSimple and while it seemed like it had everything we wanted, their back end was extremely complicated to use. I am also looking at BigCommerce, but it seems like they are missing some functions that I'd like to see or they want to charge for inst",
    "url": "https://reddit.com/r/ecommerce/comments/1ncom4d/alternative_to_spiritsale_by_stahls/",
    "score": 3,
    "num_comments": 0,
    "date": "2025-09-09",
    "commercial_score": 13,
    "category": "missing_features",
    "author": "skeedy_ia",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "juststart",
    "title": "2,300% Traffic Increase with AI in Just a Few Months. How to Win in the AI ​​Era.",
    "text": "I recently came across a fascinating case study from the agency **The Search Initiative**. Their client, a manufacturer in the industrial sector, had solid rankings in traditional Google results but was completely invisible in AI Overviews, letting their competition capture all the new traffic.\n\nAfter implementing a new strategy focused on AI visibility, they achieved an incredible result: a **2,300% increase in monthly traffic from AI platforms like ChatGPT and Gemini**. What's more, the company started appearing in AI-generated answers for 90 key phrases, up from an absolute zero.\n\nTheir strategy involved:\n\n* adapting their content structure for AI readability by using clear, concise language and logical headings.\n* optimizing for conversational queries by answering the full, natural questions that users ask.\n* strengthening content credibility (E-E-A-T) by publishing expert-driven materials and acquiring authoritative backlinks.\n* actively managing their brand reputation in AI by mo",
    "url": "https://reddit.com/r/juststart/comments/1mx885a/2300_traffic_increase_with_ai_in_just_a_few/",
    "score": 8,
    "num_comments": 9,
    "date": "2025-08-22",
    "commercial_score": 13,
    "category": "automation_needs",
    "author": "Odd-Raspberry1063",
    "upvote_ratio": 0.64
  },
  {
    "subreddit": "juststart",
    "title": "My current GEO playbook (used by 10M+ clients)",
    "text": "**1. Identify prompts**\n\nBuild a list of 20–50 prompts your target customers might ask. You can do this by:\n\nA. Asking ChatGPT to generate suggestions.\n\nFor example, ask AI to give you some considerations before recommending your service or product. E.g.: \"What considerations are you taking into account when recommending the best dog food brand?\"\n\nIt will say something like quality, price, sustainability, shipment speed, etc.\n\nTurn these considerations into prompts: \"Which dog food brand makes the most quality food?\" \"Which dog food brand has the fastest shipping time?\" etc.\n\nB. Use a reasoning model.\n\nAsk multiple AI tools what they know about your brand. Look at the things AI checks (or what keywords they add) when “thinking.” For example, you will see what AI is looking at when answering a question about your brand, inserting keywords into a search. Because when thinking, ChatGPT looks for answers on the web and it inserts keywords. Optimize for these keywords and turn them into que",
    "url": "https://reddit.com/r/juststart/comments/1mew4i0/my_current_geo_playbook_used_by_10m_clients/",
    "score": 17,
    "num_comments": 9,
    "date": "2025-08-01",
    "commercial_score": 13,
    "category": "workflow_problems",
    "author": "Purple-Asparagus-887",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "indiehackers",
    "title": "Building a simple alternative to Dub.co / Bitly — would love your feedback",
    "text": "Hey everyone,\n\nI’m building a new tool called **Switchly** — a simpler alternative to link management platforms like [Dub.co](http://Dub.co), Bitly, and Rebrandly.\n\nThe problem I see with most of these tools is that they feel **cluttered, complex, and too expensive for solo creators or small sellers**. They’re great for big teams, but not so much if you just want something clean, fast, and affordable.\n\nHere’s what Switchly currently offers:\n\n* **Smart link redirects** → set expiration times, fallback URLs. (device/geo targeting will be coming later.)\n* **Analytics dashboard** → 30 days of click data for free users (device, location, UTM etc).\n* **Free plan** → 10 active links, forever.\n* **QR code generation** → automatically create QR codes for any link.\n* **Simple UI** → no clutter, just links + analytics.\n\nFuture plans:\n\n* **Geo/device targeting** → send iOS users to App Store, Android to Play Store, etc.\n* **A/B testing** → split traffic (e.g. 70% to Page A, 30% to Page B).\n* **Lig",
    "url": "https://reddit.com/r/indiehackers/comments/1nbf5ft/building_a_simple_alternative_to_dubco_bitly/",
    "score": 4,
    "num_comments": 13,
    "date": "2025-09-08",
    "commercial_score": 13,
    "category": "cost_problems",
    "author": "yashvant_0007",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "slack",
    "title": "Looking for an Internal Slack Analytics/Summary Solution (HealthTech, No Third-Party Apps, Gemini AI Available)",
    "text": ":\nI work in a HealthTech company where our Slack channels have a lot of people and constant activity — multiple discussions, issue reports, and general chatter happening at the same time.\n\nThe challenge I’m facing is that it’s hard to track:\n\t•\tWhat issues have occurred in the past\n\t•\tWhat kinds of discussions took place\n\t•\tAny recurring themes or patterns\n\nI’d like to have some sort of analytics or insight tool that can:\n\t•\tAutomatically summarize or analyze channel activity every 7 days\n\t•\tOr provide an on-demand summary whenever I need it\n\nConstraints:\n\t•\tThis is a HealthTech environment, so our IT/security teams usually do not allow third-party apps or SaaS integrations.\n\t•\tWe do have access to Google’s Gemini AI (but not ChatGPT).\n\t•\tIdeally, the solution should run internally, without sending sensitive data to unapproved external services.\n\nWhat I’m looking for:\n\t•\tIdeas for how to set up a secure, in-house bot or workflow to collect messages, process them with Gemini, and post s",
    "url": "https://reddit.com/r/Slack/comments/1mpwuuu/looking_for_an_internal_slack_analyticssummary/",
    "score": 2,
    "num_comments": 4,
    "date": "2025-08-14",
    "commercial_score": 13,
    "category": "missing_features",
    "author": "PossibilityOwn2716",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "Entrepreneur",
    "title": "How do you fire loyal employees because you are downsizing due to low revenue?",
    "text": "I have 3-4 very loyal team members who have been with me for 8 years. I absolutely respect them so this breaks my heart. Our in-house brand that they were working on with me is not doing well for the last 2 years. I’ve tried and invested my own money and have lost a lot of it. I can’t afford to keep that team anymore, even though it’s not their fault. We have hit a saturation and honestly I’ve been holding on to the little under average ROI only to maintain this team. My other team who is in the servicing side for my design firm is doing well. \n\nMy mentor and business partner have asked me to scale down the brand team to the bare minimum which means I’ve to let go of 3 very loyal people. \n\nHow do you handle this? I tried upskilling and they are not computer literate. I will have to help them with courses and that will take some time.\n\nWhat would you do as an entrepreneur?",
    "url": "https://reddit.com/r/Entrepreneur/comments/1nboudx/how_do_you_fire_loyal_employees_because_you_are/",
    "score": 123,
    "num_comments": 74,
    "date": "2025-09-08",
    "commercial_score": 12,
    "category": "general_frustration",
    "author": "Reasonable_Draft_541",
    "upvote_ratio": 0.98
  },
  {
    "subreddit": "startups",
    "title": "Retention is a growth strategy, not a support function -I Will Not Promote",
    "text": "This week I had a consultation call with a SaaS founder who told me their entire focus was on acquisition and new signups. Retention was “handled by support.”\n\nAfter 15 years in growth, I’ve seen this mistake over and over. Retention isn’t a back-office function, it’s one of the strongest growth levers you have.\n\nIf customers aren’t sticking, every £/€/$ spent on acquisition is just fueling churn. And the crazy part is that fixing retention usually costs less than pushing harder on ads.\n\nThe biggest unlocks I see with SaaS and B2B teams usually come from:\n\n* Making onboarding effortless so people hit value fast\n* Tracking engagement signals before churn happens\n* Reducing failed payments that silently eat into MRR\n* Building lifecycle programs that reactivate users instead of losing them\n\nMost founders obsess about filling the funnel, but retention is where compounding growth actually happens.\n\nHow do you approach retention in your business, is it part of your growth strategy, or somet",
    "url": "https://reddit.com/r/startups/comments/1nf67vv/retention_is_a_growth_strategy_not_a_support/",
    "score": 14,
    "num_comments": 19,
    "date": "2025-09-12",
    "commercial_score": 12,
    "category": "general_frustration",
    "author": "N3k1i",
    "upvote_ratio": 0.83
  },
  {
    "subreddit": "digital_marketing",
    "title": "How do you explain marketing spend to your finance peers?",
    "text": "Im noticing that many of my clients that are marketers are having a hard time explaining their metrics to their CFO/ finance co-founders. \n\nIm curious to how others solve this issue  \n  \n im seeing a lot of excel sheets, and screen shots, but that doesnt seem to address the core issue, which seems to be a disconnection between how the two roles measure growth.\n\nAfter chatting with GPT, I came up with some basics\n\n|Marketing term|Finance term|How we translate|\n|:-|:-|:-|\n|ROAS|**Contribution-ROAS**|(Net − variable costs) ÷ Channel spend|\n|MER|**Contribution-MER**|(Net − variable costs) ÷ Total media spend|\n|New cust.|**CAC**|Channel spend ÷ New customers|\n|“Profitable”|**Payback ≤ N days**|Cohort contribution curve crosses CAC|\n|AOV|**True AOV**|Net revenue ÷ Orders (refunds excluded)|",
    "url": "https://reddit.com/r/digital_marketing/comments/1ndgxdo/how_do_you_explain_marketing_spend_to_your/",
    "score": 2,
    "num_comments": 8,
    "date": "2025-09-10",
    "commercial_score": 12,
    "category": "general_frustration",
    "author": "Admirable-Cow6436",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Anyone else's \"successful\" business actually keeping them broke?",
    "text": "Real talk - I'm doing $8k/month revenue with my meal prep delivery service but I'm basically living like I'm still unemployed.\n\nStarted this thing 7 months ago thinking I'd be rolling in cash by now. Reality check:\n\n* Revenue: $8,000/month\n* Food costs: $3,200\n* Commercial kitchen rent: $1,800\n* Delivery/gas: $900\n* Packaging: $600\n* Insurance: $400\n* Random shit that breaks: $500\n* My take home: \\~$600\n\nI'm working 70-hour weeks for less than minimum wage. My girlfriend thinks I'm an idiot. My parents keep asking when I'm getting a \"real job.\"\n\nThe weird part? The business IS growing. Started at $2k/month in March. Customers love it. Got 5-star reviews everywhere. But the margins are absolutely brutal in food.\n\nI know I need to either:\n\n1. Raise prices (scared of losing customers)\n2. Find a cheaper kitchen (looked everywhere)\n3. Scale up significantly (need capital I don't have)\n4. Quit (feels like failure)\n\nNot looking for pity, just wondering if anyone else is in this weird limbo wh",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1ne2b9w/anyone_elses_successful_business_actually_keeping/",
    "score": 89,
    "num_comments": 83,
    "date": "2025-09-11",
    "commercial_score": 12,
    "category": "general_frustration",
    "author": "Mitul_G",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "indiehackers",
    "title": "Looking for feedback: My SaaS idea – Build a custom team of AI agents",
    "text": "I’m working on a SaaS product idea and would love your feedback.\n\nThe concept: small businesses (or individuals) can **create their own team of AI agents**, similar to hiring employees but in software. Each agent can be assigned a specific role (e.g., marketing assistant, customer support rep, analyst) and given access to tools or data to do the job.\n\nKey features I’m building:\n\n* **1:1 chats and calls** with individual AI agents\n* **Group calls** with multiple AI agents to simulate real team meetings\n* **Task assignment & automation**, where agents collaborate like a real team to get work done\n\nThe goal is to help businesses automate their work in a more “human-like” way—building a team of specialized AI agents instead of buying multiple disconnected tools or paying for expensive services.\n\nI’d love to hear:\n\n1. Do you think this idea has market fit?\n2. What pain points do you see it solving (or not solving)?\n3. Are there similar products you’ve come across already?",
    "url": "https://reddit.com/r/indiehackers/comments/1mug3it/looking_for_feedback_my_saas_idea_build_a_custom/",
    "score": 4,
    "num_comments": 9,
    "date": "2025-08-19",
    "commercial_score": 12,
    "category": "integration_problems",
    "author": "No-Examination-1583",
    "upvote_ratio": 0.84
  },
  {
    "subreddit": "datascience",
    "title": "Help me evaluate a new job offer - Stay or go?",
    "text": "Hi all, \n\nI'm having a really hard time deciding whether or not to take an offer I've recently received, would really appreciate some advice and a sense check. For context I generally feel my current role is comfortable but i'm starting to plateau after the first year, i'm also in the process of buying my dream house just to complicate things.\n\n### **Current Role**\n\n##### The Good\n\n- I am early 30's and have 4 years of experience as a full stack DS but am currently employed as an ML Eng for the last year. \n- My current role is effectively a senior/lead MLE in a small team (me + 3 DS) and I have loads of autonomy in how we do things and I get to lead my own  Gen AI projects with small squads as I'm the only one with experience in this domain. \n- I also get to straddle DS and MLE as much or as little as I want to in other projects, which suits my interests and background. \n- We have some interesting projects including one I'm leading. I think I have around 6 months of cool work to do whe",
    "url": "https://reddit.com/r/datascience/comments/1na6x3q/help_me_evaluate_a_new_job_offer_stay_or_go/",
    "score": 13,
    "num_comments": 33,
    "date": "2025-09-06",
    "commercial_score": 12,
    "category": "general_frustration",
    "author": "Rockingtits",
    "upvote_ratio": 0.74
  },
  {
    "subreddit": "SaaS",
    "title": "The hardest part is figuring out how to generate traffic, how do you do it ?",
    "text": "Been spinning my wheels on landing my first customers for months. You know the struggle, limited budget, analysis paralysis, and every \"expert\" telling you to be everywhere at once.\n\nJust discovered this systematic approach that's honestly game-changing. Here's the exact framework I'm now implementing:\n\nThe process that's working:\n\n1. Select and prioritise just TWO channels that can actually move the needle for your specific audience.\n\n2. Focus on generating demand first through Prospect Type Targeting Campaigns like social media post engagement (sponsored or non-sponsored) and/or Website Traffic Objective Ad Campaigns.\n\n3. Drive engagement and relevant traffic through custom audience segments from post-engagement campaigns and informational/educational keyword targeting from website traffic campaigns.\n\n4. Use custom audience targeting based on specific interests and traits, plus keyword queries that show genuine interest in your type of product. \n\n5. This stage targets people who are ",
    "url": "https://reddit.com/r/SaaS/comments/1n3daee/the_hardest_part_is_figuring_out_how_to_generate/",
    "score": 1,
    "num_comments": 0,
    "date": "2025-08-29",
    "commercial_score": 11,
    "category": "cost_problems",
    "author": "Impossible_Music9735",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "I have created an open-source platform as an alternative to HubSpot and Zoho.",
    "text": "I am developing an open-source, all-in-one business management software called Opensyte, which aims to serve as an alternative to HubSpot and Zoho. I have completed about 40% of the features in just one month.\n\n**What sets Opensyte apart from HubSpot and Zoho?**\n\n\\- **Simplicity**: Opensyte is much simpler to use, with all features consolidated in one location, making it both easy and quick to navigate.\n\n\\- **User-Friendly Interface:** The user interface of Opensyte is distinctly different from other business management platforms. All features are organized in a sidebar, allowing users to switch between them effortlessly. Everything is clearly laid out, so you don't need to be an expert to use the platform!\n\n\\- **User Management & Access Control:** I have put in significant effort to ensure that this feature stands out from those of other platforms. Our User Management & Access Control system is highly customizable. You can create custom roles with predefined permission sets and manage",
    "url": "https://reddit.com/r/SaaS/comments/1n4qvnq/i_have_created_an_opensource_platform_as_an/",
    "score": 2,
    "num_comments": 0,
    "date": "2025-08-31",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "dagermohamed2",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "smallbusiness",
    "title": "How to respond to prospective customers who say you're \"too expensive\"?",
    "text": "I'm a personal chef, and it surprises me every time a prospective client reaches out and then says the cost is \"too expensive.\"  My pricing is listed on my website, and my $50/hour rate is on the lower end of what New York City-based personal chefs charge ($50-$75/hour). My hourly rate makes it possible for me to pay my bills, but I am by no means enjoying a luxurious life myself.  By contrast, my busy seasons make it possible for me to survive my slow seasons.\n\nWhen you have a potential client decline working with you and gripe about the price, how do you respond?  In the past, I've responded with grace, i.e. \"No worries, thanks for reaching out!\"\n\nBut these folks stick with me.  They're reaching out about a service that is, by its very nature, a luxury offering; the clients who have complained about my prices live in the most expensive New York City neighborhoods (West Village, Upper West Side, Chelsea, where a 2 bedroom will put you back $7,000/month or more). I've noticed a direct ",
    "url": "https://reddit.com/r/smallbusiness/comments/1n3jlls/how_to_respond_to_prospective_customers_who_say/",
    "score": 274,
    "num_comments": 308,
    "date": "2025-08-29",
    "commercial_score": 11,
    "category": "cost_problems",
    "author": "LizWins1818",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "smallbusiness",
    "title": "How do you tell long-time clients their bill is going up 50%?",
    "text": "\nI run a tax firm. For years we’ve raised prices 5–10% annually, but it hasn’t kept up. Taxes are getting more complex, our team has more experience, and I’m putting in long hours. After staff, tech, and paying down debt, profit is minimal.\n\nThe issue: long-time clients are paying way below what new clients pay. To get them current, it would mean a 25–50% increase. We also have 20–40 new leads every week at the higher rates.\n\nFrom a business standpoint, it makes sense. But how do you break that kind of news to clients who’ve been with you for years without blowing up the relationship?",
    "url": "https://reddit.com/r/smallbusiness/comments/1nczcmt/how_do_you_tell_longtime_clients_their_bill_is/",
    "score": 131,
    "num_comments": 77,
    "date": "2025-09-10",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "Taxstra",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "smallbusiness",
    "title": "Looking for reliable 3PL partners, any recommendations?",
    "text": "My small business is growing (finally!) and we’re at the point where outsourcing fulfillment makes a lot of sense. I’ve been looking into 3PL options, but the space feels kind of overwhelming and filled with companies that cater more to enterprise clients.\n\nHas anyone here had good experiences with a 3PL that works well with small-to-mid-sized e-commerce stores? We’re based in the U.S., and most of our customers are also here, so ideally we’d like a partner that has transparent pricing, quick turnaround on getting inventory ready (ideally within a couple of days), integrates smoothly with platforms like Shopify or Amazon, and offers reliable support without enterprise-level costs.\n\nWould love to hear who’s helped you streamline fulfillment without costing an arm and a leg",
    "url": "https://reddit.com/r/smallbusiness/comments/1msudlf/looking_for_reliable_3pl_partners_any/",
    "score": 5,
    "num_comments": 45,
    "date": "2025-08-17",
    "commercial_score": 11,
    "category": "integration_problems",
    "author": "jopez604",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "marketing",
    "title": "How to navigate being a 1-person marketing team in a chaotic startup?",
    "text": "I’m looking for some perspective from others who’ve been in similar shoes. Sorry, this will be a bit of a rant but I need some input from people who actually know whats normal.\n\nI’m a one-person marketing team at a fast-growing tech startup. On paper, it’s exciting: there’s budget, freedom to experiment, and I’m not afraid of little-to-no direction. But the dynamics are messy, and I’m struggling with how to position myself.\n\n* **Reporting lines are weird.** I report to the Chief of People (because “the CEO has no time”). She’s involved in everything (leadership team, finances, etc.) and pushes hard without fully understanding what I do. Small things she cares about, big-picture she doesn’t. If I explain too much, I’m “too detailed.” If I don’t, she wants more. She pushes for things sooner. I get it, but why is she the one pushing? She doesn't understand anything I do? Who makes the rules here, her or the CEO or the investors or sales?  She wants to be involved everywhere, but also not ",
    "url": "https://reddit.com/r/marketing/comments/1mx840c/how_to_navigate_being_a_1person_marketing_team_in/",
    "score": 42,
    "num_comments": 35,
    "date": "2025-08-22",
    "commercial_score": 11,
    "category": "automation_needs",
    "author": "Baybeli",
    "upvote_ratio": 0.98
  },
  {
    "subreddit": "indiehackers",
    "title": "Building an open-source AI browser alternative to Perplexity/Firecrawl - lessons from 8 months of indie hacking",
    "text": "Hey fellow indie hackers! 👋\n\n\n\nBeen lurking here for months while building something that started as a personal frustration and turned into what might be a useful open-source tool for our community.\n\n\n\n\\*\\*The problem that got me started:\\*\\*\n\nAs a CS student working on various projects, I was constantly dealing with broken web scrapers. Every time a site updated their layout, my scrapers would fail. Companies like ScrapingBee and Firecrawl charge $50-200/month for what should be accessible to developers everywhere.\n\n\n\n\\*\\*What I learned building in the open:\\*\\*\n\n\\- Started with traditional DOM parsing (broke constantly)\n\n\\- Switched to AI vision approach (Google Gemini sees pages like humans do)\n\n\\- Realized the real need isn't just scraping - it's natural language browser automation\n\n\n\n\\*\\*The indie hacker journey from Bangladesh:\\*\\*\n\n\\- Limited budget meant every API call had to count\n\n\\- Time zone differences made community engagement challenging  \n\n\\- But global perspective help",
    "url": "https://reddit.com/r/indiehackers/comments/1mow4f9/building_an_opensource_ai_browser_alternative_to/",
    "score": 1,
    "num_comments": 0,
    "date": "2025-08-13",
    "commercial_score": 11,
    "category": "missing_features",
    "author": "ai_naymul",
    "upvote_ratio": 0.67
  },
  {
    "subreddit": "ProductManagement",
    "title": "Centralised strategy + decentralised execution = new waterfall?",
    "text": "I’ve been interviewing with a number of Series A/B startups recently and I keep running into a same pattern. Many of them are structuring product in a way that feels… off.\n\nOn paper, it sounds modern: a central strategy team defines initiatives, then execution squads deliver against them. But in practice, it looks a lot like waterfall dressed up in new clothes. Strategy and discovery are separated from execution, and squads are left to “deliver” rather than truly own problems end to end.\n\nI can’t help but wonder: is this a cost play, a symptom of weak leadership, or simply the growing pains of companies trying to scale? Curious to hear your thoughts and experience with this?\n\n—-\nSetup: \n1) Strategy sits with a dedicated Product Strategy Squad (a mix of PMs, designers, researchers, and analysts whose sole focus is to live in the problem space). Their job is to dig deep, surface the biggest opportunities, and translate them into Initiatives: problem statements backed by data and insight.",
    "url": "https://reddit.com/r/ProductManagement/comments/1nd7brk/centralised_strategy_decentralised_execution_new/",
    "score": 11,
    "num_comments": 23,
    "date": "2025-09-10",
    "commercial_score": 11,
    "category": "workflow_problems",
    "author": "SmokedBBQrib",
    "upvote_ratio": 0.71
  },
  {
    "subreddit": "PowerBI",
    "title": "Looking for One-Time Power BI Consultant/Assistance",
    "text": "I work for a small financial planning firm and we're looking to integrate Power BI with our Excel models to create some more cutting-edge deliverables to show to clients. I have no experience with Power BI and have been trying to teach myself, but figured it's probably worth the money to hire someone to show me how to model what I'm trying to do rather than wasting man hours fumbling around and trying to do it myself. I'm looking for a verified, cost-effective group that's willing to meet for 30-60 minutes so that I can explain the end result I'm trying to achieve and either have them show me how to do it, or take it over themselves to get to the end result in mind.\n\nI believe the project would be fairly simple to anyone who has experience with Power BI and could probably be completed by that person within an hour. I just need to get in contact with the right person/team that fits the bill.\n\nI've looked at the Microsoft Power BI Partners site and it all looks to be for large Fortune 50",
    "url": "https://reddit.com/r/PowerBI/comments/1n0z50i/looking_for_onetime_power_bi_consultantassistance/",
    "score": 5,
    "num_comments": 13,
    "date": "2025-08-26",
    "commercial_score": 11,
    "category": "integration_problems",
    "author": "TheRealSyndicate",
    "upvote_ratio": 0.78
  },
  {
    "subreddit": "startups",
    "title": "How do you go about finding the right cofounders? I will not promote.",
    "text": "Hi all,\n\nI am a 47-year-old engineer with about 25 years in software development. For most of my career I have been the person shoveling data, cleaning up processes, and building the glue that keeps businesses running. It is not flashy work, but I enjoy it, especially when it removes bottlenecks for small companies that do not have big IT budgets.\n\nNow I am exploring the idea of turning that into a business. The model would be consulting-driven: Sit down with small businesses, map out how they really operate, help them spot inefficiencies, and then create lightweight solutions (automations, tailored CRMs, or other tools) that fit their processes instead of overwhelming them. My ideal customer knows he has to do something to be more effective and knows his business better than anybody else.\n\nWhere I am weaker is sales and outreach. I can deliver value once I am in the room, but I have never been the person who gets into the room. I am a bit of an introvert. I am very good at talking abo",
    "url": "https://reddit.com/r/startups/comments/1n3icc6/how_do_you_go_about_finding_the_right_cofounders/",
    "score": 16,
    "num_comments": 41,
    "date": "2025-08-29",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "biocin",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "startups",
    "title": "Built a no-budget B2B sales tool (looking for validation- I will not promote)",
    "text": "Hi folks,\n\nI wanted to share a scrappy project I hacked together.\n\n**Problem:** Sales teams spend way too much time on **manual research** (LinkedIn, Google, company sites, CRMs) before they even reach out.\n\n**Solution:** I built a tool (with no marketing budget, just hacked together) that **aggregates prospect/account info and gives a quick analysis** in one view. To summarize, this tool specifically helps with,  \n  \n1. **Total Addressable Market (TAM) discovery:** quickly size and identify the right markets.\n\n2. **Company intelligence**: insights on revenue, industry, pain points, and competitor comparisons.\n\n**3. Persona insights:** AI-generated profiles of decision-makers, including communication tips.\n\n**Goal:** I’m **not trying to sell it yet**. I just want feedback from early testers to see if this is worth pursuing or if I’m barking up the wrong tree.\n\nIf you’re in B2B sales (or have friends who are), would you find this useful? Happy to share the beta link with anyone curious.",
    "url": "https://reddit.com/r/startups/comments/1n4r8u8/built_a_nobudget_b2b_sales_tool_looking_for/",
    "score": 3,
    "num_comments": 39,
    "date": "2025-08-31",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "khocha_powa_86",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "smallbusiness",
    "title": "Freelancers/Consultants: How do you handle writing the same email 20 times a day without losing your mind?",
    "text": "I run a solo design consultancy. I love the work, but I'm spending way too much of my day writing the same types of emails over and over: answering common questions about my process, sending project updates, following up on invoices, etc. I have templates, but it still takes time to find the right one, copy-paste, and personalize it. I know I should automate more, but it feels clunky. How do you all handle this without sounding like a robot or spending your entire profit margin on admin time? Is there a middle ground between full-blown automation and typing every single response manually?",
    "url": "https://reddit.com/r/smallbusiness/comments/1ne64ic/freelancersconsultants_how_do_you_handle_writing/",
    "score": 36,
    "num_comments": 62,
    "date": "2025-09-11",
    "commercial_score": 10,
    "category": "automation_needs",
    "author": "BrotherBlackSheep",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "smallbusiness",
    "title": "If you had $0 to spend on ads, how would you grow your social media audience organically this month?",
    "text": "Hi all, I’m hitting a point where the marketing budget is super tight for me and my team, and I’m trying to figure out how to grow my audience without spending a dime on ads, anything that we can do directly, I don't mind spending money but the least i want is results from them.\n\nI’ve tried posting regularly, sharing user-generated content, and engaging with people in comments, but growth is still slow. I feel like there must be creative ways small businesses actually get traction organically that I’m missing.\n\nIf you were in my shoes and had $0 for ads this month, how would you grow your social media audience? What’s worked for your brand, and what’s a total waste of time? \n\nWould love to hear your tips, strategies, or even small hacks that genuinely moved the needle.",
    "url": "https://reddit.com/r/smallbusiness/comments/1nezpgd/if_you_had_0_to_spend_on_ads_how_would_you_grow/",
    "score": 66,
    "num_comments": 37,
    "date": "2025-09-12",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "DigIndependent7488",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "digital_marketing",
    "title": "I MADE $20K FROM A SINGLE REEL (organic)",
    "text": "No, I am not joking. Yes, I am sharing with you the exact playbook to do the same.\n\n- I posted one reel with a simple CTA: “Comment … and I’ll send you a free resource with all the links.”\n- People commented, my agent sent an automatic DM: “I’ll send it right now, just hit follow to unlock.”\n- After they followed, my agent asked for their email address (all happening in the Instagram DMs).\n- The email gets automatically stored in my Email Marketing tool and enters my business workflows.\n\nHere are the key stats:\nFrom 5.7M views → 12.1K comments → 8.7K emails → 90 paying clients.\nTotal revenue from one single post: $19K.\n\nWhy does this work?\n\nThe free giveaway is perceived as something valuable, and it makes people take action. Moreover, teaching through educational content positions you as an expert in the field. In my case, I am selling services for job seekers, and the giveaway was a guide on the best free courses available for finance. But the application could be infinite.\n\nThis is ",
    "url": "https://reddit.com/r/digital_marketing/comments/1nf5d52/i_made_20k_from_a_single_reel_organic/",
    "score": 43,
    "num_comments": 40,
    "date": "2025-09-12",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "Sufficient_Talk_1441",
    "upvote_ratio": 0.73
  },
  {
    "subreddit": "ProductManagement",
    "title": "Looking for an affordable analytics tool for +300M monthly events",
    "text": "I keep hearing about tools like Mixpanel and other similar options for tracking data and funnels. But for a SaaS like the one I work on, it becomes way too expensive to integrate such a thing as these tools usually charge you per event.\n\nFor context, right now, we have +300M events per month even with a somewhat incomplete integration of them. We use GA4 right now, but it is heavily sampled to the point it doesn’t seem like a good enough solution, and upgrading can again, take us to the $500k per annum mark.\n\nI even looked up PostHog's cloud option, as they say self hosting isn't best for such volume. But considering how almost 250M of the 300M events were from identified users, the cost went up to \\~60k$ per month.\n\nAny thoughts or ideas on what might be a relatively affordable option here? Anything you’ve had the experience with?",
    "url": "https://reddit.com/r/ProductManagement/comments/1ndq89j/looking_for_an_affordable_analytics_tool_for_300m/",
    "score": 1,
    "num_comments": 28,
    "date": "2025-09-10",
    "commercial_score": 10,
    "category": "cost_problems",
    "author": "Sad-Lynx9026",
    "upvote_ratio": 0.56
  },
  {
    "subreddit": "ProductManagement",
    "title": "CEO wants Product Managers to be 'full-stack PMs'.",
    "text": "I have a healthtech start-up client and the CEO wants me to 'overhaul' the whole development process and teams.\n\nI first assessed their process and got a feel of how it's being ran currently, and while I did note the process could be smoother, I do not think major changes are needed. I shared this with the CEO and he said he wants his Product team to be 'full-stack PMs' - PMs who can design, code and test. I told him PMs cannot do EVERYONE'S jobs, it is impossible and actually borderline inhumane, and in return he says the blogs and podcasts he has read say otherwise.\n\nI also informed him that doing this unnecessary revamp of the team and process would cost a lot of time and money. He is still pushing for it.\n\nHow would you manage this?\n\nEDIT: I forgot to mention that he wants to fire everyone to 'start over' and has set an 8-ROUNDS INTERVIEW PROCESS. THE COMPANY IS NOT FAANG. He is a billionaire, though.\n\nEDIT II: So as I have mentioned on the first part - they are my client. I do not",
    "url": "https://reddit.com/r/ProductManagement/comments/1ndd6t4/ceo_wants_product_managers_to_be_fullstack_pms/",
    "score": 237,
    "num_comments": 190,
    "date": "2025-09-10",
    "commercial_score": 10,
    "category": "general_frustration",
    "author": "wandababyyy",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "notion",
    "title": "Notion’s Biggest Shortcomings (that somehow still haven’t been fixed in 2025)",
    "text": "A little background: I’ve been using Notion since 2021 & have been lurking on this sub since 2022. I remember going up and down threads back then trying to find solutions to very basic things.. and shockingly, they didn’t exist. It’s now 2025, and guess what? 99% of those same issues still have no solution.\n\nThe funny thing is: I’ve gotten way better at building in Notion. Back then, I’d spend literal days trying to figure out a page layout. Now, I can spin up an entire workspace with a master database, templates, and layouts in two hours flat. And yet, despite all the so-called \"updates,\" the same core problems are still sitting there collecting dust.\n\nIt honestly feels like the product direction is chaos. Every other week it’s:\n\n* \"New update! Look, we slightly changed the shades of select/multi-select colors.\"\n* \"New update! We changed the border radius on random blocks.\"\n* \"New feature: random ‘data source’ integration that currently has zero real-world usage.\"\n\n\n\nMeanwhile the act",
    "url": "https://reddit.com/r/Notion/comments/1nfl1o3/notions_biggest_shortcomings_that_somehow_still/",
    "score": 15,
    "num_comments": 8,
    "date": "2025-09-13",
    "commercial_score": 10,
    "category": "automation_needs",
    "author": "PleasEnterAValidUser",
    "upvote_ratio": 0.78
  },
  {
    "subreddit": "startups",
    "title": "How to deal with this CTO? (I will not promote)",
    "text": "I will not promote\n\nOur startup is about 2 years old, and there are 4 co-founders, 25% share each.\n\nCTO - Comp Sci PhD (AI) from a top Ivy League, ex-Google DeepMind with outstanding research awards, main publication has over 6k citations, and won best paper awards in top Comp Sci conferences. And 1x previous exit.\n\nCEO - Comp Sci PhD (AI), same school as the CTO, but no good publications. Ex-lead data scientist in a T3 consulting firm that barely anyone outside of the industry had heard of.\n\nFounders 3 and 4 are domain experts in the industry we are in.\n\nWe started off rough, had no clients, failed in all sales and fundraising. We spent the first 2 years testing different ideas and looking for the right product market fit. The CTO promised everything, but didn't end up doing any coding at all. However, he did put his name down, turned up to final round VC meetings, gave us important mentorship a few times during critical events, since he is an experienced founder, and the other 3 are ",
    "url": "https://reddit.com/r/startups/comments/1n9r2uv/how_to_deal_with_this_cto_i_will_not_promote/",
    "score": 43,
    "num_comments": 62,
    "date": "2025-09-06",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "d_edge_sword",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "startups",
    "title": "Alternative to Kickstarter for individuals and smaller companies? (I will not promote)",
    "text": "Hi everyone, I've been working on a product for a few years now. I have prototypesthatbwork well and look good. I also continue to test and improve them. The product is an electronic gadget and takes a decent amount of time to solder and assemble it together. I am the only person working on it. I don't have a team and I don't have a lot of money or time to dump into this because I'm supporting a family first with my full time job. I started looking into Kickstarter, but as soon as I checked it out I realized the people on Kickstarter are basically small companies that are using the platform to market their product before launch. In order to look like the other guys, I need to make a website, an online store, videos, and flashy ads. I am an engineer, so this part of the process is not my strong suit. I feel that even if I push myself to finish the Kickstarter, I will be irrelevant because I'm not as flashy as the others. Any suggestions for a different platform that might be a better fi",
    "url": "https://reddit.com/r/startups/comments/1mx8tyb/alternative_to_kickstarter_for_individuals_and/",
    "score": 6,
    "num_comments": 5,
    "date": "2025-08-22",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "RonandStampy",
    "upvote_ratio": 0.88
  },
  {
    "subreddit": "SaaS",
    "title": "Created an open-source alternative to Resend after email costs hit $200+/month",
    "text": "Running multiple SaaS products, our Resend costs were approaching $200+/month across projects. Built FreeResend as a solution.\n\n**Business impact:**\n- Reduced email costs by 85% (now using Amazon SES rates)\n- Eliminated vendor lock-in concerns\n- Faster domain setup (auto DNS vs manual configuration)\n- Complete visibility into email delivery\n\n**Technical approach:**\n- 100% API compatibility with Resend (zero migration effort)\n- Self-hosted Next.js application\n- Amazon SES for reliable delivery\n- Digital Ocean integration for automatic DNS setup\n- Open source (MIT license)\n\n**ROI:** For anyone sending 50k+ emails/month, the savings pay for the hosting costs within weeks.\n\nThe goal isn't to replace Resend for everyone - they're fantastic. But for cost-conscious founders and agencies, this provides the same DX at fraction of the cost.\n\n**GitHub:** https://github.com/eibrahim/freeresend\n\nOther SaaS founders - what's your email cost tipping point?",
    "url": "https://reddit.com/r/SaaS/comments/1mzoaej/created_an_opensource_alternative_to_resend_after/",
    "score": 2,
    "num_comments": 3,
    "date": "2025-08-25",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "eibrahim",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "Share your company and I'll find you 5 customers for free",
    "text": "Hey everyone,\n\nI’d love to help some founders here connect with real potential customers.  \nDrop your startup link + a quick line about who your target customer is.\n\nWithin 24 hours, I’ll send you 5 people who are *already showing buying intent* for something like what you’re building.\n\nI’ll be using our tool [pentaalpha.org](http://pentaalpha.org) which tracks online conversations for signals that someone is in the market. But this is mostly an experiment to see if it’s genuinely useful for folks here.\n\nAll I need from you:\n\n* Your website\n* One sentence on who it’s for\n\nCapping this at 20 founders since it requires some manual work on my end.\n\nAlso, here are 1,000+ places to promote your startup (and it’s free) : [https://www.notion.so/1-000-places-to-promote-your-startup-268b9abcbe3f803592a1c29abf5ca5d6?source=copy\\_link](https://www.notion.so/1-000-places-to-promote-your-startup-268b9abcbe3f803592a1c29abf5ca5d6?source=copy_link)",
    "url": "https://reddit.com/r/SaaS/comments/1nfdjcb/share_your_company_and_ill_find_you_5_customers/",
    "score": 31,
    "num_comments": 57,
    "date": "2025-09-12",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "Ecstatic-Tough6503",
    "upvote_ratio": 0.79
  },
  {
    "subreddit": "SaaS",
    "title": "What’s the most underrated problem in SaaS that nobody seems to be solving?",
    "text": "I keep seeing the same SaaS trends pop up. AI integrations. No code tools. Analytics dashboards. Workflow automation. Super useful. But it feels like everyone is building in the same few directions.\n\nMeanwhile there are all these unsexy but massive pain points nobody touches. Messy international compliance and data laws. Onboarding customers across multiple countries. Pricing transparency. Why is SaaS pricing still a black box in 2025? Integrations that actually work without duct tape.\n\nFeels like SaaS founders are chasing what’s trendy instead of tackling the gritty problems businesses quietly hate.\n\nSo here’s my question for r/SaaS. What do you think is the most underrated overlooked problem in SaaS right now? Not the flashy AI answer. The one that would make a thousand businesses breathe a sigh of relief if someone solved it.\n\n",
    "url": "https://reddit.com/r/SaaS/comments/1nf48c5/whats_the_most_underrated_problem_in_saas_that/",
    "score": 74,
    "num_comments": 42,
    "date": "2025-09-12",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "Deeceness",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "smallbusiness",
    "title": "How do I address my team about excessive overtime?",
    "text": "Small Seasonal Hotel owner here. So here's my issue, we have a seasonal hotel that currently employes 18 people over the summer (March to October). \n\nI took over as a manager 3 years ago and tried to address some of the issues regarding employees welfare. In that regard I observed that the housekeeping team (made up by 3 ladies) was exremely overworked so much so that they would work 7/7 in the busier months of July and August and accumulate a lot of  paid overtime ( around 1,5 hr per day + a full payed day for the lack of day off,  which in my country is payed with a 40% increase of their regular hourly pay). \n\nWith that amount of money I could hire an extra 2 maids. \n\nAfter addressing the issue (and acknolwleging that is illegal to work 7/7) with them and telling  that I would hire and extra maid they didn't seem too pleased, but I did it anyways. \n\nAfter hiring a fourth maid I was able to warrant them a day off a week and to distrubute their workload in a way that they would still g",
    "url": "https://reddit.com/r/smallbusiness/comments/1n5jfcu/how_do_i_address_my_team_about_excessive_overtime/",
    "score": 63,
    "num_comments": 74,
    "date": "2025-09-01",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "Time_Marionberry9572",
    "upvote_ratio": 0.88
  },
  {
    "subreddit": "juststart",
    "title": "Pinterest drove 15K visitors to my course landing page in 90 days",
    "text": "I launched an online course about freelance writing 3 months ago. Tried Facebook ads (wasted 500$ for 3 signups), Instagram got barely any likes and no clicks, and then I discovered pinterest as a lead generation channel.\n\nWhat i did:\n\n- Course: \"Freelance Writing Mastery\" ($297)\n- Target: People wanting to start freelance writing\n- Pinterest strategy: Educational pins linking to free resources → email capture → course sales\n\nWhat I used\n\n- Tailwind for scheduling and some pin design (Pro $15/mo)\n- Canva for pin designs (Pro $10/mo)\n- ConvertKit for email sequences (Creator $25/mo)\n\nResults after 3 months\n\n- 47 pins published\n- 15,247 website visitors from Pinterest\n- 1,847 email subscribers\n- 23 course sales ($6,831 revenue) vs $50 in monthly expense\n- Cost per lead: $0.42\n\nWhat Worked:\n\n- \"How to\" pins performed 10x better than promotional ones\n- Scheduling up to 5 pins daily at optimal times (Tailwind figured this out)\n- Joining relevant Tailwind communities - other members shared m",
    "url": "https://reddit.com/r/juststart/comments/1ndqydn/pinterest_drove_15k_visitors_to_my_course_landing/",
    "score": 74,
    "num_comments": 9,
    "date": "2025-09-10",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "Flimsy_Hat_7326",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "juststart",
    "title": "My journey from 5 bad businesses to online entrepreneurship",
    "text": "Like the vast majority of Brazilians, I didn't start a business because I \"wanted to be an entrepreneur.\" On the contrary, I *needed* to in order to pay bills and maintain the basics.  \n  \nSo, let's explore this little story and see where we've arrived today.  \n  \n**Parties, open bar, and shirts**  \n  \nMy first business was actually a combo. I had left my last job, and I liked parties. So, I started organizing a party monthly at my father's house. I paid for water, electricity, and gave him some money. In exchange, I organized Saturday to Sunday open bar parties.  \n  \nThe formula was simple: I created a party event on Facebook, invited everyone I knew, handed out flyers in the city, and spread posters at bus stops about the party. And, to top it off, women were free until 8:00 PM. Consequence? Guys came and paid for their tickets and theirs (women's). Hahaha. And it filled up...  \n  \nI started noticing that people were dressed poorly. And I thought, \"Why not dress them?\"  \n  \nBoom! I s",
    "url": "https://reddit.com/r/juststart/comments/1kysvna/my_journey_from_5_bad_businesses_to_online/",
    "score": 13,
    "num_comments": 21,
    "date": "2025-05-30",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "henripacheco27",
    "upvote_ratio": 0.85
  },
  {
    "subreddit": "microsaas",
    "title": "my Dad said \"very good app\" 😅",
    "text": "Sometimes the best validation comes from the people who matter most.\n\n✨A few weeks ago, my dad called with that familiar entrepreneurial spark: \"I have an idea for a new business. Can you build me a website?\"\n\nMy internal reaction: \"Oh no, I really don't enjoy web development...\"\n\nBut of course, I said yes. Because it's dad.\n\n🤔 Instead of diving into code from scratch, I did what any smart individual does - I checked my personal ext-brain (via \"**ti(ME)line**\" that I built, to manage my own knowledge) for tools I'd bookmarked in past.\n\n🤓 Found it: \"Solid\" - an alternative to Lovable that prioritizes speed over UI polish.\n\n🚀 Two prompts. 20 minutes. Deployed\n\n🚀 Full webapp delivered: login/logout, inventory management, that worked.\n\n🚀 Dad's review? \"Very good app.\"\n\nIn that moment, I realized something powerful. All those 20+ years of learning, experimenting, and stacking knowledge weren't just about building technical skills - they were about being ready to turn someone's vision into r",
    "url": "https://reddit.com/r/microsaas/comments/1nez0n3/my_dad_said_very_good_app/",
    "score": 47,
    "num_comments": 8,
    "date": "2025-09-12",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "hellorahulkum",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "web_design",
    "title": "How to find agencies to partner up with?",
    "text": "Hi everyone, my husband and I recently started a small agency where we combine creative + tech. We focus on digital marketing  branding, content, and strategy and also bring in automations to save teams time and improve workflows.\n\nWe’re looking to connect with other agencies, especially those doing web dev, to explore partnerships.\n\nThe idea is to complement each other’s services for example, if you handle dev, we can support on design, branding, content, or marketing. \n\nAnd when there’s overflow, we’d love to collaborate on projects together.\n\nIf you’ve done agency-to-agency partnerships before, what’s worked best for you? \n\nAnd if you’re open to exploring a partnership with us, I’d love to connect!\n\n\n",
    "url": "https://reddit.com/r/web_design/comments/1n8961d/how_to_find_agencies_to_partner_up_with/",
    "score": 8,
    "num_comments": 11,
    "date": "2025-09-04",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "ProgramExpress2918",
    "upvote_ratio": 0.79
  },
  {
    "subreddit": "dataengineering",
    "title": "How do you handle your BI setup when users constantly want to drill-down on your datasets?",
    "text": "Background: \nWe are a retailer with hundreds of thousands of items. We are heavily invested in databricks and power bi\n\nProblem: \nOur business users want to drilldown, slice, and re-aggregate across upc, store, category, department, etc. it’s the perfect usecase for a cube, but we don’t have that. Our data model is too large to fit entirely into power bi memory, even with vertipaq compression and 400gb of memory. \n\nFor reference, we are somewhere between 750gb-1tb depending on compression. \n\nThe solution to this point is direct query on an XL SQL warehouse which is essentially running nonstop due to the SLAs we have. This is costing a fortune. \n\nSolutions thought of:\n- Pre aggregation: great in thought, unfortunately too many possibilities to pre calculate \n\n- Onelake: Microsoft of course suggested this to our leadership, and though this does enable fitting the data ‘in memory’, it would be expensive as well, and I personally don’t think power bi is designed for drill downs\n\n- Clickhou",
    "url": "https://reddit.com/r/dataengineering/comments/1n1hy4g/how_do_you_handle_your_bi_setup_when_users/",
    "score": 44,
    "num_comments": 62,
    "date": "2025-08-27",
    "commercial_score": 9,
    "category": "integration_problems",
    "author": "JustASimpleDE",
    "upvote_ratio": 0.9
  },
  {
    "subreddit": "sales",
    "title": "Looking for advice on $11M+ deal size (consulting + tech bundle)",
    "text": "\nOur customer base is in an overlooked industry and what we offer delivers results. They spend tens of millions annually nursing the problem and still having to deal with the same issue again and again.\n\nFor that reason, plus the fact that our tech is patented, we want to go in with a premium contract price. The deal size is around $11M per sale.\n\nI know that’s not your average SaaS subscription or B2B deal. I’m looking for input from folks who’ve sold at this scale (or close to it):\n\n- How do you approach prospecting and opening conversations when the price point is this high?\n\n- Do you have to meet customers in person? How does that usually go as far as setting that up? (After the first call?)\n\n- How do you define an expedited sales cycle with them provided that they aren't used to that but are now going through a crisis?\n\n- Any tips for dealing with deals of this size?\n\nI'll also mention their industry is going through an emergency right now so they're looking for a solution. At the",
    "url": "https://reddit.com/r/sales/comments/1mz49yx/looking_for_advice_on_11m_deal_size_consulting/",
    "score": 9,
    "num_comments": 13,
    "date": "2025-08-24",
    "commercial_score": 9,
    "category": "missing_features",
    "author": "Personal-Start-4339",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "Entrepreneur",
    "title": "How do young “founders” without clients or a real team afford a luxury lifestyle?",
    "text": "I’ve noticed some people in their early 20s who come from families that aren’t particularly well-off calling themselves “founders.” But from the outside, there don’t seem to be active clients or a real team behind their company.\n\nAt the same time, they seem to afford a luxury lifestyle and travel constantly. All without a visible job or steady freelancing income.\n\nHow is this usually possible? Are they funded by investors, family support, loans, or something else?\n\nI want to build independence and a sustainable path myself, so I’d like to better understand the realistic financial routes young entrepreneurs actually take, vs. what just *looks* flashy on the outside.",
    "url": "https://reddit.com/r/Entrepreneur/comments/1n9f9kb/how_do_young_founders_without_clients_or_a_real/",
    "score": 147,
    "num_comments": 173,
    "date": "2025-09-05",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "MysteriousDisk2874",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "startups",
    "title": "Cold outreach won’t work for your startup. Here’s why [I will not promote]",
    "text": "I talk to a lot of startup founders: clients, friends, people I meet at events, and many of them say the same thing: \"We tried cold outreach. It didn’t really work for us.\"\n\nSo I ask: what did you actually try?\n\nAnd 9 times out of 10, when you start digging into details, it’s something like this:\n\n* A list of 100 people from different industries\n* One or two emails, same message to all\n* Maybe one “sounds interesting” as a response\n* No follow-ups\n\nThen they move on and say cold doesn’t work. That’s not outreach, that’s a coin toss.\n\nWe manage outbound for 20+ startups and run over 80 LinkedIn accounts. Across all that, here’s what we’ve seen actually work consistently.\n\n**Before you send anything:**  \nFor outbound to work, you need volume, structure, and constant iterations.  \nAnd it all starts with the **value proposition.**  \nIf you don’t know *who* you’re selling to and *why*, no sequence will save you.\n\nStart with one clear ICP. Not just “CTOs” or “tech startups in US”, but an act",
    "url": "https://reddit.com/r/startups/comments/1neyixl/cold_outreach_wont_work_for_your_startup_heres/",
    "score": 18,
    "num_comments": 31,
    "date": "2025-09-12",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "decaster3",
    "upvote_ratio": 0.73
  },
  {
    "subreddit": "shopify",
    "title": "Need Help Diagnosing a 70% Checkout Abandonment Rate on a Personalised Product Store (Data Inside)",
    "text": "Hi everyone,\n\nI'm hoping to get some expert eyes on a persistent checkout issue I've been facing for quite some time. My store sells personalised jewellery that requires customers to upload a photo using a third-party app (currently UploadKit, but previously Upload-Lift).\n\n**The Core Problem:** I have a universal checkout abandonment rate of around 70%, and my data shows it's significantly worse for my US customers.\n\n**My Data Analysis (12-Month Period):**\n\n* **Overall Checkout Abandonment:** \\~70% across all browsers.\n* **US vs. UK Checkout Abandonment:** The rate for my US customers is **\\~73%**, while for UK customers it's much lower at **\\~53%**.\n* **Top of Funnel is Working:** My ads are performing well, with a high Add to Cart rate (**7.9%** from Meta traffic), so I'm confident the issue is in the checkout process itself.\n\n**What I've Already Ruled Out:**\n\n* **Surprise Shipping Costs:** I offer free shipping.\n* **Payment Processor:** The issue persisted even after I switched from",
    "url": "https://reddit.com/r/shopify/comments/1muzd1q/need_help_diagnosing_a_70_checkout_abandonment/",
    "score": 3,
    "num_comments": 9,
    "date": "2025-08-19",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "stats1101",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "marketing",
    "title": "Looking for an antidetect browser like GoLogin or MultiLogin on a 10 to 15 dollar budget",
    "text": "I am a full time freelancer handling marketing for multiple clients and I need an antidetect browser that can run isolated profiles with different IPs for ad verification, geo testing, creative QA and account management my budget is about 10 to 15 dollars per month. \n\nI have seen that 1Browser offers 20 free profiles and would love real world experiences on reliability, proxy options, ease of use and any tradeoffs others have found for marketing workflows",
    "url": "https://reddit.com/r/marketing/comments/1ne3qsc/looking_for_an_antidetect_browser_like_gologin_or/",
    "score": 35,
    "num_comments": 8,
    "date": "2025-09-11",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "draculemihawk008",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "digital_marketing",
    "title": "I hacked together a tool to cut down sales prospect research time – looking for feedback",
    "text": "Hi folks,\n\nI wanted to share a scrappy project I hacked together.\n\nProblem: Sales teams spend way too much time on **manual research** (LinkedIn, Google, company sites, CRMs) before they even reach out.\n\nSolution: I built a tool (with no marketing budget, just hacked together) that **aggregates prospect/account info and gives a quick analysis** in one view.\n\nGoal: I’m **not trying to sell it yet**. I just want feedback from early testers to see if this is worth pursuing or if I’m barking up the wrong tree.\n\nIf you’re in B2B sales (or have friends who are), would you find this useful? Happy to share the beta link with anyone curious.\n\nAppreciate any feedback",
    "url": "https://reddit.com/r/digital_marketing/comments/1n4rubb/i_hacked_together_a_tool_to_cut_down_sales/",
    "score": 5,
    "num_comments": 10,
    "date": "2025-08-31",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "khocha_powa_86",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "digital_marketing",
    "title": "I'm looking for some career advice for my unique (?) situation",
    "text": "Hey everyone,\n\nI’m looking for some advice as I transition into a full-time job in the marketing field. A bit about me:\n\nI have a master’s degree in theoretical biology (summa cum laude, from the top university here). Over the past 5-6 years, I’ve built and led my own e-commerce brand (classic, not dropshipping, which now has 27k followers on Facebook and 12k on Instagram. I’ve worn all the hats (managed everything from social media, email, automations, strategy, B2B sales) with all the hard and soft skills that come with those, so it’s been a hands-on leadership role, even if it’s not traditional corporate experience.\n\nI’ve also done a couple of years of side consulting in marketing strategy as well as sales and I have experience leading teams in academic settings, which isn’t exactly the same as a corporate team, but definitely helped me build leadership skills.\n\nThe main reason I'm looking for a job is that I want to stop relying on my brand to survive, as taking a paycheck has been",
    "url": "https://reddit.com/r/digital_marketing/comments/1n5b3vx/im_looking_for_some_career_advice_for_my_unique/",
    "score": 6,
    "num_comments": 5,
    "date": "2025-09-01",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Personal_Permission5",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "digital_marketing",
    "title": "Looking for affiliates: 30% commission promoting a privacy-first AI tool (30-day cookies)",
    "text": "Hey everyone,\n\nI’ve built a desktop tool called **RenameIQ**, designed for **scanned documents and image organization**.  \nIt uses **offline AI + OCR** to automatically rename files based on their content — 100% privacy-focused, no cloud required.\n\nI’m opening up an **affiliate program** and looking for people with **email lists, small communities, or blogs** in these niches:\n- Productivity software\n- Digital organization\n- Paperless workflows\n- Small business tools\n\n**Offer:**\n- 30% commission on each sale\n- 30-day cookie tracking\n- Simple signup process\n- No country restrictions\n\nIf you have an audience and want to earn passive income promoting a **niche tool with zero competition**, DM me and I’ll send you the signup link.\n\nThis is ideal for creators, small SaaS founders, or anyone with an audience interested in productivity.\n\n*Let’s grow together — DM me to get started.*",
    "url": "https://reddit.com/r/digital_marketing/comments/1n9ja34/looking_for_affiliates_30_commission_promoting_a/",
    "score": 0,
    "num_comments": 2,
    "date": "2025-09-05",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "walidarme",
    "upvote_ratio": 0.33
  },
  {
    "subreddit": "digital_marketing",
    "title": "15 minutes a week that made my SEO life easier",
    "text": "In my last company, I was so focused on the big SEO stuff like new content, backlinks, and keyword tracking. \n\nThe last thing I wanted to do was waste time doing small checks every Monday morning.\n\nBut after one bad incident where a broken redirect loop tanked a whole product category for almost a week, I forced myself to start a 15-minute Monday routine. \n\nNothing fancy. I just spent some time on SEMrush, checked Google Search Console, and scrolled through a few key pages on the site.\n\nAt first it felt useless. Honestly, I thought I was just wasting time. But over time, that boring routine started saving me. \n\nI caught duplicate meta tags before they spread across hundreds of pages. I noticed broken links the dev team missed. \n\nOne time I even spotted an accidental noindex tag before it cost us thousands in traffic.\n\nIt’s not exciting, but now it’s the one habit I’ll never skip. That boring 15-minute check is the reason our site stayed stable while competitors were scrambling.\n\nDo you",
    "url": "https://reddit.com/r/digital_marketing/comments/1nefpw6/15_minutes_a_week_that_made_my_seo_life_easier/",
    "score": 33,
    "num_comments": 16,
    "date": "2025-09-11",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Embarrassed_Tour8392",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "I think one of my co- founders is about to bail- idk how to feel.",
    "text": "A few weeks ago, I started a company with two other people. One was a colleague turned friend from our time in the trenches at a software company. \n\nThis one friend was later laid off. He’d gone through several interviews with various companies, but it’s been a year and he’s still outta work. Now, I understand the hardship that comes with going from mid 6-figures to unemployment running out. \n\nAfter about a year, he introduces me to another individual, after sharing my business vision. The three of us start working on smaller contracts, to test the waters. \n\nWell, happy to report it’s going well. In fact he was critical in helping us win our first decent size contract. It will give us breathing room, as well as a small runway to really kick things off, and invest into the company and ourselves. And as a result we are starting to formalize. And naturally we begin vetting software. \n\nToday, I was told by my friend that he’s interviewing at a company that may become a core software we use",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n2vt5a/i_think_one_of_my_co_founders_is_about_to_bail/",
    "score": 3,
    "num_comments": 13,
    "date": "2025-08-29",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Zealousideal_Tart308",
    "upvote_ratio": 0.68
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Exited Founder Seeding $150–200K: Looking for SaaS/AI Co-Founder",
    "text": "Hey all. This is a real pitch - not bogus, not a bot, not a scam. \n\nBackground: I founded and scaled a consumer brand from nothing to $150m - exited last year. I know brand, storytelling, strategy, and growth, and I bring a strong network in the CPG (consumer packaged goods) space.\n\nGoal: I want to seed a new SaaS/AI venture with the right partner. CPG is my natural starting point (I have a solid network here), but I’m open to other verticals if the pain is real - events, catering, healthcare, logistics, etc.\n\n⸻\n\nStructure\n\t•\t$150–200K seed committed (funded by me).\n\t•\t12-week build phase → MVP + traction.\n\t•\tIf we click → co-founder status (20–35% equity, vesting).\n\t•\tYear 1 runway funded.\n\n⸻\n\nExamples of Problems to Solve\n\t•\tAutomating sell sheets & retailer decks (CPG).\n\t•\tDistributor / trade show follow-up (CPG).\n\t•\tSales lead workflows for services (catering, dentists, B2B).\n\t•\tSMB workflow automation in industries still stuck on spreadsheets.\n\n⸻\n\nWho I’m Looking For\n\t•\tTechnical/",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n4sh1j/exited_founder_seeding_150200k_looking_for_saasai/",
    "score": 9,
    "num_comments": 17,
    "date": "2025-08-31",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "charlie-chicken",
    "upvote_ratio": 0.74
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "started my new AI automation agency, looking for first 10 projects",
    "text": "i just started my journey into building AI automation agency, helping businesses save time & money with AI workflows. numbers dont lie, 60% of repetitive work can be automated today with right tools. right now its just me and 1 partner, we are looking for our first 10 projects to prove ourselves. if any founder want to try, i can give discounted rates for initial clients.",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1mw915f/started_my_new_ai_automation_agency_looking_for/",
    "score": 2,
    "num_comments": 6,
    "date": "2025-08-21",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Electronic_Argument6",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Looking for feedback: 3-day “Opportunity & Innovation Sprint” concept for service-based businesses",
    "text": "I’m exploring a new concept and would love some community feedback.\n\nThe idea: a **3-day Opportunity & Innovation Sprint** to help service-based businesses quickly uncover growth opportunities and design a short-term innovation roadmap.\n\n**How it would work:**\n\n* **Day 1:** Understand the business model, market position, and current challenges\n* **Day 2:** Map quick wins, potential new revenue streams, and innovation opportunities\n* **Day 3:** Present a 90-day roadmap with actionable next steps\n\nI’m considering focusing on **tourism & hospitality**, **healthcare & wellness**, and **professional services**, as these are industries where I’ve seen high potential for quick, impactful change.\n\nWhat I’d love to hear from you:\n\n* If you’re in one of these industries, would this format be useful?\n* What would make a sprint like this more compelling or valuable?\n* Have you done something similar in your business, and what worked/didn’t work?\n\nI’m running a small beta to test and refine this pr",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1myq97u/looking_for_feedback_3day_opportunity_innovation/",
    "score": 2,
    "num_comments": 3,
    "date": "2025-08-24",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Singi98",
    "upvote_ratio": 0.76
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Grinding 60+ hours a week? Congrats, you’re killing your startup faster",
    "text": "Okay, can we please kill the whole \"work 100 hours a week or you don’t deserve sh\\*t\" mindset?\n\nBeen there, done that, got the burnout, and let me tell you, nobody’s handing out trophies for who sleeps the least. All I got was a destroyed social life, constant anxiety, and a product nobody (including me) cared about by the end.\n\nEveryone loves to post about hustle porn like it’s a badge of honor, but here’s the truth: you’re not building a rocket, you’re just wrecking your health, relationships, and frankly, your actual company. Founders burning themselves and their teams out are the #1 reason I’ve watched startups implode. Not market fit, not code, not lack of grit. Just people too fried to think straight.\n\nThere was this point where my productivity tanked after a few weeks of beast mode. My cofounder just straight-up quit because I was impossible to work with. We shipped bad product after bad product, running on caffeine instead of actual thought. I literally paid more for therapy th",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1ncjxik/grinding_60_hours_a_week_congrats_youre_killing/",
    "score": 14,
    "num_comments": 26,
    "date": "2025-09-09",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "MegaDigston",
    "upvote_ratio": 0.81
  },
  {
    "subreddit": "indiehackers",
    "title": "Exited founder seeding $200K — looking for SaaS/AI co-founder",
    "text": "Hey all. This is a real pitch - not bogus, not a bot, not a scam. \n\nBackground: I founded and scaled a consumer brand from nothing to $150m - exited last year. I know brand, storytelling, strategy, and growth, and I bring a strong network in the CPG (consumer packaged goods) space.\n\nGoal: I want to seed a new SaaS/AI venture with the right partner. CPG is my natural starting point (I have a solid network here), but I’m open to other verticals if the pain is real - events, catering, healthcare, logistics, etc.\n\n⸻\n\nStructure\n\t•\t$150–200K seed committed (funded by me).\n\t•\t12-week build phase → MVP + traction.\n\t•\tIf we click → co-founder status (20–35% equity, vesting).\n\t•\tYear 1 runway funded.\n\n⸻\n\nExamples of Problems to Solve\n\t•\tAutomating sell sheets & retailer decks (CPG).\n\t•\tDistributor / trade show follow-up (CPG).\n\t•\tSales lead workflows for services (catering, B2B).\n\t•\tSMB workflow automation in industries still stuck on spreadsheets.\n\n⸻\n\nWho I’m Looking For\n\t•\tTechnical/operator b",
    "url": "https://reddit.com/r/indiehackers/comments/1n4sd4l/exited_founder_seeding_200k_looking_for_saasai/",
    "score": 7,
    "num_comments": 7,
    "date": "2025-08-31",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "charlie-chicken",
    "upvote_ratio": 0.82
  },
  {
    "subreddit": "indiehackers",
    "title": "🚀 I built an AI tool that automatically generates job postings – looking for feedback!",
    "text": "Hi everyone,\n\nI’m currently working on a side project called **JPNJobGen**, an AI-powered tool that helps HR/recruiters create professional job postings in just a few clicks.\n\n# 🔧 What it does\n\n* Input basic info (company name, role, location, requirements)\n* AI generates a complete job posting in a clean, structured format (with PDF export)\n* Option to preview, edit, and download instantly\n\n# 🎯 Who it’s for\n\n* Small/mid-sized businesses without a dedicated HR team\n* Recruiters who want to save time writing repetitive job posts\n* Anyone hiring frequently and looking to standardize posting formats\n\n# 📌 Current stage\n\n* I’ve built an MVP using Softr + Make + Google Docs template.\n* Working on PDF generation + subscription model.\n* Looking for testers who can try it and give me honest feedback.\n\n👉 Web demo: [https://jpnjobgen-raleigh24457.softr.app/]()  \n👉 GPT Store version: [https://chatgpt.com/g/g-68b167f5c6b0819196f954c24cc911b1-qiu-ren-piao-ai-hetaban](https://chatgpt.com/g/g-68b167f5",
    "url": "https://reddit.com/r/indiehackers/comments/1n32psj/i_built_an_ai_tool_that_automatically_generates/",
    "score": 3,
    "num_comments": 7,
    "date": "2025-08-29",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Smartcore5566",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "How to get clients?",
    "text": "Hey folks,\n\nMe and my team have been building a Cluely-style AI overlay. Basically, it’s like having Stockfish in chess but for sales calls — the app listens in real time and, within <1 second, feeds you the best “next move” to handle objections, keep the convo flowing, and close deals.\n\nIt runs as a lightweight always-on-top overlay, so while you’re on Zoom/Meet, it discreetly suggests lines, objection handling, and context-aware responses. When you share your screen it becomes invisible. Infact, the ai is trained or the data of big marketing company.\n\nWe know social media reels/TikTok/LinkedIn will be a big push, but aside from that, how do you actually get clients for something like this?\n\nWhere would you go to find early adopters (founders, SDRs, hustlers)?\n\nHow would you approach selling this without being spammy?\n\nShould we be doing beta invites, cold outreach, or more community posting?\n\nAlso — if anyone here is curious to try it out or just give feedback, DM me. Always down to ",
    "url": "https://reddit.com/r/microsaas/comments/1n7fyb6/how_to_get_clients/",
    "score": 2,
    "num_comments": 24,
    "date": "2025-09-03",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Old-Butterfly-1623",
    "upvote_ratio": 0.67
  },
  {
    "subreddit": "web_design",
    "title": "How do you deal with last-minute design changes mid-build?",
    "text": "Hey guys!\n\nSomething I’ve noticed over time: no matter how polished the designs are, changes almost always come once development is underway (which is totally normal) A stakeholder rethinks a flow, the client wants “just one more thing,” or the team catches something that feels off only once it’s interactive.\n\nSince most of our work is taking finalized Figma designs and building them into production-ready web apps, we run into this a lot. We try to stay flexible so iterations don’t derail timelines, but there’s always a balance between speed, scope, and keeping the workflow intact.\n\nFrom the design side, I’m curious:\n\nHow do you usually handle it when changes land mid-build? Do you push back? Redesign quickly? Negotiate scope?\n\nAnd how do you manage that with the devs you’re working with, without completely breaking their workflow or blowing up the scope?\n\nWould love to hear how you balance keeping momentum while still protecting the project from spiraling out of control:) Maybe it'll ",
    "url": "https://reddit.com/r/web_design/comments/1mtoi0z/how_do_you_deal_with_lastminute_design_changes/",
    "score": 1,
    "num_comments": 17,
    "date": "2025-08-18",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "No_Cryptographer7800",
    "upvote_ratio": 0.56
  },
  {
    "subreddit": "projectmanagement",
    "title": "When your PM boss turns into a \"yes man\" for execs — how do you manage the fallout?",
    "text": "I'm in a bit of a weird spot and would love to hear how others might deal with this.\n\nMy direct manager, who also heads the Project Management department for a tech manufacturing company, has gradually turned into a full-blown *yes man* for the CEO/CMO over the last 8–10 months.\n\nIt started subtly, but now he's taking on projects that are *completely* out of our department’s scope — no proper resources, no systems, no tools, no processes — just unrealistic timelines and executive pressure. And he’s not pushing back or even raising the obvious resourcing issues with upper management. It's like he's afraid to rock the boat because he's now in their good books.\n\nSo what happens? Everything trickles down to my small team of 3. We’re constantly under pressure, doing hands-on tasks we shouldn't be responsible for, just to keep things from falling apart. I’m literally walking over to other departments and asking (begging?) people to execute tasks that are way outside our control. It’s irritat",
    "url": "https://reddit.com/r/projectmanagement/comments/1mwzvvs/when_your_pm_boss_turns_into_a_yes_man_for_execs/",
    "score": 72,
    "num_comments": 28,
    "date": "2025-08-22",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Row_Exciting",
    "upvote_ratio": 0.99
  },
  {
    "subreddit": "projectmanagement",
    "title": "As PM are you looking for free software because you don't like what you're using now?",
    "text": "I have repeatedly seen within the channel where Project Manager’s are looking for “free project management software” for their organisation or company because they just don’t like what they’re using? The reality is free software doesn’t exist, there are always a cost overhead to an organisation or company.\n\nSoftware is never free because the product has to be hosted, technically supported, training and including on the going training, licensing and corporate administration which all requires effort which has an associated cost. Also when products are offered as “free”, they’re generally in the BETA testing phase, the developers are generally leveraging their end users as “free testers”. People and companies don’t just develop applications because they want to, they want to make money from their products and will eventually lead to the licensing of the product and you have been inadvertently bound to a product financially especially if it doesn’t do everything you want it to do.\n\nFirstl",
    "url": "https://reddit.com/r/projectmanagement/comments/1n4m6cm/as_pm_are_you_looking_for_free_software_because/",
    "score": 0,
    "num_comments": 10,
    "date": "2025-08-31",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "More_Law6245",
    "upvote_ratio": 0.39
  },
  {
    "subreddit": "sales",
    "title": "Exploring next steps beyond SDR; looking for real-world examples",
    "text": "I’ve realized that strictly cold-calling roles just aren’t sustainable for me anymore. I’ve always performed well…consistently hitting quota… but the grind puts my body in constant fight-or-flight, and it’s clear it’s not something I can keep doing long-term. Hard to describe the way it feels, but it aint good.\n\nThat said, I want to use this as an opportunity to figure out what’s possible for someone in my position. I know I’m strong at being consultative: listening, understanding challenges a prospect/company is facing, and helping match them with a solution. I’ve also closed business before — I’m definitely a salesman when it comes time to put pen to paper — but I’m not naturally a pushy person, which makes pure cold-calling roles a poor fit. (Don’t mind doing it here and there).\n\nFor those of you who’ve made the jump away from SDR/BDR, what roles did you pivot into? Account Management? CSM? Partnerships? Sales Enablement? Something outside SaaS altogether?\n\nMy background so far is i",
    "url": "https://reddit.com/r/sales/comments/1n6so1t/exploring_next_steps_beyond_sdr_looking_for/",
    "score": 6,
    "num_comments": 24,
    "date": "2025-09-02",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "UnderstandingMean932",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "sales",
    "title": "Looking for feedback on my idea: Is this a sales tool or just AI-flavored BS?",
    "text": "Instead of another CRM, outreach tool, or pipeline widget, what if your content had its own sales enablement?\n\nThink of it as your personal sales intern:\n\n* Takes your technical product (sensors, actuators, semiconductors, whatever widget your engineers worship) and target market.\n* Figures out who actually cares and why (applications, markets, pain points, trade offs).\n* Outputs the stuff you normally don’t have time for:\n   * Customer-specific sales narratives (value, not features).\n   * Application briefs and one-pagers that sound like you did the homework.\n   * Inputs for sales slides and battlecards\n   * Application insights that gives an industry veteran to think\n   * Customer profiles\n\nBasically: most tools help you manage the process. This one helps you produce the ammo.... Content that shortens pitch cycles and makes engineers sound like experts in any new customer application (without making them puke).\n\nTarget users: sales engineers, product managers, technical marketers, bu",
    "url": "https://reddit.com/r/sales/comments/1nehmp0/looking_for_feedback_on_my_idea_is_this_a_sales/",
    "score": 6,
    "num_comments": 15,
    "date": "2025-09-11",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "growthbeaver",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "accounting",
    "title": "26 y/o graduating soon, need help/advice on internship offer",
    "text": "Hello all,\n\nReposting since my post earlier didn’t get much traction, sorry in advance.\n\nI’m a career changer coming from an unrelated undergrad and finishing up my MSA in December of this year and will be CPA eligible. I recently started a position last month as a staff accountant in the DMV area. It’s my first accounting role and I’m enjoying the work, the team and the company. I do think that because it’s a smaller team, the room for growth could be limited. \n\nI received an offer from CohnReznick for an audit internship for this upcoming busy season. I would like the opportunity as I think it would provide more resources and room to grow, but I’m having concerns of leaving my full-time job for just an internship. Even if I received a return offer, at the earliest it would be in the fall of next year, meaning I’m out of work for months. \n\nI guess I’m just seeking other’s advice on what they would do in this situation. Would you take the internship? Also, doesn’t only 5 months or so w",
    "url": "https://reddit.com/r/Accounting/comments/1n2mk8w/26_yo_graduating_soon_need_helpadvice_on/",
    "score": 5,
    "num_comments": 9,
    "date": "2025-08-28",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "Fabulous-Chocolate24",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "excel",
    "title": "Power query: alternative to \"group by\"",
    "text": "So I have a data set where there are multiples of two parameters\n\n(project name, cost type)\n\nin the other columns I have costs (all numbers)\n\nI want to summize (? sum)  all the duplicates, but without having to configure 50 columns like you do in \"group by\".\n\nI have thought of unpivot> pivot but that doesn't seem to work\n\nin another thread i came across this: List.Transform(ColumnList, (col) => {col, each List.Sum(Record.Field(_, col)), type number})\n\nbut those formulas I have trouble learning.\n\nanyone has a workable solution?/ a bit of an explanation of the solutions above?\n\nExcel version: Office 365",
    "url": "https://reddit.com/r/excel/comments/1n6l5u4/power_query_alternative_to_group_by/",
    "score": 7,
    "num_comments": 8,
    "date": "2025-09-02",
    "commercial_score": 8,
    "category": "missing_features",
    "author": "silentanthrx",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "shopify",
    "title": "Need Help Diagnosing a 70% Checkout Abandonment Rate on a Personalised Product Store (Data Inside)",
    "text": "Hi everyone,\n\nI'm hoping to get some expert eyes on a persistent checkout issue I've been facing for quite some time. My store sells personalised jewellery that requires customers to upload a photo using a third-party app (currently UploadKit, but previously Upload-Lift).\n\n**The Core Problem:** I have a universal checkout abandonment rate of around 70%, and my data shows it's significantly worse for my US customers.\n\n**My Data Analysis (12-Month Period):**\n\n* **Overall Checkout Abandonment:** \\~70% across all browsers.\n* **US vs. UK Checkout Abandonment:** The rate for my US customers is **\\~73%**, while for UK customers it's much lower at **\\~53%**.\n* **Top of Funnel is Working:** My ads are performing well, with a high Add to Cart rate (**7.9%** from Meta traffic), so I'm confident the issue is in the checkout process itself.\n\n**What I've Already Ruled Out:**\n\n* **Surprise Shipping Costs:** I offer free shipping.\n* **Payment Processor:** The issue persisted even after I switched from",
    "url": "https://reddit.com/r/shopify/comments/1muzd1q/need_help_diagnosing_a_70_checkout_abandonment/",
    "score": 3,
    "num_comments": 9,
    "date": "2025-08-19",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "stats1101",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "googlesheets",
    "title": "Looking for a monthly budgeting spreadsheet tailored for a car detailing business",
    "text": "Hey everyone 👋\n\nI’m looking for a simple but functional monthly budgeting spreadsheet that’s specifically tailored for a **car detailing business**.\n\nMost spreadsheets I’ve come across so far are focused on **personal finance** (savings, living expenses, etc.), but what I need is something that works for the **business model of car detailing**.\n\nFor example, something that can track:\n\n* expenses for chemicals and consumables\n* rent and utilities\n* marketing budget\n* number of clients and revenue per package (e.g. interior detail, polishing, ceramic coating…)\n* monthly profit/loss\n\nIf anyone already has a template they’re using, I’d really appreciate it if you could share. If not, even a more general small business spreadsheet that can be easily customized would be great.\n\nThanks in advance! 🙏",
    "url": "https://reddit.com/r/googlesheets/comments/1n98hdj/looking_for_a_monthly_budgeting_spreadsheet/",
    "score": 0,
    "num_comments": 2,
    "date": "2025-09-05",
    "commercial_score": 8,
    "category": "general_frustration",
    "author": "EveryBridge3377",
    "upvote_ratio": 0.5
  },
  {
    "subreddit": "Entrepreneur",
    "title": "How do you get your first clients as a freelancer?",
    "text": "Hey everyone,\n\nI’m a freelance web developer and I’m trying to start selling websites to small businesses and individuals. I’m still in the early stages and was curious about how you guys landed your very first clients.\n\nDid you find them through platforms like Upwork/Malt/Fiverr, by reaching out directly (cold emailing/calling), or maybe through personal connections? I’d really appreciate hearing about your experiences, what worked, what didn’t, and any advice you’d give to someone just starting out.\n\nThanks a lot in advance!",
    "url": "https://reddit.com/r/Entrepreneur/comments/1n5c9qg/how_do_you_get_your_first_clients_as_a_freelancer/",
    "score": 27,
    "num_comments": 51,
    "date": "2025-09-01",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "Lightwolf455",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "Entrepreneur",
    "title": "I need help/advice",
    "text": "I am a solo “non” tech founder that has been working on the same project for 8 months. I have been attempting to make a large scale web app with many complex features but my site is NO WHERE near ready for production.\n\nI am not a coder/dev.\n\nI am a visionary and I have an unlimited amount of mental energy to dump into a purposeful project.\n\nI am great at envisioning systems that can give value to many people and parties.\n\nI also have lived in a rural farm town of 1300 my whole life. This has made a huge void in me that craves and desires more purposeful conversations, objectives, and goals.\n\nI am made to do great things way bigger than myself and I am unsure how to go about it. I have no connections regarding tech people or any wealth. \n\nWhat do you all recommend? \n\nI want to be a visionary of a huge team to create projects that are huge and will fulfill my missing pieces.\n\nAny responses are highly appreciated!",
    "url": "https://reddit.com/r/Entrepreneur/comments/1mz3mma/i_need_helpadvice/",
    "score": 2,
    "num_comments": 26,
    "date": "2025-08-24",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Dalt_the_investor",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "startups",
    "title": "Lost in B2B sales, looking for advice - I will not promote",
    "text": "Hey hiveminds, I started a B2B SaaS 6 months ago with my friend, before that I was running a similar service side hustle on my own. Since the product is launched, we have kept bumping into sales troubles. I’d like to share you with my story and gather some feedback that we can try differently.\n\nThings we’ve tried but didn’t work for us:\n\n- We worked with couple sales and marketing coaches, we learnt the foundations of enterprise sales but none of coaches provides hands-on support but only thesis… we didn’t see any value and stopped working with them at the end.\n\n- We had tractions with big companies and executives, but the deals fell apart because of procurement and office politics.\n\n- Outbound email campaigns in a new market. We didn’t really understand how to run a email campaign and engaged with a freelancer, it didn’t end up working.\n\n- Engage with a high-profile startup advisor who has connections to ICPs and VCs. It ends he hasn’t delivered any introduction and we had to buy him ",
    "url": "https://reddit.com/r/startups/comments/1n1f1zp/lost_in_b2b_sales_looking_for_advice_i_will_not/",
    "score": 37,
    "num_comments": 36,
    "date": "2025-08-27",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "lyingondabitch",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "startups",
    "title": "Took the leap to start my business – looking for advice and hearing your stories (I will not promote)",
    "text": "Hey everyone,\n\n\n\nI’m 26 and recently took the leap to start my own business. I left a job I really didn’t enjoy because I wanted to finally pursue something I’m passionate about and see a future in.\n\n\n\nMy girlfriend and I are saving for a house and our future together, and while she’s been amazing and supportive, I feel a bit guilty about putting her in this position. I was earning more than her before, but now I’m trading steady pay for the chance of a bigger return down the road. Thankfully, she’s been great with saving and we’re still in a good spot, but I can’t help feeling like I’m slowing us down by not contributing as much as before.\n\n\n\nI see two possible paths ahead:\n\n\n\n1) Things work out faster than expected and I can keep growing without needing another job.\n\n\n\n2) I build a strong foundation this year, run out of money while figuring things out, and go back to a steady paycheck. But at least this time I’d have more clarity, a head start, and the ability to keep growing the bu",
    "url": "https://reddit.com/r/startups/comments/1nfa4qt/took_the_leap_to_start_my_business_looking_for/",
    "score": 3,
    "num_comments": 9,
    "date": "2025-09-12",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "johnnykar13",
    "upvote_ratio": 0.81
  },
  {
    "subreddit": "smallbusiness",
    "title": "Anyone else feel like they accidentally became a babysitter instead of a leader? How do you get your team to own their stuff?",
    "text": "I started my business to build something meaningful, but somehow I've become the person everyone runs to for every little decision. It's like being a parent to a bunch of grown adults - they won't make a move without checking with me first.\n\nAnyone else been stuck in this 'management trap'? How did you shift from being the go-to person for everything to actually having a team that takes ownership? Looking for real-world stories, not textbook answers.",
    "url": "https://reddit.com/r/smallbusiness/comments/1n8nmqt/anyone_else_feel_like_they_accidentally_became_a/",
    "score": 59,
    "num_comments": 43,
    "date": "2025-09-04",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Realistic_Row8898",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "smallbusiness",
    "title": "Need help finding a solid barbershop POS system",
    "text": "I’ve been running my barbering business for a while now and I’m finally looking to upgrade how we handle POS, scheduling, and overall shop operations. I currently use a POS and Google sheets for the rest but looking to combine everything into one software.\n\nFeatures I’m looking for:\n\n* A booking system that lets me my schedule\n* A way to keep track of returning clients and what services they get\n* Appointment reminders\n* Reports that show me how my business is doing\n* POS fees that isn't as expensive as Square\n\nSo far I’ve looked at:\n\n* Square: I currently use them for payments. But their rate is very high and have a lot complaints about scheduling and admin features.\n* Vagaro: Many features I'm looking for, but I don’t how it works specifically for barbershops.\n* Squire: They say their made for barbers but I heard their fees are also on the higher side.\n\nI’m not in a rush, but I want to make the right call soon. Also open to other suggestions if there’s something better I’m overlookin",
    "url": "https://reddit.com/r/smallbusiness/comments/1mr8u1g/need_help_finding_a_solid_barbershop_pos_system/",
    "score": 7,
    "num_comments": 26,
    "date": "2025-08-15",
    "commercial_score": 7,
    "category": "scaling_issues",
    "author": "accountibillabuddy",
    "upvote_ratio": 0.9
  },
  {
    "subreddit": "smallbusiness",
    "title": "Do you think college is necessary for starting a business in 2025?",
    "text": "I’ve been thinking a lot about this lately. On one hand, college gives you structure, a network, and credibility. On the other hand, with so many resources online, like courses, communities, mentorships, and now AI tools, it feels like you could skip the degree and dive straight into building.\n\nFor those of you who’ve started businesses (or are in the process), did college play a role in your success? Do you feel it gave you a real advantage, or would you have been fine without it? Looking for everyones opinions, especially as 2025 brings even more alternatives to traditional education.",
    "url": "https://reddit.com/r/smallbusiness/comments/1nfcjto/do_you_think_college_is_necessary_for_starting_a/",
    "score": 25,
    "num_comments": 66,
    "date": "2025-09-12",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Th3bus1nessbr0",
    "upvote_ratio": 0.84
  },
  {
    "subreddit": "ecommerce",
    "title": "Looking for China 3pl for small e-commerce. Anyone ever heard of cfulfillment or has a good suggestion?",
    "text": "**OR based in any other country with low europe & canada shipping costs.**\n\nI am a small e-commerce shop with small volume (under 100/month) looking for a 3pl from china to ship internationally (I'm in Brazil and shipping here is $28 to anywhere, way too expensive).\n\nSmall items weighing 10grams.\n\nI found this one called cfcfulfillment that claims to have no minimums but I've not seen them mentioned anywhere. Anyone knows if they're good? Or has another suggestion?\n\nI only need no MOQ with cheap monthly storage & good shipping prices. Anything else is a bonus.",
    "url": "https://reddit.com/r/ecommerce/comments/1n2elow/looking_for_china_3pl_for_small_ecommerce_anyone/",
    "score": 10,
    "num_comments": 19,
    "date": "2025-08-28",
    "commercial_score": 7,
    "category": "cost_problems",
    "author": "Lithmariel",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "Looking for CRM/Order Management Recommendations for Hybrid Shopify + B2B Sales",
    "text": "Hey all,\n\nI run a small packaging supply business (jars and other supplies) selling to cannabis dispensaries, cultivators, and related businesses. Right now, our setup is a mix of:\n\nEcommerce: Customers order through our Shopify store.\n\nB2B direct sales: We do outreach, handle orders via spreadsheets, and bill manually outside Shopify.\n\n\nThe issue: Shopify works fine for ecommerce orders, but we don’t have a good way to manage sales pipelines, outreach, offline orders, and billing all in one place. Basically, we’re missing a CRM or order management system that ties it all together.\n\nIdeally, we’d like something that:\n\nIntegrates with Shopify for ecommerce orders\n\nLets us manage direct B2B sales (quotes, invoices, account tracking)\n\nSyncs or plays nicely with accounting (QuickBooks, Xero, etc.)\n\nIsn’t insanely expensive for a small but growing business\n\n\nHas anyone else dealt with this hybrid ecommerce/B2B model? What CRMs or systems would you recommend?\n\nThanks in advance!",
    "url": "https://reddit.com/r/ecommerce/comments/1na7d6s/looking_for_crmorder_management_recommendations/",
    "score": 5,
    "num_comments": 9,
    "date": "2025-09-06",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "anduril79",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "shopify",
    "title": "Looking for CRM/Order Management Recommendations for Hybrid Shopify + B2B Sales",
    "text": "Hey all,\n\nI run a small packaging supply business (jars and other supplies) selling to cannabis dispensaries, cultivators, and related businesses. Right now, our setup is a mix of:\n\nEcommerce: Customers order through our Shopify store.\n\nB2B direct sales: We do outreach, handle orders via spreadsheets, and bill manually outside Shopify.\n\n\nThe issue: Shopify works fine for ecommerce orders, but we don’t have a good way to manage sales pipelines, outreach, offline orders, and billing all in one place. Basically, we’re missing a CRM or order management system that ties it all together.\n\nIdeally, we’d like something that:\n\nIntegrates with Shopify for ecommerce orders\n\nLets us manage direct B2B sales (quotes, invoices, account tracking)\n\nSyncs or plays nicely with accounting (QuickBooks, Xero, etc.)\n\nIsn’t insanely expensive for a small but growing business\n\n\nHas anyone else dealt with this hybrid ecommerce/B2B model? What CRMs or systems would you recommend?\n\nThanks in advance!",
    "url": "https://reddit.com/r/shopify/comments/1na606o/looking_for_crmorder_management_recommendations/",
    "score": 5,
    "num_comments": 11,
    "date": "2025-09-06",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "anduril79",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "indiehackers",
    "title": "Here’s how to get your first 2000 users (anyone can do this)",
    "text": "Growing an app doesn’t require you to be extremely smart, you just need to work your ass off, and here is the exact blueprint you need to follow to guarantee you hit your first 2000 users within a month.\n\nI am a 4 year experienced developer that has developed and grew 4+ apps with 30,000 users combined, and if you’re thinking that I got these users right away you could not be more wrong. \n\nI had 25 users in my first month, 800 users in 2 months, and trust me I was in your shoes. I could build apps but I was absolutely TERRIBLE at marketing, and here is a blueprint that anyone can follow to grow their app. My newest app is called [reconnectx.org](http://reconnectx.org) and it hit 5000 users in its second month.\n\nSocial Media Strategy\n\n* Post on Twitter to reach interested audiences\n* Post reels that target your niche on Instagram \n* Post Tiktok reels that target your niche\n* Post on facebook groups to people who would use your product\n* Post on Hacker News\n\nReddit Strategy\n\n* Post on r/",
    "url": "https://reddit.com/r/indiehackers/comments/1neyb8u/heres_how_to_get_your_first_2000_users_anyone_can/",
    "score": 52,
    "num_comments": 23,
    "date": "2025-09-12",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "Proof_Ad_232",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "webdev",
    "title": "Would anyone be interested in an alternative to Outscrapper or Grapeleads?",
    "text": "I'm curious if there's appetite for a competitor. I've been dabbling with a concept to build but was curious if there's even a pain point. Not going to waste my time otherwise.\n\nDo you use any service to find businesses without websites? \nHow often / how much? \nWhat's missing from existing solutions?\nWhat's annoying or unnecessary? \nWhat feature would you love added that doesn't exist?  ",
    "url": "https://reddit.com/r/webdev/comments/1n49urz/would_anyone_be_interested_in_an_alternative_to/",
    "score": 0,
    "num_comments": 6,
    "date": "2025-08-30",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Chritt",
    "upvote_ratio": 0.5
  },
  {
    "subreddit": "projectmanagement",
    "title": "When a project grows into a program",
    "text": "I joined a project that I thought was just large, but after a few weeks it turned out to have multiple workstreams, dependencies everywhere, and stakeholders with very different expectations. I didn't change the job title, but I started treating it as a program: a single roadmap visible to the whole team, clear owners on each stream, and a short sync focused only on dependencies. At the same time, I changed how we handled procurement. By using Scanmarket from Unit4 I was able to centralize RFQs and documentation, without wasting time chasing scattered versions and endless emails.\n\nIt also made a big difference for management visibility. Instead of presenting fragments and partial tables, I could show a unified view of progress, which reduced a lot of contradictory discussions. The team understood the bottlenecks faster, and stakeholders saw that even if the project was more complex than it looked at first, there was a clear framework keeping everything under control.",
    "url": "https://reddit.com/r/projectmanagement/comments/1negwce/when_a_project_grows_into_a_program/",
    "score": 16,
    "num_comments": 6,
    "date": "2025-09-11",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Traditional-Swan-130",
    "upvote_ratio": 0.9
  },
  {
    "subreddit": "sales",
    "title": "Best ZoomInfo alternatives for enriching Salesforce accounts?",
    "text": "I work at a large company where ZoomInfo is usually the default choice for anything related to data enrichment. No doubt it’s powerful, but I’m starting to question whether it really fits what we actually need right now. There might be zoominfo alternatives that fits more my needs.\n\nMy main goal is to enrich our top accounts inside Salesforce with the right info: firmographics, decision-maker contacts, and maybe a bit of buying intent just enough for our sales and KAM teams to go in sharp and well-prepared.\n\nI’m not super plugged into sales ops doing this kind of work, so it’s hard to tell if I’m just overthinking or not\n\nCurious what you all think. Is ZoomInfo still your go-to for outbound, or have you moved to something that’s more tailored to specific needs.",
    "url": "https://reddit.com/r/sales/comments/1nfa931/best_zoominfo_alternatives_for_enriching/",
    "score": 25,
    "num_comments": 22,
    "date": "2025-09-12",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "Affectionate_Cell954",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "accounting",
    "title": "I HATE MY J*B",
    "text": "I’m glad I’m quitting this j*b and leaving to go to a better one. I tried to be grateful cause I understand people are struggling to find work, but holy sh** this place is a dump. My manager said in a meeting that this was a sh**show. I’m tired of my coworker thinking she’s smart, when she can’t even do journal entries. It’s asking me a question every 10 FUCKING MINUTES. I’m tired of the office admins trying to help me when they just make things worse. Always saying incorrect information to clients after I’ve calmed them down. I’m tired of our sales department selling incorrect services. IM TIRED OF PEOPLE THINKING IM FRONT DESK WHEN IM THE LEAD. I’m tired of the shitty PTO and sick time that I have had to move my exam multiple times to be able to even get PTO. IM SO DONE. Good luck to this department since they rely on me for everything!!!!",
    "url": "https://reddit.com/r/Accounting/comments/1nf6iek/i_hate_my_jb/",
    "score": 68,
    "num_comments": 30,
    "date": "2025-09-12",
    "commercial_score": 7,
    "category": "scaling_issues",
    "author": "Vegetable_Tailor8858",
    "upvote_ratio": 0.75
  },
  {
    "subreddit": "bookkeeping",
    "title": "How to create a mutual referral source as a CPA",
    "text": "Hi, would yall have any advice from a bookkeeper’s perspective, how they might take a CPA reaching out to them for referrals? What would their incentive be? \n\nI’m a Tax Professional, going all in and starting my own practice. I’ve reached out to 10-15 local bookkeeping shops I’ve found on Google and set up discovery calls for referral sources. The way I see it, while I don’t spend my time doing bookkeeping day to day, I understand GAAP and Tax Law very well and will be able to “review” the bookkeeping work at tax filing, and also advise the client to more work opportunities for the bookkeeper (payroll, different processes, etc.). Am I way off? ",
    "url": "https://reddit.com/r/Bookkeeping/comments/1n8uan5/how_to_create_a_mutual_referral_source_as_a_cpa/",
    "score": 11,
    "num_comments": 35,
    "date": "2025-09-05",
    "commercial_score": 7,
    "category": "automation_needs",
    "author": "New-Geologist-5003",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "shopify",
    "title": "Looking for CRM/Order Management Recommendations for Hybrid Shopify + B2B Sales",
    "text": "Hey all,\n\nI run a small packaging supply business (jars and other supplies) selling to cannabis dispensaries, cultivators, and related businesses. Right now, our setup is a mix of:\n\nEcommerce: Customers order through our Shopify store.\n\nB2B direct sales: We do outreach, handle orders via spreadsheets, and bill manually outside Shopify.\n\n\nThe issue: Shopify works fine for ecommerce orders, but we don’t have a good way to manage sales pipelines, outreach, offline orders, and billing all in one place. Basically, we’re missing a CRM or order management system that ties it all together.\n\nIdeally, we’d like something that:\n\nIntegrates with Shopify for ecommerce orders\n\nLets us manage direct B2B sales (quotes, invoices, account tracking)\n\nSyncs or plays nicely with accounting (QuickBooks, Xero, etc.)\n\nIsn’t insanely expensive for a small but growing business\n\n\nHas anyone else dealt with this hybrid ecommerce/B2B model? What CRMs or systems would you recommend?\n\nThanks in advance!",
    "url": "https://reddit.com/r/shopify/comments/1na606o/looking_for_crmorder_management_recommendations/",
    "score": 5,
    "num_comments": 11,
    "date": "2025-09-06",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "anduril79",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "googlesheets",
    "title": "Looking for a more detailed Sheets sorting solution.",
    "text": "Hey there! Hoping that someone might be able to guide me to a more elegant sorting solution for my 3d printing orders.\nI'm working on a 755 piece custom 3d print run with 2- 3d printers. Each piece has a base color and text color dropdown column with about 30 color options listed. (Soooo maaaany color combos) \nMy rows are currently sorted by the Base Color column (A-Z) first, and then the Text Color  column (A-Z). I've exasperated myself trying to figure out how to sort things further so that I can batch print more efficiently. \n\nEx. I'd like to be able to view and batch print all items with \nBase Color- Royal Blue + Text Color- Red \nat the same time with all \nBase Color- Red + Text Color- Royal Blue \n\nWhile not specifically sheets related, if there are other ways to sort/prioritize/automate things using 2 Printers that can print up to 4 colors at once, I'm all ears for that as well.\n\nThis is my first run, so I'm trying to streamline the workflow as much as possible for future and like",
    "url": "https://reddit.com/r/googlesheets/comments/1mxfiig/looking_for_a_more_detailed_sheets_sorting/",
    "score": 1,
    "num_comments": 10,
    "date": "2025-08-22",
    "commercial_score": 7,
    "category": "missing_features",
    "author": "i_makecoolstuff",
    "upvote_ratio": 0.66
  },
  {
    "subreddit": "PowerBI",
    "title": "How to ensure RLS doesn't get dropped",
    "text": "Hi all,\n\nI have a project where it's **extra critical that the RLS works as intended**.\n\nThe RLS itself is simple: **static RLS roles** (security groups). A few dim_tables filter all fact tables in the semantic model.\n\nHowever, it's crucial that the RLS doesn't get **unintentionally removed or broken** during the lifetime of the report and semantic model. Things that might happen:\n\n- The **RLS definition** gets dropped from a dimension table during alterations.\n- A **table relationship** gets dropped, causing the dimension table to no longer filter the fact table.\n\nHow can I minimize the risk of such errors occurring, or at least prevent them from being deployed to prod?\n\nWe're primarily using **Power BI Desktop** for semantic model and report development and **Fabric** with premium features.\n\n#RLS or separate semantic models?\nWould you recommend creating **separate semantic models** instead? We only have 5 static roles, so we could create separate semantic models (**filtered clones**)",
    "url": "https://reddit.com/r/PowerBI/comments/1n4uj2r/how_to_ensure_rls_doesnt_get_dropped/",
    "score": 0,
    "num_comments": 21,
    "date": "2025-08-31",
    "commercial_score": 7,
    "category": "automation_needs",
    "author": "frithjof_v",
    "upvote_ratio": 0.5
  },
  {
    "subreddit": "PowerBI",
    "title": "Need help with Data Modeling",
    "text": "Hi everyone. I'm working for an insurance company as a data analyst and I come in need of help in order to build a data model.\n\n  \nI currently have the following star schema:\n\nhttps://preview.redd.it/ldkjvcrjhrlf1.png?width=944&format=png&auto=webp&s=cc181543a1770dee1b773bd909d2cd02af6334f6\n\n  \nNow, the problem I'm having is when I introduce another fact table to the model:\n\nhttps://preview.redd.it/va1coxi3irlf1.png?width=1178&format=png&auto=webp&s=040510e187937d5bd10c870f970eadf529c83579\n\n  \nThe table fctProductionNumbers looks like this:\n\nhttps://preview.redd.it/drj4sbqiqrlf1.png?width=1383&format=png&auto=webp&s=0e0177f7e0c82ec6aea02f10b2211e7f367ee991\n\n\n\nAnd fctClaims looks like so:\n\nhttps://preview.redd.it/2wqsnjshqrlf1.png?width=1073&format=png&auto=webp&s=fbddbee927cf698e217ca85eb1ebb30b4dbf8bd7\n\n  \nThe granularity of fctProductionNumbers is at the policy level, whilst fctClaims is at the \"Coverage\\_Used\" level.\n\nIn other words, in fctProductionNumbers we have a unique row per ",
    "url": "https://reddit.com/r/PowerBI/comments/1n2dgfv/need_help_with_data_modeling/",
    "score": 2,
    "num_comments": 8,
    "date": "2025-08-28",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "vasHLoL",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "PowerBI",
    "title": "Power BI August 2025 Feature Summary",
    "text": "**Monthly Update**\n\nMicrosoft Power BI Updates Blog: [Power BI August 2025 Feature Summary](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/)\n\n* Some notable announcements:\n   * [Power BI DataViz World Championships](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/#post-30695-_Toc205561032) | [sub announcement](https://www.reddit.com/r/PowerBI/comments/1mii6nr/pbi_dataviz_world_champs_eu_edition/)\n   * [Copilot to write measure descriptions (Generally Available)](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/#post-30695-_Toc205561036) (more preview burndown!)\n   * [Support for org apps in Pro workspaces (Preview)](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/#post-30695-_Toc205561039)\n   * [TMDL view enhancements](https://powerbi.microsoft.com/en-us/blog/power-bi-august-2025-feature-summary/#post-30695-_Toc205561041)\n   * [Semantic Model Refresh Templates with Fa",
    "url": "https://reddit.com/r/PowerBI/comments/1moedfr/power_bi_august_2025_feature_summary/",
    "score": 88,
    "num_comments": 80,
    "date": "2025-08-12",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "itsnotaboutthecell",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "PowerBI",
    "title": "Claude Code 🤝🏻 Power BI",
    "text": "Any else using Claude code (or codex/gemini cli) in your power bi workflows?\n\nI had a big AHA moment this week. I realized Claude code can edit tmdl files easily thus getting access to all the Dax and queries in your power bi project (if using .pbih). I had already been using git to track my project changes in detail and effectively create a better “undo” button. But using a CLI to edit tmdl files is a GAME CHANGER. This is different than just connecting to an MCP and letting an llm try to generate analysis from your existing semantic model. This helps you build and edit your model - fast.\n\n\nWorkflow:\nI basically just tell Claude code to scan through my entire pbi model and create some documentation of the structure. It creates some Quick reference files for every single table, calculated column, and measure, etc. what’s connected to what both in .json and plain language markdown files. Give it a token limit like <50k if your model is reallly big or tell it to ignore certain tables.\n\nT",
    "url": "https://reddit.com/r/PowerBI/comments/1nf9nst/claude_code_power_bi/",
    "score": 62,
    "num_comments": 21,
    "date": "2025-09-12",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "prc41",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "PowerBI",
    "title": "How can I create relationship when I have multiple fact tables?",
    "text": "Hi Guys, I am fairly new to Powerbi trying to create a dashboard for my company.\n\nI've got 3 Tables:\n\n1. Summary Table : This table has majorly all the details of a physical item\n\n2. State Table : This table has sales data by region i.e Country, County, Item, Sales in Dollars, Sales in Units\n\n3. Customer Table : This table has sales data by customer i.e Customer Type, Customer Name\n\n\nNow all tables have sales numbers(facts) and have Item Number as a common tie between them.\n\nHow can I connect them together in such a way that I can cross pull data from each table.\n\nIF YOU SPARE TIME, I COULD ALSO SOME BACKGROUND UNDERSTANDING OF WHY WE DID WHAT WE DO TO GET IT STRAIGHT, SO NEXT TIME - ILL KNOW THE LOGIC BEHIND THE SOLUTION\n\nTHANKYOU FOR YOUR HELP!!",
    "url": "https://reddit.com/r/PowerBI/comments/1nf3kss/how_can_i_create_relationship_when_i_have/",
    "score": 15,
    "num_comments": 16,
    "date": "2025-09-12",
    "commercial_score": 7,
    "category": "integration_problems",
    "author": "swagshank5",
    "upvote_ratio": 0.78
  },
  {
    "subreddit": "Entrepreneur",
    "title": "I hate sales. How do I grow my business?",
    "text": "I'm a maker/builder at heart. I love creating the product and working with customers once they're signed up. But I absolutely dread the process of finding and selling to new customers. It gives me anxiety and I'm not good at it. For the other founders who hate sales, how did you get past this? Hiring sales person is not an option since I'm just starting out.",
    "url": "https://reddit.com/r/Entrepreneur/comments/1mp7sml/i_hate_sales_how_do_i_grow_my_business/",
    "score": 97,
    "num_comments": 124,
    "date": "2025-08-13",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "ingrid_diana",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "Entrepreneur",
    "title": "My skillset was replaced by AI. I'm physically disabled but mentally eager to work. I really need help coming up with plausible business ideas.",
    "text": "I hate admitting I need help, but I am desperate. I am a 32 y/o female who is physically disabled due to multiple botched kyphoscoliosis surgeries. I deal with pain unless I sit in a reclined/lying down position due to the curves in my spine. I could probably swing about 2.5-3 hours of \"on my feet\" time to build a business each day. I'm mentally well and crave mental stimulation, a job, my own money, and my own autonomy. I have applied to hundreds of remote jobs, but I lack a work history due to my medical history. Before AI became popular, I was doing okay as a freelance copyeditor and content writer; I had just graduated from a Master of Liberal Arts program with a 4.0, was halfway through a respected copyediting certificate program, had six regular clients, and was feeling confident in myself. Those clients disappeared over the course of a couple of months. I tried for months to land more clients, but the market became intensely competitive; plenty of folks with much more experience",
    "url": "https://reddit.com/r/Entrepreneur/comments/1ncul5v/my_skillset_was_replaced_by_ai_im_physically/",
    "score": 157,
    "num_comments": 118,
    "date": "2025-09-09",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "fluffyscrambledmeggs",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "Entrepreneur",
    "title": "Looking for feedback: I built an AI chatbot to help small businesses with customer support. Is this a common problem for you?",
    "text": "Hey everyone,\n\nI'm a co-founder working on a new project, and I'm in the early stages of trying to validate our idea. My business partner and I noticed that a lot of small businesses and startups don't have the budget or team to handle customer support 24/7, but they still get a lot of common questions.\n\nTo solve this, we built a really simple AI chatbot that can be installed on any website in minutes. It's designed to automatically answer repetitive customer questions, so the business owner can focus on other things.\n\nI'm posting here because I'd love to hear from this community. Is this a pain point you've experienced? What kind of features would be most helpful to you in a tool like this?\n\nAny feedback would be greatly appreciated. Thanks!",
    "url": "https://reddit.com/r/Entrepreneur/comments/1n4ze1r/looking_for_feedback_i_built_an_ai_chatbot_to/",
    "score": 0,
    "num_comments": 21,
    "date": "2025-08-31",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Amr_Zoher",
    "upvote_ratio": 0.22
  },
  {
    "subreddit": "startups",
    "title": "How do I hire the best first hires for my startup? I will not promote",
    "text": "I'm a solo-founder with a bootstrapped post-revenue startup. I've built the full product, marketed it, and generated revenue myself.\n\nOur main stack includes: typescript, NextJS, React, Tailwind over Vercel. While the product is already mature, I would like to hire some developers to take the development burden off me so I can concentrate more on getting clients and increasing our revenue. Hiring for startups is new to me, so I had some questions (maybe newbish, but pls help a fellow redditor):\n\n1. What should I look for in an ideal candidate? I don't want someone to just work for the paycheck. Of course, I'm willing to include equity upside as well, but I feel that the risk of having a wrong hire at this stage will be catastrophic.\n2. I feel I'm moving at a rapid velocity alone, but that's not sustainable in the long run. How can I ensure that hiring someone increases velocity as opposed to adding friction and grinding us to a halt?\n3. What timelines can I expect for joining if I star",
    "url": "https://reddit.com/r/startups/comments/1n92qk9/how_do_i_hire_the_best_first_hires_for_my_startup/",
    "score": 19,
    "num_comments": 49,
    "date": "2025-09-05",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "F_is_for_Frank",
    "upvote_ratio": 0.82
  },
  {
    "subreddit": "startups",
    "title": "How do I protect my idea? I will not promote",
    "text": "TLDR; Need suggestions on how to protect my idea if I share it with someone.\n\nI never really thought of a startup or app development per se, but I recently got an idea that I think would work if executed well. I have started working on it, and the initial development is about 70% done. However, the key feature what makes it unique/different is pending.\n\nI’m currently working on iOS development using Swift code. I have never worked with Swift, but have a bit of experience using Python, so I get by with Vibe coding. I can tell if the AI makes a mistake, and can fix it. It’s been great so far. What would’ve taken me more than a month, I was able to achieve in 10 days. \n\nComing to the point, as I see it, I will need additional resources to work on Android app, someone with Swift/Python + Data Engineering + ML experience.\n\nI am working on this as a side project during my free time. I can’t work on it full-time due to my visa restrictions. If I wanted to start a company, hire people etc, I w",
    "url": "https://reddit.com/r/startups/comments/1myowjw/how_do_i_protect_my_idea_i_will_not_promote/",
    "score": 0,
    "num_comments": 34,
    "date": "2025-08-24",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "everyday_indian",
    "upvote_ratio": 0.44
  },
  {
    "subreddit": "SaaS",
    "title": "Looking for early users to validate our SaaS growth analytics tool",
    "text": "Hey folks, We have been building **Roaarrr**, a growth analytics tool for SaaS teams that want clean, developer-first tracking without the bloat or the price tag of the usual suspects. Think of it as PostHog but leaner and cheaper. The idea is simple: track your funnel from awareness to retention in a way that is transparent, fast to implement, and actually affordable.\n\nRight now we are in beta and looking for teams who want to validate the product, Break it with real-world usage, tell us what is missing before we scale it further.\n\nIf you are running a SaaS and want to test it out (or just curious), here is the beta link: [https://www.roaarrr.app]()\n\nWe would love your feedback, good, bad, or brutal.\n\nThanks!",
    "url": "https://reddit.com/r/SaaS/comments/1nblbyt/looking_for_early_users_to_validate_our_saas/",
    "score": 5,
    "num_comments": 12,
    "date": "2025-09-08",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "marieeettoh",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "🚀 Looking for 2–3 people to start a SaaS business/agency with me (30-day learning & planning sprint, starts in the 1st week of september,2025)",
    "text": "Hey everyone! 👋\n\nI’m kicking off a **30-day SaaS business/agency learning sprint** starting **September 1st week** and I’d love to find **2–3 determined people** to join me.\n\nThe idea:\n\n* Create a **small, private Discord group** (friendly & supportive)\n* Spend **8–12 hours a week** learning SaaS, automation, and business models\n* Share resources, hold each other accountable, and brainstorm niche ideas\n* At the end of 30 days, start **building & offering real services** together\n* It’s **beginner-friendly** – no experience needed, just determination!\n\nWhat I’m looking for:\n\n* People who **understand basic English** (to communicate well)\n* Can commit a few hours weekly\n* Are genuinely interested in **SaaS, automation, AI tools, or online businesses**\n* Want to **learn and grow together** in a team setting\n\nIf this sounds like you, **drop a comment or DM me** for the Discord invite. Let’s turn this into something awesome 🚀",
    "url": "https://reddit.com/r/SaaS/comments/1n7hpzb/looking_for_23_people_to_start_a_saas/",
    "score": 0,
    "num_comments": 13,
    "date": "2025-09-03",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Sufficient-Mobile884",
    "upvote_ratio": 0.25
  },
  {
    "subreddit": "SaaS",
    "title": "I just crossed $1000 in revenue!!!",
    "text": "What happened in the last 3 months:\n\n1. Built the MVP in about 2 weeks of work.\n2. Launched the MVP on X and Reddit and immediately got 3 paying customers in a little over a week.\n3. Sales stalled for 2 weeks, and I had no idea why.\n4. Gathered all user feedback I could get and completely revamped and made the product 10x better than when it first launched.\n5. Started marketing again and reached 10 customers by the end of July.\n6. Went viral at the start of August and got a bunch of free trial signups, which some converted into paying customers. Continued that momentum until now to get 36 paying customers and $684 MRR.\n7. Recurring payments started to come in from much more frequently, which pushed me past the $1k revenue mark. Here’s a quick screenshot: https://imgur.com/a/XcEQc1k\n\nThe product is https://www.tydal.co which is a marketing tool that helps people get customers.\n I Learned a lot on how to talk to customers, get feedback, and iterate and improve based on it. Also been lear",
    "url": "https://reddit.com/r/SaaS/comments/1nf4s1b/i_just_crossed_1000_in_revenue/",
    "score": 52,
    "num_comments": 48,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Lopsided_Funny_6397",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "smallbusiness",
    "title": "Looking for a Virtual Assistant Agency $8 -15 per hour",
    "text": "Hey Reddit!\n\nBack in 2018 I worked with an agency that matched me with several VAs, and I ended up hiring an amazing Argentinian VA with a master’s degree for about $8/hr. I’m looking for something similar now for my Kintsugi business (12–20 hrs/month).\n\nTasks include: FAQs via Notion, messaging instructors, and prepping class docs. Must be comfortable with **Notion, Slack, Google Calendar, and Gemini**. Budget is **$10–$15/hr**.\n\nAny recommendations for agencies or independent VAs?",
    "url": "https://reddit.com/r/smallbusiness/comments/1mqo3rz/looking_for_a_virtual_assistant_agency_8_15_per/",
    "score": 0,
    "num_comments": 26,
    "date": "2025-08-15",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Comfortable_Way_4652",
    "upvote_ratio": 0.4
  },
  {
    "subreddit": "ecommerce",
    "title": "Looking for advice on how to form an LLC in TX? Is it possible or pipedream?",
    "text": "I’m based in Dallas and want to set up a small marketing agency, but the process feels overwhelming with all the forms, fees and legal steps. I’ve heard you can file directly through the Texas SOS website for around $300\\*. A friend mentioned LLC formation services that handle everything for you. Not sure if the extra cost is worth it.\n\nAlso curious about ongoing requirements like annual reports or franchise taxes. Anyone here gone through it recently?\n\n**Edit: Small update: Thanks for all the great input here! Hadn't given any thought to the compliance and filings side of things at all. Getting a bit of help and also checked out doola one option that was mentioned. Seems to be the easiest option.**   \n**Will update again if it ends up not being worth it** ",
    "url": "https://reddit.com/r/ecommerce/comments/1n2n3je/looking_for_advice_on_how_to_form_an_llc_in_tx_is/",
    "score": 21,
    "num_comments": 32,
    "date": "2025-08-28",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "em0297",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "ecommerce",
    "title": "Looking for advice on how to form an LLC in TX? Is it possible or pipedream?",
    "text": "I’m based in Dallas and want to set up a small marketing agency, but the process feels overwhelming with all the forms, fees and legal steps. I’ve heard you can file directly through the Texas SOS website for around $300\\*. A friend mentioned LLC formation services that handle everything for you. Not sure if the extra cost is worth it.\n\nAlso curious about ongoing requirements like annual reports or franchise taxes. Anyone here gone through it recently?\n\n**Edit: Small update: Thanks for all the great input here! Hadn't given any thought to the compliance and filings side of things at all. Getting a bit of help and also checked out doola one option that was mentioned. Seems to be the easiest option.**   \n**Will update again if it ends up not being worth it** ",
    "url": "https://reddit.com/r/ecommerce/comments/1n2n3je/looking_for_advice_on_how_to_form_an_llc_in_tx_is/",
    "score": 22,
    "num_comments": 32,
    "date": "2025-08-28",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "em0297",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "ecommerce",
    "title": "Sales Are Slow – What Would You Do Next?",
    "text": "Hi everyone,\n\nI run a small e-commerce store. I've spent the past few months making updates and trying to do everything “right” to get traffic and sales:\n\n* ✅ Updated SEO across the site (meta descriptions, alt-text, product titles)\n* ✅ Diversified product line\n* ✅ Post consistently on three platforms\n* ✅ Cleaned up the site for a better user experience\n\nThe challenge? Sales are still slower than I’d like. I don’t have a big budget right now, but if I *did* have more $$$ to spend — where would you recommend I put it for the best ROI?\n\n* Are there companies you’ve used to help market your store that were actually worth it?\n* Is this just “the state of the market” right now and patience is key?\n* Are there scrappy, low-cost strategies you’d recommend while I’m still bootstrapping?\n\nBasically — what would you do if you were in my shoes?\n\nThanks in advance for any insight!",
    "url": "https://reddit.com/r/ecommerce/comments/1nf6l1g/sales_are_slow_what_would_you_do_next/",
    "score": 12,
    "num_comments": 18,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Peachy1018",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "digital_marketing",
    "title": "How do you build brand awareness of a product on Instagram with low budget?",
    "text": "I am just starting in the world of marketing and not sure about the workflows, processes involved in growing brand awareness on social media without spending much money. Would really appreciate advice from people here could help me out with it  \n  \nIf you have any examples or personal stories, I’d love to hear them!",
    "url": "https://reddit.com/r/digital_marketing/comments/1n25z69/how_do_you_build_brand_awareness_of_a_product_on/",
    "score": 6,
    "num_comments": 17,
    "date": "2025-08-28",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "justdrissea",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "freelance",
    "title": "How to uphold motivation even when things go well?",
    "text": "When things go well, I earn more than on average for a short-time, I tend to tell myself I can now slack a bit because it went so well. How to keep working optimally regardless of results? \n\nI know that 100% efficiency is not the most sustainable goal, but there is probably a way to mentally reframe the goal to something more productive like if I think about milestones instead of efficiency, doing additional work means getting there faster, not just some number in an infinite process. Or if I don't aim for 100% but for 80% efficiency, it's also easier and I probably get more done than when aiming at 100% ",
    "url": "https://reddit.com/r/freelance/comments/1n706gq/how_to_uphold_motivation_even_when_things_go_well/",
    "score": 6,
    "num_comments": 11,
    "date": "2025-09-03",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "mushykindofbrick",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "freelance",
    "title": "What is your policy for rounding time spent on client projects?",
    "text": "I'm currently writing down standards of practice for my business (freelance graphic designer) and trying to see what the most common standard is across the board for rounding time spent on client projects for billing. So, without further ado, a few questions:\n\n• Do you round your time at all when tracking time spent on projects?\n\n• Do you round your time per project, or per client?\n\n• Do you round at the end of each day, each week, or when the project is finished?\n\n• How do you inform and explain to clients about your practices on rounding time?\n\nAny additional insight would be appreciated, thanks!\n\n",
    "url": "https://reddit.com/r/freelance/comments/1n0soz2/what_is_your_policy_for_rounding_time_spent_on/",
    "score": 11,
    "num_comments": 19,
    "date": "2025-08-26",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "AndrewHarnoisDesigns",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "freelance",
    "title": "What would you do when the client doesn't have a clear request?",
    "text": "Hi, I'm working as a part-time music producer on Fiverr.\n\nI've got some orders to produce music and doesn't find yet how I should deal with the situation the client doesn't have a clear request.\n\nFor example, a client wanted me to make a tropical house song. I asked them to send me some reference songs to make sure what they want. I got the reference songs from them but they say \"I like the songs but need to change something. Please just make somethings like them.\"\n\nTo make sure what \"something\" means, I asked them some questions like bright or dark, soft or hard, bouncing or stable, any specific sounds they liked in the reference songs. I didn't ask them about any music theory things like chord progressions or scales because I know they are not music professionals.\n\nAlthough their answer was \"Not sure. Just make a demo and I'll think about it later\". I had a bad feeling that they would ask me to change a lot after I made demos. But I couldn't ask them anything anymore so I made some d",
    "url": "https://reddit.com/r/freelance/comments/1mo039j/what_would_you_do_when_the_client_doesnt_have_a/",
    "score": 20,
    "num_comments": 26,
    "date": "2025-08-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "K-Frederic",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "freelance",
    "title": "most of your next clients are your past clients, i tested this and it’s kinda working",
    "text": "so I tried almost every freelancing platform out there. spent enough money on bids, time on proposals but didn’t land a single gig. maybe the market is too saturated. maybe someone else was offering the same job for dirt cheap.\n\neither way, nothing worked.\n\nso i did the one thing left, went back to my 5year old emails and just said “Hey, how’s business?” to every old client. no pitch. no selling. just genuine curiosity.\n\nslowly took the conversation to: “have you thought of improving this?”\n\na couple of them show some interest and asked me to elaborate.\n\nwell, no projects yet. but the conversations are back. the loop’s warming up again.\n\nso yeah, sometimes, you don’t need new people. just new thoughts with the old ones. \n",
    "url": "https://reddit.com/r/freelance/comments/1lapkn3/most_of_your_next_clients_are_your_past_clients_i/",
    "score": 65,
    "num_comments": 34,
    "date": "2025-06-13",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "100xdakshcodes",
    "upvote_ratio": 0.98
  },
  {
    "subreddit": "juststart",
    "title": "If you haven't vibecoded yet and are a non technical idea person... boy are you missing out.",
    "text": "I have built profitable businesses before, and there always came a time when I had ideas that I relied on devs to ship out since I was too lazy to learn how to code.\n\nHowever, this wasn't just expensive, it caused friction as there was sometimes lack of clarity between what I had in my head and what the dev was capable of doing.\n\nIn 2023, when AI first started popping off, I started copying and pasting code snippets, but that proved to be difficult so I kind of threw away the whole vibe coding thing.\n\nBut today...wow.\n\nIn just 1.5 hours, I made a fully functional web app, complete with a freemium rate limit, paid integration to my Stripe account, a beautiful UI/UX, all with just a few prompts. It even debugged security issues for me.\n\nI learned a TON in the process too: About Supabase, Resender, Google OAuth integration, rate limiting etc... stuff I as a non-technical idea guy would never have thought about.\n\nThis app has lived in my head as an idea for over 6 long months now, and I al",
    "url": "https://reddit.com/r/juststart/comments/1n9jv1o/if_you_havent_vibecoded_yet_and_are_a_non/",
    "score": 29,
    "num_comments": 89,
    "date": "2025-09-05",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "broseidonswrath",
    "upvote_ratio": 0.62
  },
  {
    "subreddit": "juststart",
    "title": "I'm building a tool site (month 8 update)",
    "text": "After somewhat sluggish growth during spring time, my tool site [terrific.tools](http://terrific.tools) is now firing on all cylinders.\n\nIn [my last update](https://www.reddit.com/r/juststart/comments/1l9166q/finally_managed_to_double_traffic_month_7_update/), I reported that it took me almst four months to double my traffic from 10k to 20k sessions / month, in large parts due to Google not sending any traffic.\n\nWell, that seems to slowly change. Google finally started to show terrific tools some love, which allowed me to add another 4k sessions (now 24k sessions / month) in traffic.\n\nGoogle remains the world's largest search engine by a wide distance, so for this tool site project to become a success, it's instrumental that Google thinks it's just as terrific as I do.\n\nRight now, most of my time is spend focusing on our newest product Genviral ([www.genviral.io](http://www.genviral.io)), so I did not invest a great amount of time into terrific tools.\n\nI've mostly just continued adding",
    "url": "https://reddit.com/r/juststart/comments/1m8t8rp/im_building_a_tool_site_month_8_update/",
    "score": 17,
    "num_comments": 12,
    "date": "2025-07-25",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "OverFlow10",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "juststart",
    "title": "I'm building a tool site - here's how it's going (month 6)",
    "text": "On the 6-month mark of starting [terrific.tools](http://terrific.tools), I figured it would be a good time to update you guys where the project is at. Here's the [previous post](https://www.reddit.com/r/juststart/comments/1jsx02g/im_building_a_tool_site_heres_how_its_going_month/).\n\nWith every business endevour, there's going to be a moment where the puck simply stops moving upwards.\n\nIn the case of terrific tools, traffic has been largely flat at about 16k sessions / l30d for well over a month now.\n\nOn top of that, my request to join an ad network to monetize the site via display ads was declined, which means I haven't started monetizing terrific.tools as of now.\n\nFurthermore, Google seems to not like the project as much yet. Most of the traffic comes from Bing and Yandex while even substantially smaller search engines like DuckDuckGo send more traffic on certain days.\n\nIt's situations like these that ultimately determine success and failure. Many founders tend to give up, especially ",
    "url": "https://reddit.com/r/juststart/comments/1klkp1a/im_building_a_tool_site_heres_how_its_going_month/",
    "score": 18,
    "num_comments": 9,
    "date": "2025-05-13",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "OverFlow10",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "How to improve aesthetic sense (not just software) as a beginner?",
    "text": "I run a small furniture store, and I stopped worrying about making everything perfect a while ago. For a while, I hired outside designers to update our product photos, make changes to the interior design, and create advertising content. But I realized that the time and money I was spending on this wasn't always worth it, and we could get things done much faster. So I started trying it ourselves\n\nI decided to try something new to make my shop look more appealing. So I downloaded various design software and even paid for memberships, I shelled out for PS and other design app classes but soon I realized if you don’t have a design idea or eye, you’re just clicking buttons.. Take canva, for instance. While it offers abundant templates, whenever I tried to create slightly personalized designs, I found them either unsuitable or falling short of my expectations. But it is one of the more common software on the market, with more complete functions.Picsart, though strong in AI customization, lea",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1nd8u9y/how_to_improve_aesthetic_sense_not_just_software/",
    "score": 4,
    "num_comments": 4,
    "date": "2025-09-10",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Low_Minimum7339",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "EntrepreneurRideAlong",
    "title": "Looking for a Cofounder for my Automation Business and my personal brand",
    "text": "Alright, I’ll keep it short.\n\nI’ve been neck-deep in AI + Automations for the past 8–9 months. Built a solid personal brand around it \\~70k followers on IG where I share stuff on AI agents, real automations, and no-fluff builds.\n\nFrom that audience I’ve already pulled in multiple paid automation projects (so it’s not just content, it’s revenue). All them were Inbound Leads, I have not sent a single outreach message till now..\n\nNow I’m looking for a technical cofounder, someone who:\n\nKnows how to code and can actually build things beyond the surface-level hype\n\nHas hands-on experience with AI automations, n8n, even voice AI agents... Even if you're not good at Ai Automations, it's fine But \"YOU MUST KNOW HOW TO CODE\"\n\nNot the Lovable Shit, please..\n\nThere’s a big opportunity here to build and scale together. If you’re technical and want to explore cofounding something real, DM me..",
    "url": "https://reddit.com/r/EntrepreneurRideAlong/comments/1n4tzma/looking_for_a_cofounder_for_my_automation/",
    "score": 2,
    "num_comments": 2,
    "date": "2025-08-31",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "BIG-BRO-100",
    "upvote_ratio": 0.76
  },
  {
    "subreddit": "indiehackers",
    "title": "I do not understand how to get the first users",
    "text": "Hi all,  \n  \nI have been coding and developing ideas for the past 7 years and every time i finish a product it never works till i just stop.  \n  \nThe thing is, I'm pretty sure that my ideas are good and useful, but I just can't get those first customers.\n\nFor example, right now I'm building a Proxy that helps users see the real cost and usage of the IA, if u have a website that uses OpenAI or any other LLM's u can get a report, costs, compare models and more stuff.  \n  \nIt's FREE! And even like that, i don't have users.\n\nPlease take a look at it and let me know if there is something bad. [Promptlytics](https://www.promptlytics.net/)",
    "url": "https://reddit.com/r/indiehackers/comments/1nao4mq/i_do_not_understand_how_to_get_the_first_users/",
    "score": 1,
    "num_comments": 26,
    "date": "2025-09-07",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Tall-Seat3901",
    "upvote_ratio": 0.6
  },
  {
    "subreddit": "indiehackers",
    "title": "I built GoConnect, a small alternative to Twitter(X)/Mastodon just for developers – would love your feedback",
    "text": "For the past few months, I've been working on a side project called GoConnect a [microblog](https://goconnect.dev/) . It aims to be a simple, community-based alternative to Twitter and Mastodon, but focused exclusively on developers.\n\nThe idea is to have a space where developers can share ideas, projects, snippets, and connect without the noise that typically occurs on mainstream platforms—without ads, without the noise. I know there are already large companies, but I felt something was missing: a more focused, minimalist, and developer-centric space.\n\nAny feedback, ideas, or even criticism would be greatly appreciated. [https://goconnect.dev/](https://goconnect.dev/)  \nIt currently has 500 users since the launch of its first version in January 2025.\n\nhttps://preview.redd.it/5vkqj4izwxkf1.png?width=1006&format=png&auto=webp&s=28ad87ff43ad718e4ad62f458cb223616bed591d",
    "url": "https://reddit.com/r/indiehackers/comments/1myrkp0/i_built_goconnect_a_small_alternative_to/",
    "score": 2,
    "num_comments": 0,
    "date": "2025-08-24",
    "commercial_score": 6,
    "category": "integration_problems",
    "author": "HeyBaldur",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "I failed. Hard. Then I learnt. I thank a career in sales for learning how to do outbound. Now I've built a product for account research and contact details.",
    "text": "I spent years, hating the quality of data enrichment tools out there for sales. \n\nDead phone numbers, wrong phone numbers.   \n  \nHours prospecting without knowing if a company was even a good fit. \n\nI co-founded a tool to solve my own problem, and started selling it this year.\n\nSimple mission.   \n  \nSimplify account research and give high quality contact details that actually work.\n\n1 web app. 1 API.\n\n**Journey so far**\n\n58 paying customers\n\n**They're saying**\n\n\\- 6x better mobile number coverage than Apollo\n\n\\- A lot easier to use than Clay\n\nDM me if you'd like a free trial",
    "url": "https://reddit.com/r/microsaas/comments/1mrzpn9/i_failed_hard_then_i_learnt_i_thank_a_career_in/",
    "score": 26,
    "num_comments": 27,
    "date": "2025-08-16",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Ryanrkb",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "microsaas",
    "title": "17 y/o founder of an AI SaaS — looking for a co-founder to scale InfluenceOS",
    "text": "Hey everyone,\n\nI’m 17 and currently building **InfluenceOS AI** — a SaaS platform that replaces overpriced “guru courses” with simple, AI-driven systems for creators and solopreneurs.\n\nI’ve built the roadmap, positioned the product, and I’m gearing up for launch. What I need now is a **co-founder** who:\n\n* Gets the SaaS/AI space.\n* Can bring skills in growth, sales, or product.\n* Wants to build something lean but scalable from the ground up.\n\nThe vision: **replace fake mentorship with smarter, automated systems** for a generation that can’t afford to waste $2k–$5k on fluff.\n\nIf this resonates, let’s connect — I’d rather build this with the right partner than do it solo.",
    "url": "https://reddit.com/r/microsaas/comments/1mzuwl5/17_yo_founder_of_an_ai_saas_looking_for_a/",
    "score": 2,
    "num_comments": 9,
    "date": "2025-08-25",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Individual_Mine1649",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "Follow this method if you are looking for validated ideas :- choose a Subreddit between 10K to 30K members and build a product around it.",
    "text": "Don't worry, I am not selling you anything... *yet :)*. Just trying to share some value from my experience.\n\nTwo biggest problems - Finding an idea to build, & Marketing it.\n\nMy advice - Choose a Subreddit with 10K to 30K members and build a product around it.\n\nWhy? - because each subreddit is already a niche, and if it has at least 10K members then I would consider it validated - **people have gathered there because of a problem** \\- either they need information or a community support.\n\nHow to start? - look at the subreddit communities that you are already a part of for personal interests, not for business purpose, and choose one.\n\nSince you would already have a good understanding of the problem/needs of that subreddit community, you can start helping them by providing valuable information and slowly mention your newsletter/directory, and build an audience. \n\nThen you can expand into discord/webapp/micro SaaS/mobile app etc. If you can build and own your audience, then you can think o",
    "url": "https://reddit.com/r/microsaas/comments/1n1giiv/follow_this_method_if_you_are_looking_for/",
    "score": 22,
    "num_comments": 6,
    "date": "2025-08-27",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Silver_Traffic_9790",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "webdev",
    "title": "How do I convince my bosses to drop the company that was supposed to build our website? (Updated)",
    "text": "An update.\n\nhttps://www.reddit.com/r/webdev/s/ia01Alm3E3\n\nI had my first meeting with his team. My supervisor was on the call. She wanted me on the call since I would have to work with them directly. After hearing them speak for a little I realized it was definitely bullshit. They had no idea what they were talking about, just throwing buzz words around.\n\nI spoke up and asked the owner about his process. He mentioned profiles and user testing and I asked \"why wasn't that being done before launch?\"\n\n He said they didn't have proper analytics on the current site. That the site was broken. Although our marketing agency had no issues with it and we still received donations just fine.\n\nI asked \"why wasn't the analytics addressed before building the new site if it didn't have the proper data?\"\n\n He very quickly got angry with me. He said he had someone discussing it with the CEO. I didn't realize at the time that he started raising his voice as I was taking notes.\n\nHe said they needed \"fresh",
    "url": "https://reddit.com/r/webdev/comments/1n3bbm5/how_do_i_convince_my_bosses_to_drop_the_company/",
    "score": 232,
    "num_comments": 66,
    "date": "2025-08-29",
    "commercial_score": 6,
    "category": "scaling_issues",
    "author": "Gold-Relief-3398",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "webdev",
    "title": "Looking for chromium browser alternatives to Brave",
    "text": "I switched from Chrome to Brave after hearing so many good things about it. I've been using it for a few months, and it's been alright for the most part, and while it did great in removing the bloat found in Chrome, I found it had a bit of bloat of its own (like the crypto bs everywhere, which I know is all opt-in, but if I can use a browser that doesn't shove it to my face by default that would be great).\n\nRequirements:\n\n* Must be chromium and decent for web development (this is for work)\n* Available on windows, macOS and iOS + history and bookmark syncing across different platforms\n* Option to have multiple profiles\n* Better privacy and less bloat than Chrome",
    "url": "https://reddit.com/r/webdev/comments/1n57yvk/looking_for_chromium_browser_alternatives_to_brave/",
    "score": 8,
    "num_comments": 44,
    "date": "2025-08-31",
    "commercial_score": 6,
    "category": "missing_features",
    "author": "Wyrda22",
    "upvote_ratio": 0.65
  },
  {
    "subreddit": "dataengineering",
    "title": "How do senior data engineers view junior engineers using LLMs?",
    "text": "At work, I'm encouraged to use LLMs, and I genuinely find them game changing. Tasks that used to take hours, like writing complex regex, setting up tricky data cleaning queries in SQL, or scaffolding Python scripts, now take way less time. I can prompt an LLM, get something 80% of the way there, and then refine it to fit the exact need. It’s massively boosted my productivity.\n\nThat said, I sometimes worry I’m not building the same depth of understanding I would if I were digging through docs or troubleshooting syntax from scratch. But with the pace and volume of work I’m expected to handle, using LLMs feels necessary.\n\nAs I think about the next step in my career, I’m curious: how do senior data engineers view this approach? Is leveraging LLMs seen as smart and efficient, or does it raise concerns about foundational knowledge and long-term growth?\n\nWould love to hear your thoughts, especially from those who mentor or manage junior engineers.",
    "url": "https://reddit.com/r/dataengineering/comments/1mqertd/how_do_senior_data_engineers_view_junior/",
    "score": 131,
    "num_comments": 56,
    "date": "2025-08-14",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Firefly-ssa",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "dataengineering",
    "title": "How do you schedule dependent data models and ensure that the data models run after their upstream tables have run?",
    "text": "Let's assume we have a set of interdependent data models. As of today, we offer the analysts at our company to specify the schedule at which their data models should run. So if a data model and its upstream table (tables on which the data model is dependent) is scheduled to run at the same time or the upstream table is scheduled to run before a data model, there is no problem (in case the schedule is the same, the upstream table runs first).\n\n  \nIn the above case, \n\n1. The responsibility of making sure that the models run in the correct order falls on the analysts (i.e. they need to specify the schedule of the data models and the corresponding upstream tables correctly).\n\n2. If they specify an incorrect order (i.e. the upstream table's scheduled time is after the corresponding data model), the data model will be refreshed followed by the refresh of the upstream table at the specified schedule.\n\nI want to validate if this system is fine or should we make any changes to the system. I hav",
    "url": "https://reddit.com/r/dataengineering/comments/1n3v5p5/how_do_you_schedule_dependent_data_models_and/",
    "score": 10,
    "num_comments": 20,
    "date": "2025-08-30",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "the-fake-me",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "dataengineering",
    "title": "When should I start looking for a new job?",
    "text": "I was hired as a “DE” almost a year ago. I absolutely love this job. It’s very laid back, I don’t really work with others very much, and I can (kinda) do whatever I want. There’s no sprints or agile stuff, I work on projects here and there, shifting my focus kinda haphazardly to whatever needs done. There’s just a couple problems.\n\n1. I make $19/hr. This is astronomically low, though what I’m doing isn’t all that hard.\n2. I don’t think my work is the same as the rest of the industry. I work with mostly whatever tools I want, but we don’t do any cloud stuff, I don’t really collaborate with anyone, there’s no code reviews or PRs or anything like that. My work mainly consists of “find x data source, setup a way to ingest it, do some transformations, and maybe load it into our DB if we want it.” I mostly do stuff with polars, duckdb, and sometimes pandas. I also do some random things on the side like web scraping/browser automation. We work with A LOT of data, so we have 2 beefy servers, b",
    "url": "https://reddit.com/r/dataengineering/comments/1mtsgz9/when_should_i_start_looking_for_a_new_job/",
    "score": 11,
    "num_comments": 23,
    "date": "2025-08-18",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "echanuda",
    "upvote_ratio": 0.84
  },
  {
    "subreddit": "ProductManagement",
    "title": "How do you handle delays? Are they really inevitable to some extent, or I am doing something wrong?",
    "text": "I lead a 10-person engineering team, yet our projects almost always ship late - sometimes by a week or two, sometimes by as much as ten. It’s starting to make me question my competence.\n\nI know Hofstadter’s Law (everything takes longer than you expect, even after you account for that), but I still wonder if I’m missing something.\n\nHow do you handle such delays? How do you explain them upstream? I report directly to the CEO, and every delay fills me with anxiety. “It is what it is” can not fly, but I struggle to offer anything more tangible.\n\nI’d appreciate any practical strategies - process tweaks, expectation-setting tips, whatever works for you - to keep both projects and exec nerves on track. I believe this is an important skill of a Product Manager and I feel currently lacking in this, snowballing to immense impostor syndrome.",
    "url": "https://reddit.com/r/ProductManagement/comments/1n1gypr/how_do_you_handle_delays_are_they_really/",
    "score": 66,
    "num_comments": 58,
    "date": "2025-08-27",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "utkarshmttl",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "ProductManagement",
    "title": "Need help: is my firm Fintech or Wealth Management and are they product or sales driven?",
    "text": "I won’t say the name of my firm as I want it to remain unknown, partially for privacy and partially because I feel many company’s may have a similar identity issue.\n\nThe company I work at is an independent broker dealer. The primary metrics which drives the stock prices are Assets Under Management AUM and the number of advisors at the firm (both growth and attrition). This leads me to believe we are a through and through sales driven org.\n\nWhere I get confused is, leadership calls us a fintech company (our tech is pretty crummy). If it was only communicated externally as market I would be okay with it, but it’s not. The tech and product org truly believe we are a fintech product driven org. It creates a lot of confusion between business, product, design, and tech.\n\nAs I’m one of the few people that see the misalignment, I feel I have a clear and powerful opportunity to align myself to sales leadership and be one of the few product people driving the sales led vision. My only worry is t",
    "url": "https://reddit.com/r/ProductManagement/comments/1mx8oj1/need_help_is_my_firm_fintech_or_wealth_management/",
    "score": 0,
    "num_comments": 11,
    "date": "2025-08-22",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Smithc0mmaj0hn",
    "upvote_ratio": 0.3
  },
  {
    "subreddit": "ProductManagement",
    "title": "Looking for advice on creating an allocation model for tech debt, KTLO, and business releases",
    "text": "Hi everyone,\n\nAt my current company, we don’t have a formal allocation model for tech debt, business releases, and maintenance/KTLO. Right now, every quarter I sit down with engineering managers and negotiate percentages (e.g., 0-10% for tech debt). But since leadership pushes heavily for business releases to show impact, tech debt often takes a back seat.\n\nEngineering has been informally handling this by sneaking tech debt work into business release tickets. While I appreciate the effort, it’s not transparent, and it doesn’t help leadership see the importance of addressing tech debt early.\n\nTo bring more structure and transparency, I’m working with my engineering manager to propose an allocation model like this:\n\n* **20%** Tech Debt, **30%** Maintenance / KTLO**, 50%** Business Releases\n\nMy questions:\n\n1. What metrics should I track to measure whether tech debt is being meaningfully addressed?\n2. Are there good ways to tie this back to developer productivity, system resilience, or lon",
    "url": "https://reddit.com/r/ProductManagement/comments/1n085qu/looking_for_advice_on_creating_an_allocation/",
    "score": 1,
    "num_comments": 3,
    "date": "2025-08-26",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Humble-Pay-8650",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ProductManagement",
    "title": "Senior leadership keeps asking for innovation but blocks every new idea",
    "text": "I’m honestly at a loss here. My team is solid, they’re talented, creative and not afraid to bring fresh ideas to the table. But every time we try to push something new, senior leadership shuts it down with the same lines: too risky, not the right time, we’ve never done it that way.\n\nMeanwhile, those same leaders are constantly telling us we need to be innovative and think outside the box. The irony is exhausting.\n\nExample: one of my engineers came up with a streamlined process that would cut turnaround time by almost 30%. We tested it in a pilot, it worked. The response from above? It might set unrealistic expectations for other teams. So instead of rolling it out, they buried it.\n\nI’m worried morale is gonna tank because my team feels like they’re being punished for even trying. And honestly, I can’t keep standing in front of them and saying we value innovation when all the evidence points the other way.\n\nHas anyone else dealt with this contradiction? How do you keep your team motivat",
    "url": "https://reddit.com/r/ProductManagement/comments/1nexq6t/senior_leadership_keeps_asking_for_innovation_but/",
    "score": 31,
    "num_comments": 14,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "BuffaloJealous2958",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "ProductManagement",
    "title": "Are pointless online meetings a legacy of on-site work?",
    "text": "I hate endless meetings in Teams/Meet/Zoom, which have no real reason, or when there are a lot of people invited “just in case”. It is really a waste of time in most cases, at least for some participants.\n\nBut what if this corporate “tradition” is a legacy of the work in offices? This idea came to me recently. Years ago, especially before the COVID-19 offline meetings were the usual way to communicate, and often you had to meet people face-to-face to get the full information. Earlier, we didn’t have enough seamless tools to cover this; later, it became a disappearing habit. But for now, this “let's do a quick call” is the same as “hey, let’s talk about it on the patio”. But it seems a legacy habit, and a very costly habit - dozens of hours that people spend to clarify things that are already explained in docs, online boards like Miro, or in chat threads (and could be discussed there asynchronously, which is more effective).\n\nFrom my experience, 90% of questions and issues can be solved",
    "url": "https://reddit.com/r/ProductManagement/comments/1ndff6a/are_pointless_online_meetings_a_legacy_of_onsite/",
    "score": 11,
    "num_comments": 13,
    "date": "2025-09-10",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Fearless-Plenty-7368",
    "upvote_ratio": 0.69
  },
  {
    "subreddit": "projectmanagement",
    "title": "How to deal with developers that aren't very good",
    "text": "I'm really stuck. I left a company that was one of the best in my industry to join a more immature company operating in the same industry but slightly different technology. So from a team of 25 devs and 3 PMs to 6 devs and me the only PM. They've never had a PM function before so just seem to think I'm there to do documentation. \n\nIn my previous role all my devs loved having me in calls and to bounce solutions and ideas. I just can't get in with these new ones. They don't seem to cc me in emails either. And one developer in particular is just useless in the their technical ability and lack of technical advice they're providing on client calls. I find it embrassing, I have to speak for them. They seem to want to just to what they're told rather than provide consultancy when we are meant to be the experts.  \n\nTrouble is the Head of the developers is also not very good in my view. Quite how he worked his way up, I have no idea. He doesn't even ask basic questions when clients ask for new ",
    "url": "https://reddit.com/r/projectmanagement/comments/1n1qlo4/how_to_deal_with_developers_that_arent_very_good/",
    "score": 44,
    "num_comments": 23,
    "date": "2025-08-27",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Kinderventure",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "sales",
    "title": "How do I transition from HVAC sales into SaaS?",
    "text": "Hey everyone,\n\nI’ve been in sales my whole career and consistently performed at the top in every role I’ve taken on. Right now, I’m a residential HVAC salesman closing about 47% of \\~450 appointments per year, moving around $2M in revenue annually, directly with homeowners.\n\nI want to pivot into SaaS and ideally land a remote position. Last year I made \\~$180K CAD, but I’d be comfortable stepping back to \\~$140K (or even a bit less) for the right opportunity if it comes with growth and education in the SaaS space.\n\nAt 35, I know I bring strong closing ability, consultative sales experience, and proven revenue results — but I’m unsure how to position myself for SaaS and where to start.\n\nFor those who’ve made a similar transition (or hire in SaaS sales):\n\n* What’s the best entry point (SDR, AE, closer roles)?\n* How do I frame my background so SaaS companies see the fit?\n* Any recommended resources, communities, or job boards to target?\n\nReally appreciate any advice or perspective.",
    "url": "https://reddit.com/r/sales/comments/1n5vyam/how_do_i_transition_from_hvac_sales_into_saas/",
    "score": 14,
    "num_comments": 55,
    "date": "2025-09-01",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "RaiseTheFuckingBar",
    "upvote_ratio": 0.77
  },
  {
    "subreddit": "sales",
    "title": "Told one thing in the interview to find out it was a lie when you got there",
    "text": "Always love a good horror story. Here's mine.\n\nWas working as a consultant for myself and doing well. Got seduced by a cutting edge technology and a founder who was technically smart.  \n\nDuring the interview I specifically asked and was given a budget number I could spend on tools without asking for permission. $500/ month, which was low, but I understood. Seed stage start up, etc. \n\nI then when and bought 3 licenses from Hubspot that showed when someone opened an email. (This was some time ago when this was cutting edge.)  Cost was $10/ month/ user.  3 Users, so $30/ month. \n\nGot called into a meeting with the CEO and COO and asked why I spent \"so much money\" for something like this. It took 30 minutes (90 minutes of people hours) to get them to reluctantly agree.\n\nLeft about a few months later. Went back to my consulting. ",
    "url": "https://reddit.com/r/sales/comments/1nf8ox1/told_one_thing_in_the_interview_to_find_out_it/",
    "score": 97,
    "num_comments": 39,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Interesting-Alarm211",
    "upvote_ratio": 0.98
  },
  {
    "subreddit": "sales",
    "title": "What do you think about AI SDRs/AI sales tools in general?",
    "text": "Does anyone have any experience with AI SDRS? Are they worth it? What kind of way do you use them?\n\n\n\nOur company just got skyp which is supposed to automate email personalization and it does a pretty decent job at it. We had a pretty good experience so I was wondering, what other tools or workflows (like with n8n or zapier) do you use to make things easier in sales?\n\nfor extra context, we are an agency, nothing else really has ai in it in our sales process other than skyp and the odd gpt prompt to write our something or proofread an email or document.\n\n",
    "url": "https://reddit.com/r/sales/comments/1nfhj8b/what_do_you_think_about_ai_sdrsai_sales_tools_in/",
    "score": 15,
    "num_comments": 11,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Academic_Way_293",
    "upvote_ratio": 0.91
  },
  {
    "subreddit": "sales",
    "title": "New Sales Lead coming in ONLY wants to do video calls ONLY not phone calls is this a scam?  Shady?",
    "text": "New Sales Lead coming in ONLY wants to do video calls ONLY not phone calls is this a scam?  Shady? \n\nSo we got a new sales lead it came in about a week ago. It looks like they are based on the east coast. So they are emailing us and are looking to drop a bit of money so it should be a pretty big account/commission/deal over all. \n\nThe very odd thing is so far they've only communicated via email only and for whatever reason will not talk on the phone, such as office phones or business cell phones. Every time we try to set up a phone call and move things forward they will not provide an actual phone number and will not speak on the phone but only want to do video calls.\n\nWhat do you make of this? Very odd isn't it? The thing is they have our phone numbers. They have our office number as its on our company site and even at the bottom of our email signatures, but they have not provided their number yet nor want to get on an actual phone call only Zoom and Video calls?",
    "url": "https://reddit.com/r/sales/comments/1nfiwq0/new_sales_lead_coming_in_only_wants_to_do_video/",
    "score": 13,
    "num_comments": 53,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "MrCharmingMan",
    "upvote_ratio": 0.78
  },
  {
    "subreddit": "sales",
    "title": "Has anyone here used Lonescale? Need honest reviews",
    "text": "Hey everyone,\n\nWe’re a B2B company with about 25 sales reps and we’ve been on Salesforce for a few years. Over the last year we’ve been pushing a lot on data quality inside the CRM, so I started looking around for tools that could actually help with enrichment and cleaning.\n\nWhat I’m really looking for is something that can automate contact enrichment, clean up records when people leave or change jobs, and surface insights that are actually valuable for the reps. I recently spoke with the Lonescale team and got a pretty good first impression of the tool.\n\nWould be great to hear from anyone who’s actually used it. Any feedback would be super useful!",
    "url": "https://reddit.com/r/sales/comments/1nf78k9/has_anyone_here_used_lonescale_need_honest_reviews/",
    "score": 22,
    "num_comments": 13,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "XiderXd",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "sales",
    "title": "“Our CFO Has Expired” Objection Email",
    "text": "Buddy of mine just got a wild email response to a sales email. He asked how I would handle this objection. Wonder what you guys would come up with lol.\n\nRedacted personal info for obvious reasons.\n\nEmail:\n\n“Hi [NAME],\n\nUnfortunately, our CFO has expired on [redacted date]. Please allow me some time to get back to you.”\n\nThen they had a Memorial Message:\n\n“Late [Dead CFO]\n\nIt is a moment of immense grief for all of us, and we are deeply saddened by the passing of [Dead CFO], CFO of the Bank, on [Date].\n\n[Dead CFO] was a cherished member of the [Company] family for over 15 years. He brought warmth, dedication, and a spirit of togetherness that touched everyone around.\n\nAs a mark of respect and remembrance, we will observe two minutes of silence today from 5:00 PM to 5:02 PM across all [Company] touchpoints.\n\nThis moment of solemn pause is our collective tribute to the life, values, and legacy he leaves behind.\n\nWe request all team members to pause their activities during this time and jo",
    "url": "https://reddit.com/r/sales/comments/1nf6r3p/our_cfo_has_expired_objection_email/",
    "score": 23,
    "num_comments": 40,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Petielo",
    "upvote_ratio": 0.7
  },
  {
    "subreddit": "sales",
    "title": "Company refusing to pay $5,847 in commissions, what would you do?",
    "text": "A buddy of mine just quit his SaaS sales job and is pretty crushed right now.\n\nHe’s owed **$5,847 in commissions** for the last quarter, but the company is refusing to pay because of a clause buried in his agreement. Apparently, they don’t pay commissions if you’re serving notice. He never realized that until HR pulled it out during his exit process.\n\nNow he’s debating what to do. Part of me thinks he should blast the company publicly on LinkedIn or here on Reddit to create pressure, but he’s worried it’ll hurt his chances when applying for his next role.\n\nWhat would you do in his shoes? Call them out? Get a lawyer? Or just take the loss and move on? Curious if anyone else has dealt with this kind of thing.\n\nUPDATE 9/12 – Looks like someone from the company saw this thread. They reached out to my friend and offered to have a conversation to find a win-win solution. Thank you, community.",
    "url": "https://reddit.com/r/sales/comments/1necsxw/company_refusing_to_pay_5847_in_commissions_what/",
    "score": 139,
    "num_comments": 166,
    "date": "2025-09-11",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "brndimcc",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "accounting",
    "title": "Looking for some feedback before I quit my job to go back to school for accounting",
    "text": "I've spent my 20's bouncing around the sports industry, and I've effectively locked myself into a subset of the field that I don't actually want to continue in and one that is relatively difficult to leverage for other options (I do venue/facility management for a pro sports team). My current job is low paying with poor management and long hours, but I wouldn't mind any of that as much if I felt like I was learning/doing **anything** or if I was on a path to a more fulfilling position, but I don't and I'm not. I don't care about the \"prestige\" of working in sports anymore; I just want something more stable and more flexible with decent long-term potential and possible WFH options down the line.\n\nI am extremely close to quitting my job, enrolling in community college to get the necessary pre-reqs, then trying my hand at acceptance to MACC/MPA programs. I live just down the road from what I understand to be one of the better MPA options in the country, but I know that's not a guarantee. ",
    "url": "https://reddit.com/r/Accounting/comments/1ncrp9b/looking_for_some_feedback_before_i_quit_my_job_to/",
    "score": 1,
    "num_comments": 7,
    "date": "2025-09-09",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "otingo_inc",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "bookkeeping",
    "title": "How to set up QuickBooks Desktop to work from home - Access QuickBooks Desktop Remotely in Real time",
    "text": "I have covered every step you need to access your company file located in a different region or state. \n\nYou only need a basic computer to act as your server with a  corei3 processor, 128gb ssd drive, 4gb - 16gb RAM depending on the number of concurrent users, 10Mbps internet speed. This computer should always be powered on so a UPS may also be necessary in case of power outages.\n\nHope the post is of help: [https://www.reddit.com/r/QuickbooksOldVersion/comments/1mpdvxl/how\\_to\\_access\\_quickbooks\\_desktop\\_remotely\\_how\\_to/](https://www.reddit.com/r/QuickbooksOldVersion/comments/1mpdvxl/how_to_access_quickbooks_desktop_remotely_how_to/)\n\n",
    "url": "https://reddit.com/r/Bookkeeping/comments/1mw7ydg/how_to_set_up_quickbooks_desktop_to_work_from/",
    "score": 1,
    "num_comments": 1,
    "date": "2025-08-21",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "wangai254",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "bookkeeping",
    "title": "Clio + QBO (looking for tips (plus ranting))",
    "text": "I have a small law firm client that uses Clio + QBO. It used to be fine but the last several months have been a ridiculous mess and it just keeps getting worse. And Clio is all, 'it looks fine to us' & QBO is all 'take it up with Clio'\n\nI'm in Canada so Clio Accounting isn't available. I feel like ever since they launched Clio Accounting they just give zero fucks about the Clio+QBO sync. I'm extra salty about this because Clio is a Canadian company & their Canadian customers are getting screwed here.\n\nI HATE IT SO MUCH. They used to be one of my favourite clients (I still like the people, none of this is their fault) but this is killing me. I miss when it worked :(\n\nRant over.\n\n# Any tips for Clio+QBO welcome!",
    "url": "https://reddit.com/r/Bookkeeping/comments/1n6p3kr/clio_qbo_looking_for_tips_plus_ranting/",
    "score": 9,
    "num_comments": 3,
    "date": "2025-09-02",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "noRehearsalsForLife",
    "upvote_ratio": 0.91
  },
  {
    "subreddit": "bookkeeping",
    "title": "What's your approach to collecting payments from clients?",
    "text": "Hi everyone,\nAbout 3 months ago I signed an agreement with a company to handle their 2024 and 2025 accounting and tax filings. The owner was supposed to provide all 2024 documents within 10 days, and our plan was to complete the bookkeeping within 2 months and then file the tax return.\n\nHowever, the documents started to arrive in pieces. Despite several reminders, the client delivered the first 6 months of records very late. We processed those 6 months and issued an invoice for the work completed.\n\nWhen I asked for payment, the client first said, “I’ll pay within a week,” but then changed it to something like, “I’ll pay you in small installments, you finish 2024 and file the tax return first, then I’ll pay.” On top of that, during phone calls, the client spoke to me in a rather unfriendly tone.\n\nFor me, these are red flags. So I told the client that I need the payment for the first 6 months’ work before I continue with the remaining 6 months and the tax filing.\n\nHow do you usually hand",
    "url": "https://reddit.com/r/Bookkeeping/comments/1nfal3q/whats_your_approach_to_collecting_payments_from/",
    "score": 23,
    "num_comments": 20,
    "date": "2025-09-12",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Real-Letter-9981",
    "upvote_ratio": 0.97
  },
  {
    "subreddit": "bookkeeping",
    "title": "How did you get your biggest clients?",
    "text": "I’ve been running my own bookkeeping company for a few years now, and have been pretty successful finding smaller clients. However, the bigger clients seem harder to find.  I have a few, looking for more as I expand my business. Just wondering how you found your biggest clients?",
    "url": "https://reddit.com/r/Bookkeeping/comments/1ncq96q/how_did_you_get_your_biggest_clients/",
    "score": 11,
    "num_comments": 13,
    "date": "2025-09-09",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "PPRclipBookeeeping",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "excel",
    "title": "How do you automate Excel? VBA, Power Query, Python — curious what you use",
    "text": "Hello all. I’m a senior in business school, and last summer during my internship, I built a VBA macro (with the help of Copilot) that ended up saving hundreds of hours for my team and was rolled out nationwide. That experience showed me how powerful automation can be — but also how confusing VBA/automation can feel for many people.\n\nNow I’m writing my thesis on Excel automation, and I’d love to hear from people who live in spreadsheets:\n\n* What’s the most helpful automation you’ve built or used?\n* What’s the hardest or most frustrating part of working with VBA/automation?\n* Do you have any stories where automation saved you… or totally backfired?\n\nEven short replies would be super helpful 🙏. And if anyone’s ever open to chatting 1:1 about how you use automation in Excel, I’d be very grateful.\n\n**Edit:** Wow! Thank you everyone for all the replies, I didn’t expect this much engagement. I’ve already learned a ton from your stories and I’m still reading through them, so feel free to keep ",
    "url": "https://reddit.com/r/excel/comments/1n46tp7/how_do_you_automate_excel_vba_power_query_python/",
    "score": 208,
    "num_comments": 126,
    "date": "2025-08-30",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Historical-Look-4973",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "wordpress",
    "title": "How do you decide which plugins or tools are safe to build your business on?",
    "text": "I’ve been looking into **ETCH** lately. It seems like a really solid, developer-focused builder, but since it’s still a work in progress I’m hesitant to dive in.\n\nI’ve been burned before when tools lost support:\n\n* **Oxygen** → the lead dev shifted focus to a new product, leaving people stuck.\n* **Cwicly** → just straight up discontinued.\n* **Arc browser** → I invested a ton of time into it, only for the team to move on to something else and stop updating Arc.\n\nStuff like this makes me wonder: *how do you actually decide which plugins or tools are safe to build a business on?*\n\nA lot of senior devs I’ve talked to say they usually stick with tools that have a strong reputation and a big user base. Even if something new is faster or more exciting, the stability and long-term support of the popular ones usually win out.",
    "url": "https://reddit.com/r/Wordpress/comments/1n5rdvy/how_do_you_decide_which_plugins_or_tools_are_safe/",
    "score": 12,
    "num_comments": 27,
    "date": "2025-09-01",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Any_Acanthaceae_7337",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "wordpress",
    "title": "Plugin that solves the problem of uncontrolled data scraping for AI - looking for feedback",
    "text": "I've been following the discussions about AI crawlers and it seems that currently, we're stuck with an all-or-nothing approach: either allow all scraping and lose money on bandwidth, or block everything and lose potential revenue.\n\nHere's a different approach to consider: what if instead of playing whack-a-mole with blocking plugins, we could make **AI companies pay** creators for the content they want.\n\nThe problem is clear:\n\n* Bots now make up 80% of our traffic (bye-bye, accurate analytics)\n* That WordPress site you're proudly hosting? It's training AI models for free\n* Meanwhile, Reddit's getting $60M/year from Google for the same thing\n\nLooking for content creators who want to \"make money from the machines\" to discuss: what you'd charge AI companies for training access, what concerns you might have, and what these bots are currently costing you in bandwidth, hosting upgrades, and wasted time - would love to chat and maybe have you try it out.\n\nAlso, if this is a terrible idea, ple",
    "url": "https://reddit.com/r/Wordpress/comments/1n2b0fb/plugin_that_solves_the_problem_of_uncontrolled/",
    "score": 5,
    "num_comments": 10,
    "date": "2025-08-28",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "denisperov",
    "upvote_ratio": 0.86
  },
  {
    "subreddit": "slack",
    "title": "Drowning in slack notifications. How do you all deal with it?",
    "text": "I moved into a management role recently and the biggest shock so far has been how much time gets eaten up by communication. Slack feels like a never ending treadmill.  \n  \nBy the time i cleared out the morning pings, DMs, team updates, bug reports, requests from other departments. here is already a whole new wave waiting. Half the day is just reacting and when meetings start piling on top of that, it feels impossible to carve out any real focus time.  \n  \nI get now why people say context switching is the silent killer of productivity. Its not just me either. my team is stuck in the same loop, always online, always answering but struggling to find energy for actual deep work.  \n  \nHow do you balance staying responsive with protecting your own bandwidth? Is this just the nature of the job or have you found concrete strategies that help?",
    "url": "https://reddit.com/r/Slack/comments/1mx2g6l/drowning_in_slack_notifications_how_do_you_all/",
    "score": 19,
    "num_comments": 19,
    "date": "2025-08-22",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "capriciousfatesw",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "PowerBI",
    "title": "How do you best design large scale semantic models?",
    "text": "How do you best design large scale semantic models? \n\nCase: We have a large number of dimensions & facts (100+) which is divided into various business areas.   \nTo best support self-service report building, semantic models will be made available for users to build upon. To ensure only relevant data objects are available for the various business areas, we want to create smaller semantic models (Roughly size of the logical business area).\n\nAll dimensions and facts are created in DWH, with only relationships, hierarchies and measures added to the sematic models. Each report will additionally have report specific measures such as conditional formatting etc. \n\nIdeally we want to ensure that measures which are used in multiple business areas are only maintained in one place. For example Count of Customers may be used both in Marketing, Finance, Call Center, but should only be 1 single measure even though this might be 3 different semantic models. This is the intend of central semantic model ",
    "url": "https://reddit.com/r/PowerBI/comments/1ndmlmy/how_do_you_best_design_large_scale_semantic_models/",
    "score": 20,
    "num_comments": 13,
    "date": "2025-09-10",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Fyntastisk",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "PowerBI",
    "title": "I need Help building Arguments on why our Project should Use Star Schema instead of Big table with 127 Columns and many-to-many relationships",
    "text": "Hey guys, how are you?\n\nI need a little help here, I am a Analytics Eng and I have developed data produts for the past 3 years, including Data Modeling, Eng, and Data Viz.\n\nI am current doing a Consulting for a company that needs me to help them to Migrate from Tableau to Power BI.\n\nI always have delivered data product which I did all the Data Modeling and also the Data Viz in Power BI.\n\nNow it is a different scenario, they already have a datalake, but it is CHAOS!\n\nIn the current Tableau, they are using tables that have ZERO data modeling, they literally have a table that has 127 columns and I dont know how I will first absord (how business work) and even to reproduce the same Data Viz in Power BI, because I never had a situation that they expect from me to use a One Big Table in Power BI, I don't even know how complex DAX could turn.\n\nSo what I proposed is to take a step back and help them to initiate a Star Schema Data Modeling approach instead of just ''paste and copy'' the Data Vi",
    "url": "https://reddit.com/r/PowerBI/comments/1n1owr3/i_need_help_building_arguments_on_why_our_project/",
    "score": 21,
    "num_comments": 34,
    "date": "2025-08-27",
    "commercial_score": 6,
    "category": "general_frustration",
    "author": "Dupree360",
    "upvote_ratio": 0.87
  },
  {
    "subreddit": "Entrepreneur",
    "title": "ADA compliance for my small bakery website looking for affordable solutions",
    "text": "Hi everyone,\n\nI run a small bakery with my mom and I’ve been thinking about website accessibility. I’ve read stories about small restaurants getting sued because their sites aren’t ADA compliant. Since we put our menu and online ordering on the site, I want to make sure everyone can use it without spending a fortune.\n\nSome options I’m considering:\n\nHiring a developer to audit or rebuild the site\n\nDoing small fixes myself, like converting PDF menus to text or adjusting fonts/colors\n\nHas anyone dealt with this for their business website? Did you hire someone, use a service, or handle it in small steps yourselves? Any tips on affordable solutions would be really helpful.",
    "url": "https://reddit.com/r/Entrepreneur/comments/1ncio4s/ada_compliance_for_my_small_bakery_website/",
    "score": 11,
    "num_comments": 28,
    "date": "2025-09-09",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "SleepyHead1219",
    "upvote_ratio": 0.79
  },
  {
    "subreddit": "startups",
    "title": "Need help finding a technical co-founder , but I have little to no connections (I will not promote)",
    "text": "I have a website/app idea that shows really good promise in the market from research I’ve done (basically no competitors). It’s based on the beauty service industry, which I have friends in and participate in, however, I don’t think I have any connections to someone with the skill set to be a technical cofounder or at least help me develop a functioning app. I’m really against outsourcing it to a random dev because of the amount of articles and videos saying how unproductive it is. I’ve watched many tutorials and I’ve attempted to get into coding, but I truly don’t think it’s a viable option for me to build it myself. I’m worried about approaching someone to help and them not taking me seriously or understanding my vision correctly. I just really need advice on how I should go about finding someone to help bring my idea to life.\n\nP.S. I’ve watched 1 million YouTube videos on this and they all say to go find the best person you know at developing or a person you know with a basic skill ",
    "url": "https://reddit.com/r/startups/comments/1msm05b/need_help_finding_a_technical_cofounder_but_i/",
    "score": 1,
    "num_comments": 22,
    "date": "2025-08-17",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "pinkwashietape",
    "upvote_ratio": 0.57
  },
  {
    "subreddit": "startups",
    "title": "Is Bluehost a good alternative to Shopify? I will not promote",
    "text": "I'm launching a modest start-up and need to provide a \"Shopify experience\" without the Shopify cost.  Bluehost ads pop up on my Reddit feed.  I'd like to hear from any users or former users.  I'm open to good alternatives.  As reference: I'm not savvy with providing online shopping but have built a handful of webpages.   ",
    "url": "https://reddit.com/r/startups/comments/1n1m9ef/is_bluehost_a_good_alternative_to_shopify_i_will/",
    "score": 3,
    "num_comments": 11,
    "date": "2025-08-27",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Infinite_Ticket1112",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "SaaS",
    "title": "Free alternative to boring security awareness training: interactive 3D exercises for corporate employees",
    "text": "Hey r/SaaS \n\nTL;DR: We’re building a **free & open platform for interactive security awareness training** — and you can use it however you like.\n\nMost security awareness training ends up being boring slide decks or videos. The problem is, they don’t actually build defensive skills, since people stay passive instead of practicing what to do in real-life situations.\n\nWe’re taking a different approach: an interactive 3D office environment where you face realistic incidents from a first-person perspective.\n\nYou’ll get hands-on experience dealing with scenarios like:\n\n* Spotting phishing indicators in a suspicious email\n* Handling a scam phone call (vishing) under pressure\n* Downloading a malicious file and watching the consequences unfold\n\n**It’s 100% free to use.** Right now, there are 9 sample exercises live on our site, with 14 more on the way. We’re also building out quiz questions to reinforce the lessons.\n\nYou can use it to train employees, help friends or family, or even test yourse",
    "url": "https://reddit.com/r/SaaS/comments/1ndfhki/free_alternative_to_boring_security_awareness/",
    "score": 18,
    "num_comments": 1,
    "date": "2025-09-10",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "maksim36ua",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "First time posting — I built “Send”, An Alternative to Docsend",
    "text": "Hey everyone — first time posting here. I’m more of a builder than a marketer, so sharing this publicly is a little scary \n\nI’ve been here for a while, seeing amazing projects, and wasn’t sure if I should post mine. I’m worried about feeling judged… but I could really use honest feedback and a few testers.\n\n**What I built:**  \nSend (A Docsend Alternative)— a simple way to share a document *with you in it*. You add a short Loom-style video  to any deck/proposal/contract, and the recipient sees the doc *and* hears your context. There’s real-time tracking so you can tell who viewed, which pages they lingered on, and when to follow up.\n\nThink: **DocSend with Loom inside** — but lightweight and accessible.\n\n**Why I built it:**  \nI kept sending “silent” decks and getting vague replies (or none). I realized the missing piece was **me** — the explanation that turns a document into a conversation.\n\nWhat it does (right now):\n\n* Add a 3m video bubble to any PDF\n* real-time notifications + page-le",
    "url": "https://reddit.com/r/SaaS/comments/1mzmcbc/first_time_posting_i_built_send_an_alternative_to/",
    "score": 1,
    "num_comments": 1,
    "date": "2025-08-25",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Competitive-Neck-536",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "SaaS",
    "title": "Free and open source all in one platform for musicians and creators alternative to patreon, bandcamp, bandzoogle, convertkit, toneden, eventbrite",
    "text": "TLDR;  \nCreate website, sell memberships, sell music, sell merch, build email lists and send emails, sell event tickets, linktrees, mobile app, all free and open source, no commissions and you own the data.\n\nThree months ago, I started working on a project to help musicians and artists gain full control over their brand without feeling like everyone’s hands are in their pockets.\n\n* If you want to sell membership, you have to go to patreon or others, they get a commission,\n* You want to sell you music on bandcamp? You pay a commission per sale,\n* You need smart-links for marketing? you sign up for linktree or toneden.\n* You want to do email marketing or build an email list, you need another platform.\n* Then your website is somewhere different entirely on wordpress or bandzoogle and others.\n\nWhat if there is a way to unify everything and it's free to use and open source?  \nThat is why I started the TribeNest project.\n\n**This is obviously not a replacement or competition for these platfor",
    "url": "https://reddit.com/r/SaaS/comments/1myycoa/free_and_open_source_all_in_one_platform_for/",
    "score": 1,
    "num_comments": 0,
    "date": "2025-08-24",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Melodic_Key_5940",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "Should my family's wholesale business expand into eCommerce? Looking for advice",
    "text": "My family has been running a successful office furniture wholesale business since 2008. We import products from China and distribute to markets in Central America and the Caribbean (we don't sell in the US market).\n\nOur business model has been pretty diverse - we've sold everything from office furniture and computer accessories to security cameras, speakers, and cables. We've been profitable since we opened and typically import around 30-40 40ft containers from China annually.\n\nNow I'm considering whether we should expand into ecommerce, possibly through platforms like Amazon. Given our established supply chain and product diversity, it seems like there could be potential, but I'm not sure about the best approach.\n\nHas anyone here made a similar transition from wholesale to ecommerce? Any advice on:\n\n* Whether it's worth pursuing given our current success\n* Platform recommendations (Amazon, Shopify, etc.)\n* Challenges we should expect when moving from B2B wholesale to direct consumer s",
    "url": "https://reddit.com/r/ecommerce/comments/1nbzy0e/should_my_familys_wholesale_business_expand_into/",
    "score": 12,
    "num_comments": 26,
    "date": "2025-09-08",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "DJA121",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "ecommerce",
    "title": "PDF Stamping Alternative to SendOwl?",
    "text": "Like many other content sellers, I've become extremely annoyed with SendOwl's pricing increase. They essentially imposed a 30x price increase with no product improvements. I get that they provide value, but the manner in which they have done this makes me not want to reward the company at all.\n\nDoes anyone have a good alternative they like that also does PDF stamping? I'm also wondering if anyone knows of an Excel piracy protection tool.\n\nSome popular options seem like e-junkie and Gumroad.",
    "url": "https://reddit.com/r/ecommerce/comments/1mtvwih/pdf_stamping_alternative_to_sendowl/",
    "score": 3,
    "num_comments": 3,
    "date": "2025-08-18",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "PeakFrameworksCom",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "shopify",
    "title": "From online shop to supplying big retail… how do you even survive the EDI nightmare?",
    "text": "We sell on Shopify + Amazon. First big retail chain reached out (yay), but they want EDI, GS1 labels, fixed delivery windows… meanwhile I’m still manually printing packing slips half the time. Anyone here pulled this off without losing their mind?",
    "url": "https://reddit.com/r/shopify/comments/1mw2xul/from_online_shop_to_supplying_big_retail_how_do/",
    "score": 14,
    "num_comments": 48,
    "date": "2025-08-21",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Gabriel_3333",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "shopify",
    "title": "Looking for bundle builder app alternatives to BYOB (inventory issue with sub-items)",
    "text": "Hey everyone,\n\nI’m running a Shopify store (example: [Maxi Party Macaron Box](https://macaronmaestro.com/products/maxi-party-macaron-box)) using the **BYOB – Build Your Own Bundle** app to let customers mix and match macarons into a gift box.\n\nThe concept works well, but there’s a major issue with inventory handling:\n\n* If a customer selects a sub-item (e.g., *Limoncello Macaron*) in a quantity higher than its available inventory (say 11 when only 10 are in stock), the **entire bundle breaks**.\n* Instead of a clear error message, the builder just says the whole bundle is *“sold out”*, leaving customers confused and not knowing what to fix.\n\nI’m looking for **alternative apps with a similar single-page builder experience** that:\n\n* Allow customers to mix and match items within inventory limits\n* Show clear, user-friendly error messages when stock is exceeded\n* Still feel smooth and intuitive like BYOB\n\nHas anyone dealt with this and found a better app? Any recommendations would be aweso",
    "url": "https://reddit.com/r/shopify/comments/1ndbyyk/looking_for_bundle_builder_app_alternatives_to/",
    "score": 6,
    "num_comments": 10,
    "date": "2025-09-10",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "thunderberen",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "shopify",
    "title": "Does more investment really means more returns?",
    "text": "I run a clothing shop and currently spend over 3,500$ per month on ads, from shooting equipment and location rentals to hiring models, editing, and posting. The good news is I’m seeing some results, but it’s still short of my expectations.\n\nI’m wondering if investing more in ads, like influencer marketing or even hiring an agency, would really help boost conversions and ROI(now they are about 1.7% and 3x). The thing is, I’m a startup and don’t want to burn cash testing blindly.\n\nAny advice or shared experience would be greatly appreciated. TIA!",
    "url": "https://reddit.com/r/shopify/comments/1neqilf/does_more_investment_really_means_more_returns/",
    "score": 16,
    "num_comments": 36,
    "date": "2025-09-12",
    "commercial_score": 5,
    "category": "cost_problems",
    "author": "Tiny_Prompt7512",
    "upvote_ratio": 0.94
  },
  {
    "subreddit": "marketing",
    "title": "For Agencies - how do  you manage various client Social Media login/passwords?",
    "text": "We use Metricool to manage our posts, but when a sign in is required to a client's facebook / instagram account we have to manually sign out and login using the client's credentials.\n\n  \nIs there a tool out there where you can have a separate browser tabs, with each tab signed in to various client's social media accounts without having to log out and log in every time?",
    "url": "https://reddit.com/r/marketing/comments/1n29218/for_agencies_how_do_you_manage_various_client/",
    "score": 3,
    "num_comments": 11,
    "date": "2025-08-28",
    "commercial_score": 5,
    "category": "workflow_problems",
    "author": "Jasoncy",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "marketing",
    "title": "Looking for Proxy IP tool recommendations",
    "text": "I manage the social media profiles of multiple clients as their social media manager. I believe I need a tool that can help me maintain the IP address consistency for my clients.\n\nMy idea is that when I work for Client A, I would use the same IP address that Client A uses to log into their LinkedIn profile. Similarly, when I work for Client B, I would change the IP address to match the one Client B uses to access their LinkedIn profile.\n\nCan anyone recommend a tool that can help with this?",
    "url": "https://reddit.com/r/marketing/comments/1n5c0l3/looking_for_proxy_ip_tool_recommendations/",
    "score": 1,
    "num_comments": 11,
    "date": "2025-09-01",
    "commercial_score": 5,
    "category": "scaling_issues",
    "author": "Sk_Sabbir_Uddin",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "digital_marketing",
    "title": "Looking for AI tools to track brand presence across different AI models",
    "text": "Our marketing manager wants me to try tracking brand mentions across the big AI chat tools like ChatGPT, Claude, and Perplexity. If anyone here has hands-on experience setting up this kind of tracking or has figured out how to connect it back to conversions or engagement, I’d love to hear about it. \n\nFor context, manager said this LLM SEO strategy is the next big thing in search and that it will give us an edge. We already do basic tracking in Search Console and have social listening dashboards sync’d to APIs. This has been working well for us already, but no matter how much I wrap my mind around them, LLMs just feel a little too unpredictable. \n\nI did my own research of course and I read that some tools like Peec, Athena, or Parse can crawl prompt responses and build share of answer metrics by sampling a set of queries. Others say these prompt tracking apps simply track citations in the retrieval step when the model pulls data from live sources. That is all well and good, but my bigge",
    "url": "https://reddit.com/r/digital_marketing/comments/1n8ah51/looking_for_ai_tools_to_track_brand_presence/",
    "score": 30,
    "num_comments": 33,
    "date": "2025-09-04",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "getgreenforall",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "freelance",
    "title": "Software for online teacher and student to keep track of lessons owed?",
    "text": "\nI work as an online freelance teacher. In most cases, students buy a package of lessons and then we book the lessons, either at the end of a lesson or using calendly. I currently keep track of the number of lessons I owe them by adding a counter in the events in google calendar. In the cases where they owe me, the counter is negative.\n\nBut the students don't have access to this counter. And sometimes there may be subtle misunderstandings about the counter. For instance, a student cancels in the last moment and they aren't aware that I have a 72h cancelling policy (because they haven't read my terms of service) so they think the lesson isn't spent. Or somtimes it's a parent paying, teenagers forget lessons... I can send emails informing of the state of the counter but would look a bit weird.\n\nI'd like to have some kind of portal where I log this, and students can see their lesson saldo, how it's recharged by certain invoices, how it's spent by certain agreed dates, etc. Is there an eas",
    "url": "https://reddit.com/r/freelance/comments/1lt9fvq/software_for_online_teacher_and_student_to_keep/",
    "score": 24,
    "num_comments": 24,
    "date": "2025-07-06",
    "commercial_score": 5,
    "category": "scaling_issues",
    "author": "flying-benedictus",
    "upvote_ratio": 0.92
  },
  {
    "subreddit": "indiehackers",
    "title": "How to find leads on Reddit without cold outreach",
    "text": "Hi Redditors! 👋\n\nI’m building **Reddlea**, a SaaS tool designed to help businesses discover potential leads **from Reddit discussions naturally**. Instead of spamming DMs or cold emails, Reddlea helps you **identify when someone is actively looking for solutions** in your niche so you can engage genuinely.\n\nIt’s still early days, and I’d love **feedback from fellow Reddit users** on how this could help communities **without being intrusive**.\n\n**No promotional links here** – just curious to hear your thoughts on **finding leads the Reddit-friendly way**.\n\nHave you ever tried finding leads on Reddit? What’s worked for you?",
    "url": "https://reddit.com/r/indiehackers/comments/1naudg9/how_to_find_leads_on_reddit_without_cold_outreach/",
    "score": 3,
    "num_comments": 26,
    "date": "2025-09-07",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Classic-Cat4870",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "indiehackers",
    "title": "Need feedback and suggestions on my idea which iam building as an alternative to X.",
    "text": "hi. iam from india. Need your feedback and suggestions ...Building direct b2c2b user engagement platform domain :consumer products  \nconsumer Brands don’t know **how many customers really like their product or hate**  (it’s just scattered tweets or commentsin X app).  \nCustomers don’t have **collective bargaining power** — one voice is ignored, but 20 engagements together get attention....Hence user engagement platform is born where more engagement leads to impact-(discounts -coupon code directly given by companies to users in campaigns) ..in future, same gets implemented to social issues.",
    "url": "https://reddit.com/r/indiehackers/comments/1ne1ngi/need_feedback_and_suggestions_on_my_idea_which/",
    "score": 2,
    "num_comments": 2,
    "date": "2025-09-11",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Horror_Implement_411",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "microsaas",
    "title": "I made a simpler alternative to Wix/Shopify/Squarespace — would love your thoughts",
    "text": "Hey folks,\n\nI kept seeing people complain about how painful it can be to actually set up a site with Wix, Shopify, or Squarespace. I felt the same way, so I decided to try building something easier — I’m calling it **PixeoCommerce**.\n\nThe idea is super straightforward:\n\n* You just fill out a form with your logo, pages, and the vibe you’re going for\n* We’ve already got 100+ templates ready\n* We handle the setup and send you back a working site\n\nSo instead of dragging boxes around for hours or stressing about settings, you basically hand us your info and get a site that’s ready to roll.\n\nSince this is still new, I’d love to hear what you think.\n\n* What would make this actually useful for you?\n* Is there something that would stop you from using it?\n* If you’ve used Wix/Shopify/Squarespace before, what annoyed you the most?\n\nI really want to shape this around what people actually need, so any feedback (good or bad) would help a ton. Thanks 🙌",
    "url": "https://reddit.com/r/microsaas/comments/1mwg01u/i_made_a_simpler_alternative_to/",
    "score": 1,
    "num_comments": 0,
    "date": "2025-08-21",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "No_Introduction6563",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "buildinpublic",
    "title": "On the left is TimeTracker.Best, a free alternative to Toggl. This is my work setup where I’m using ChatGPT Codex in the terminal and Claude Code MAX. I’m also building Refurbished.Deals — most of this tech was bought there for up to 75% off, like-new on eBay, with a free 2-year warranty.",
    "text": "Been working on a few projects lately and thought I’d share my setup.\n\n* [**TimeTracker.Best**](http://TimeTracker.Best) → a free alternative to Toggl I’m building.\n* **ChatGPT Codex + Claude Code MAX** → running side by side in the terminal to speed up dev work.\n* [**Refurbisthehed.Deals**](http://Refurbisthehed.Deals) → another project where I showcase manufacturer-approved refurbished tech. Most of my gear came from there for up to 75% off, like-new, and with a free All State 2-year warranty.\n\nAlways fun seeing how far you can push AI tools + affordable hardware. Curious to hear what setups others are running.",
    "url": "https://reddit.com/r/buildinpublic/comments/1n620wj/on_the_left_is_timetrackerbest_a_free_alternative/",
    "score": 2,
    "num_comments": 0,
    "date": "2025-09-01",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "24kTHC",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "webdev",
    "title": "ColdFusion server down, alternative to ?",
    "text": "Hello,\n\n  \none of my customers get a old windows 2000 with iis and coldfusion app down, i doesn't know this server.\n\nI managed to get back from hard drives the files and access db, but don't know how to rebuild a functionnal virtual server with this. Do you have tips to do the job, may be an alternative ?\n\nAs Railo, BlueDragon or anything ? Or old CF5 setup.exe in your \"dont delete\" folder ? :)\n\nThank you for your help",
    "url": "https://reddit.com/r/webdev/comments/1n30o8b/coldfusion_server_down_alternative_to/",
    "score": 3,
    "num_comments": 9,
    "date": "2025-08-29",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Available_Tour_9313",
    "upvote_ratio": 0.72
  },
  {
    "subreddit": "dataengineering",
    "title": "How do you manage web scraping pipelines at scale without constant breakage?",
    "text": "I’ve been tinkering with different scraping setups recently, and while it’s fun for small experiments, scaling it feels like a whole different challenge. Things like rotating proxies, handling CAPTCHAs, and managing schema changes become painful really quickly.\n\nI came across hyperbrowser while looking into different approaches, and it made me wonder if there’s actually a “clean” way to treat scraping like a proper data pipeline, similar to how we handle ETL in more traditional contexts.\n\nDo you usually integrate scraped data directly into your data warehouse or lake, or do you keep it separate first? How do you personally deal with sites that keep changing layouts so you don’t end up rewriting extractors every other week? And at what point do you just say it’s easier to buy the data instead of maintaining the scrapers?\n",
    "url": "https://reddit.com/r/dataengineering/comments/1mtr5d2/how_do_you_manage_web_scraping_pipelines_at_scale/",
    "score": 24,
    "num_comments": 23,
    "date": "2025-08-18",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "rafaelchuck",
    "upvote_ratio": 0.93
  },
  {
    "subreddit": "ProductManagement",
    "title": "What is the most annoying thing in your daily routine as a pm?",
    "text": "I‘ll start. I find irritating two things:\n1. Supporting documentation on ongoing basis. For example, in case of changes in product you need to update several docs. And if there are multiple changes through the day coming from various sources it takes a lot of time to perform this boring task.\n\n2. Creating descriptions to user stories. I have a list of them but then creating detailed descriptions for them is a really boring thing. And yes, I use ChatGPT. But then copy paste from ChatGPT is not a pleasant activity, and moreover, sometimes it loses part of the list.\n\nWhat is with you folks? How do you tackle boring things?",
    "url": "https://reddit.com/r/ProductManagement/comments/1newphn/what_is_the_most_annoying_thing_in_your_daily/",
    "score": 32,
    "num_comments": 39,
    "date": "2025-09-12",
    "commercial_score": 5,
    "category": "automation_needs",
    "author": "Empty_Ad_9654",
    "upvote_ratio": 0.9
  },
  {
    "subreddit": "sales",
    "title": "Which data company is best right now? Looking for alternative to the big one that starts with a Z",
    "text": "Can't say their name in this sub apparently but you know the one. How does Apollo or Seamless AI compare? I'm mostly interested in cell numbers. Thanks! ",
    "url": "https://reddit.com/r/sales/comments/1n0klnc/which_data_company_is_best_right_now_looking_for/",
    "score": 9,
    "num_comments": 23,
    "date": "2025-08-26",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "ProfessionalCamp2103",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "sales",
    "title": "Which data company is best right now? Looking for alternative to the big one that starts with a Z",
    "text": "Can't say their name in this sub apparently but you know the one. How does Apollo or Seamless AI compare? I'm mostly interested in cell numbers. Thanks! ",
    "url": "https://reddit.com/r/sales/comments/1n0klnc/which_data_company_is_best_right_now_looking_for/",
    "score": 10,
    "num_comments": 23,
    "date": "2025-08-26",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "ProfessionalCamp2103",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "sales",
    "title": "Sales Nav In Mail",
    "text": "Has anyone in the history of inmail ever booked a meeting using it? I’m not kidding or being sarcastic. \n\nNobody I work with has ever had success - even mass email blasts from Outreach that have unsubscribe links work sometimes…but inmail never does. \n\nAnd to be clear, I’m talking about inmail to ppl you are not connected with. Not regulars messages to someone who accepted your connection- those do randomly work. ",
    "url": "https://reddit.com/r/sales/comments/1neo5vu/sales_nav_in_mail/",
    "score": 17,
    "num_comments": 33,
    "date": "2025-09-11",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "Worldly_Adagio5425",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "accounting",
    "title": "Passed all 4 CPA exams, finished 150 college credits, while raising a small child after death of his father: Looking for an audit associate position in San Jose, CA ASAP",
    "text": "I’m a single mom who’s partner passed when my child was 9 months old. I managed to finish my bachelors degree, finish my additional college credits needed to sit for the CPA exam, and pass all 4 CPA exams, amidst coordinating  my child’s autism journey(occupational, behavioral, and speech therapy) in the last 6 years since his death, so I am proud of all that. \n\nHowever, due to me raising a small child on the spectrum and balancing my academic pursuits at the same time, my lack of work experience is hindering me from landing an associate position. My last internship was beginning of 2022, so my resume isn’t as intriguing in comparison to fresh young graduates. I know I’m resilient and a hard worker, and am willing to take on any challenge, but I don’t have connections to hiring recruiters or opportunities to attend Meet the Firms anymore. I guess the other rough part about my situation is that I’m trying to maintain living in San Jose, CA so I can be near extended family for my child. ",
    "url": "https://reddit.com/r/Accounting/comments/1n5glnu/passed_all_4_cpa_exams_finished_150_college/",
    "score": 413,
    "num_comments": 72,
    "date": "2025-09-01",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "Embarrassed-Mall2921",
    "upvote_ratio": 0.95
  },
  {
    "subreddit": "accounting",
    "title": "Need Help… seriously",
    "text": "I’ve been trying to pass the CPA for the past two years but havent been successful. I lost my job because I didnt have a cpa and now its tough finding a job without having one. I’m still trying to study for it at the same time looking for a job but every time I get in contact with the hiring manager, even though they like my experience on my resume , when i mention i dont have my cpa ( cause they ask) I see their tone immediately changing. Should i lie when asked why i lost my last job (for not having my CPA) or be honest ? I tried to be upfront once and that didnt quite work out… ",
    "url": "https://reddit.com/r/Accounting/comments/1nd0oxt/need_help_seriously/",
    "score": 17,
    "num_comments": 6,
    "date": "2025-09-10",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Turbulent_Site_7383",
    "upvote_ratio": 0.96
  },
  {
    "subreddit": "accounting",
    "title": "ADHD accountants, I need some tips",
    "text": "Tips for not messing up with number\n\nI've been recently told by my physichiatrist that I probably have ADHD. Since then, I have been taking tests by professionals to get a proper diagnosis, but it seems like I'm ADD at the very least.\n\nBut I'm preoccupied with labels. I'm overtly forgetful and tend to get distracted easily. I am an accounting student, and I often mix up numbers, which results in me failing tests (but recovering it thereafter). I often do as well as people without ADHD, yet it seems like this syndrome prevents me from reaching my ceiling.\n\nI was accepted in an internship (4 hours a day). Here, I am very insecure about forgetting or mixing up stuff.\n\nDo you have any tips for me not to mix up numbers? Like when I'm doing an assignment with too many of them and end up reading 7634,89 but writing 7634,86. This is fatal because I can get a whole test wrong for that. And now I can't confuse these numbers because it's my work, and it can get me fired at any instant.",
    "url": "https://reddit.com/r/Accounting/comments/1nfhqf3/adhd_accountants_i_need_some_tips/",
    "score": 16,
    "num_comments": 18,
    "date": "2025-09-12",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Icy-Resist-2508",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "excel",
    "title": "How do i completely remove all columns after Z?",
    "text": "I have a sheet that utilizes all the columns until S, it is currently 2k rows long and each time I copy and paste a row it freezes for a while, i tried removing automatic calculations and value validation it reduced the freezes but not by much. I read the copying an entire row copies all 16k columns of that row even if empty which causes the freezes.\n\nEdit: Turns out one column had many image objects due to staff copying text from softwares which excel for some reason treats as images. ",
    "url": "https://reddit.com/r/excel/comments/1n69917/how_do_i_completely_remove_all_columns_after_z/",
    "score": 9,
    "num_comments": 27,
    "date": "2025-09-02",
    "commercial_score": 5,
    "category": "automation_needs",
    "author": "skychi_",
    "upvote_ratio": 0.81
  },
  {
    "subreddit": "excel",
    "title": "How do I run 'if' statement on imported csv?",
    "text": "\\[I'm sure one of the methods posted will work-- I'll be trying them out on the new version of Excel- no time like the present -- Thanks to all if I miss anyone\\]\n\nMy doc wants me to give  him morning and evening bloodpressure readings.   My bluetooth cuff won't display them that way, but I can export to Excel.  \\[my current Excel is 2010- though I have a new version handy if I need it\\].      What I'd like to do is run something along the lines of \"if b=>12, move c,d,e,f to g,h,i,j \" .  That would give the Doc 2 nice columns to compare.\n\nA part of me 'knows' that this is easy, but the words to search for are escaping me.\n\nThanks\n\n",
    "url": "https://reddit.com/r/excel/comments/1n4s2kf/how_do_i_run_if_statement_on_imported_csv/",
    "score": 9,
    "num_comments": 26,
    "date": "2025-08-31",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "elbrecht",
    "upvote_ratio": 0.81
  },
  {
    "subreddit": "excel",
    "title": "Long time Excel for Windows user recently moved to Mac and looking for tips on Alt shortcuts",
    "text": "Hey everyone,\n\nI've been using Excel for years on Windows and recently moved to Mac for work reasons. Most everything is very similar these days, but I am really missing my alt shortcuts. As an example, on Excel for Windows Alt + H + F + P opens the format painter. I hadn't realized how much I had come to rely on that simple shortcut (and others like it) until I moved to Mac. Can anyone help me with similar alternatives for Mac? Is there an analogous shortcut to the alt + shortcuts on Windows?\n\nThanks in advance",
    "url": "https://reddit.com/r/excel/comments/1n80zzp/long_time_excel_for_windows_user_recently_moved/",
    "score": 1,
    "num_comments": 9,
    "date": "2025-09-04",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "ExcelMac",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "wordpress",
    "title": "Looking for a super plugin for forms",
    "text": "Hello everyone.\n\nI am looking for a form plugin that allows me to create mathematical operations, calculate costs (addition, subtraction, multiplication) between fields, etc. It should also allow me to print this as a PDF and, in turn, customize the PDF document using HTML and add more things to it. And if it's not too much to ask, it would be great if the plugin could be integrated with a payment gateway.\n\n\n\nWhich plugin would allow me to do all this?",
    "url": "https://reddit.com/r/Wordpress/comments/1mqf4yo/looking_for_a_super_plugin_for_forms/",
    "score": 5,
    "num_comments": 34,
    "date": "2025-08-14",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "jhoedram",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "shopify",
    "title": "From online shop to supplying big retail… how do you even survive the EDI nightmare?",
    "text": "We sell on Shopify + Amazon. First big retail chain reached out (yay), but they want EDI, GS1 labels, fixed delivery windows… meanwhile I’m still manually printing packing slips half the time. Anyone here pulled this off without losing their mind?",
    "url": "https://reddit.com/r/shopify/comments/1mw2xul/from_online_shop_to_supplying_big_retail_how_do/",
    "score": 14,
    "num_comments": 48,
    "date": "2025-08-21",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Gabriel_3333",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "shopify",
    "title": "Looking for bundle builder app alternatives to BYOB (inventory issue with sub-items)",
    "text": "Hey everyone,\n\nI’m running a Shopify store (example: [Maxi Party Macaron Box](https://macaronmaestro.com/products/maxi-party-macaron-box)) using the **BYOB – Build Your Own Bundle** app to let customers mix and match macarons into a gift box.\n\nThe concept works well, but there’s a major issue with inventory handling:\n\n* If a customer selects a sub-item (e.g., *Limoncello Macaron*) in a quantity higher than its available inventory (say 11 when only 10 are in stock), the **entire bundle breaks**.\n* Instead of a clear error message, the builder just says the whole bundle is *“sold out”*, leaving customers confused and not knowing what to fix.\n\nI’m looking for **alternative apps with a similar single-page builder experience** that:\n\n* Allow customers to mix and match items within inventory limits\n* Show clear, user-friendly error messages when stock is exceeded\n* Still feel smooth and intuitive like BYOB\n\nHas anyone dealt with this and found a better app? Any recommendations would be aweso",
    "url": "https://reddit.com/r/shopify/comments/1ndbyyk/looking_for_bundle_builder_app_alternatives_to/",
    "score": 6,
    "num_comments": 10,
    "date": "2025-09-10",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "thunderberen",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "notion",
    "title": "Looking for a Notion alternative on Mac that comes with a built-in system",
    "text": "I tried using Notion on my MacBook, but I find it too complicated. I don’t like setting up pages and templates from scratch.\n\nI’m looking for an app that’s ready to use right away with a clear system already built in. I just want to open it and start organizing my notes, tasks, or projects without spending a lot of time setting it up.\n\nAny suggestions for simple, Mac-friendly apps that work out of the box?\n\nThank you 🥰\n",
    "url": "https://reddit.com/r/Notion/comments/1n6f24n/looking_for_a_notion_alternative_on_mac_that/",
    "score": 35,
    "num_comments": 56,
    "date": "2025-09-02",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "Charming-Impact-7981",
    "upvote_ratio": 0.82
  },
  {
    "subreddit": "googlesheets",
    "title": "How to calculate mileage with Google Maps Formulas script?",
    "text": "I'm using [GMaps Formulas](https://www.labnol.org/google-maps-sheets-200817) to calculate the cost from point A to point B but with various starting points. I'll use \"=MULTIPLY(Q3,G3)\" but end up with the result as pictured above. I've tried various other formulas to get the number only without \"mi\" but have had no luck. Anyone else had any luck using this system to calculate prices based off distance?",
    "url": "https://reddit.com/r/googlesheets/comments/1muz7e9/how_to_calculate_mileage_with_google_maps/",
    "score": 4,
    "num_comments": 18,
    "date": "2025-08-19",
    "commercial_score": 5,
    "category": "missing_features",
    "author": "TheZeddieLittle",
    "upvote_ratio": 0.7
  },
  {
    "subreddit": "googlesheets",
    "title": "Looking for a Function for counting Conditioned cells with particular data.",
    "text": "https://preview.redd.it/zwqzzgzaqtif1.png?width=731&format=png&auto=webp&s=f3ae07dd61fe2e1c981a9c4b56fd7a3c0828b1ab\n\nI am trying to keep track of my matches in a card game I play.  I currently have a conditional formatting to turn the winning player green.  I am looking for a function to count the number of times \"\\*The Gitrog Monster\" gets formatted green and a function for counting the number of times it turned green in a given column.  Any help would be greatly appreciated!\n\n  \nEdit: This is the Conditional Formatting =NOT(ISBLANK(B4:B)) Didn't realize that would matter here.  My apologize.",
    "url": "https://reddit.com/r/googlesheets/comments/1mpb9xu/looking_for_a_function_for_counting_conditioned/",
    "score": 1,
    "num_comments": 10,
    "date": "2025-08-13",
    "commercial_score": 5,
    "category": "scaling_issues",
    "author": "Oldysian",
    "upvote_ratio": 1.0
  },
  {
    "subreddit": "PowerBI",
    "title": "Share your Power BI Automation struggles, I make YT tutorials how to solve the real life challenges!",
    "text": "Hey everyone,\n\nI’m starting a YouTube channel called Automate M365, and I want to make Power BI and Power Automate practical for real work. Instead of abstract examples, I want to build tutorials around the actual problems you’re running into.\n\nThink messy data, tricky visuals, DAX headaches, automating reports, or connecting Power BI with SharePoint, Teams, or Excel. If you drop your struggles here (or DM me), I’ll make step-by-step videos showing how to solve them.\n\nThe goal is simple: make Power BI and Power Automate easy to follow and actually useful — for beginners and people who’ve been stuck on something for ages.\n\nCheck out the channel if you want: https://youtube.com/@automatem365?si=DKEq5zxoz8l3nAOs\n\nWould love to hear your pain points and ideas — let’s turn your headaches into tutorials that help everyone!",
    "url": "https://reddit.com/r/PowerBI/comments/1ndmntm/share_your_power_bi_automation_struggles_i_make/",
    "score": 49,
    "num_comments": 43,
    "date": "2025-09-10",
    "commercial_score": 5,
    "category": "integration_problems",
    "author": "AutomateM365",
    "upvote_ratio": 0.88
  }
]